{
    "Joplin": {
        "desc": "The open source note taking application",
        "tech_stack": [
            "javascript",
            " react",
            " typescript",
            " electron",
            " React-Native"
        ],
        "topics": [
            "database",
            " search",
            " synchronisation",
            " note-taking",
            " office"
        ],
        "detail": "Joplin is a free, open source note taking and to-do application, which can handle a large number of notes organised into notebooks. The notes are searchable, can be copied, tagged and modified either from the applications directly or from your own text editor. The notes are in Markdown format. The notes can be securely synchronised via end-to-end encryption with various cloud services including Nextcloud, Dropbox, OneDrive or Joplin Cloud. Full text search is available on all platforms to quickly find the information you need. The application can be customised using plugins and themes, and you can also easily create your own. The application is available for Windows, Linux, macOS, Android and iOS.",
        "url": "https://joplinapp.org",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "https://discord.gg/VSj7AFHvpq",
        "twitter": "https://twitter.com/joplinapp"
    },
    "Open Food Facts": {
        "desc": "Better food choices for your health & the planet",
        "tech_stack": [
            "python",
            " machine learning",
            " perl",
            " tensorflow",
            " flutter"
        ],
        "topics": [
            "open data",
            " health",
            " environment",
            " mobile",
            " food"
        ],
        "detail": "Open Food Facts is the \"Wikipedia of food\". Our community collects information about all the food products in the world, using mobile phones to help people make better choices for themselves and the planet, and to transform the whole food system along the way. We do so using mobile crowdsourcing, community involvement and machine learning,",
        "url": "https://world.openfoodfacts.org/discover",
        "tags": [
            "Science and medicine",
            "End user applications"
        ],
        "discord": "mailto:contact@openfoodfacts.org",
        "twitter": "https://twitter.com/OpenFoodFacts"
    },
    "Dart": {
        "desc": "Dart is a client language for apps on any platform",
        "tech_stack": [
            "flutter",
            " dart"
        ],
        "topics": [
            "programming languages",
            " mobile apps"
        ],
        "detail": "The Dart language gives you a fast developer experience and works on any platform. Dart powers hot reload enabling you to make a code change and instantly see results in your running app, and compiles to ARM and x64 machine code enabling quick app startup times for mobile, desktop and the web. Dart powers Flutter, Google’s UI toolkit for building beautiful, natively compiled applications for mobile, web, and desktop from a single codebase.",
        "url": "https://dart.dev",
        "tags": [
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "OpenAFS": {
        "desc": "An opensource distributed filesystem product.",
        "tech_stack": [
            "c",
            " python",
            " git",
            " ansible",
            " filesystems"
        ],
        "topics": [
            "testing",
            " network",
            " storage",
            " filesystems"
        ],
        "detail": "AFS is a distributed filesystem product, pioneered at Carnegie Mellon University and supported and developed as a product by Transarc Corporation (now IBM Pittsburgh Labs). It offers a client-server architecture for federated file sharing and replicated read-only content distribution, providing location independence, scalability, security, and transparent migration capabilities. AFS is available for a broad range of heterogeneous systems including UNIX, Linux, MacOS X, and Microsoft Windows IBM branched the source of the AFS product, and made a copy of the source available for community development and maintenance. They called the release OpenAFS. The OpenAFS Foundation is dedicated to fostering the stability and growth of OpenAFS by providing strategic direction and aiming to raise money to support the development and maintenance of OpenAFS",
        "url": "https://www.openafs.org",
        "tags": [
            "Data",
            "Infrastructure and cloud"
        ],
        "discord": "mailto:foundation@openafs.org",
        "twitter": "https://lists.openafs.org/mailman/listinfo"
    },
    "LibreOffice": {
        "desc": "LibreOffice is a free and open source office suite",
        "tech_stack": [
            "python",
            " java",
            " c++"
        ],
        "topics": [
            "office suite",
            " desktop application",
            " end user application"
        ],
        "detail": "LibreOffice is a modern Free & Open Source Office suite, one of the largest open source projects, and used by millions of users worldwide. LibreOffice is compatible with many file formats like Microsoft® Word, Excel, PowerPoint and Publisher. At its heart though, LibreOffice is built around an open standard, the OpenDocument Format, as its native file format. LibreOffice is developed by users who, just like you, believe in the principles of Free Software and in sharing their work with the world in non-restrictive ways. The development of LibreOffice is supported by The Document Foundation which provides the infrastructure for the project. We believe that users should have the freedom to run, copy, distribute, study, change and improve the software that we distribute. While we do offer no-cost downloads of the LibreOffice suite of programs, Free Software is first and foremost a matter of liberty, not price. We campaign for these freedoms because we believe that everyone deserves them. Though the members of our community hail from many different backgrounds, we all value personal choice and transparency, which translates practically into wider compatibility, more utility, and no end-user lock-in to a single product. We believe that Free Software can provide better-quality, higher-reliability, increased-security, and greater-flexibility than proprietary alternatives. LibreOffice is a large project (approx. 6MLOC), which makes it interestingly complex, but at the same time, provides a place for all sorts of contribution & skills. The community behind LibreOffice is the heart of the project, without which we would not have the resources to continue developing our software. The passion and drive that every individual brings to the community results in collaborative development that often exceeds our own expectations. With tons of different roles in the project, we invite everyone to join us in our work and help us to make LibreOffice known, prosper, and accessible to all.",
        "url": "https://www.libreoffice.org/",
        "tags": [
            "End user applications"
        ],
        "discord": "https://wiki.documentfoundation.org/Development/Mailing_List",
        "twitter": "https://twitter.com/libreoffice"
    },
    "GNU Image Manipulation Program": {
        "desc": "GIMP is a cross-platform image editor",
        "tech_stack": [
            "c",
            " GEGL"
        ],
        "topics": [
            "graphics",
            " design",
            " photography",
            " illustration"
        ],
        "detail": "GIMP is a cross-platform image editor available for GNU/Linux, macOS, Windows and more operating systems. It is free software, you can change its source code and distribute your changes. Whether you are a graphic designer, photographer, illustrator, or scientist, GIMP provides you with sophisticated tools to get your job done. You can further enhance your productivity with GIMP thanks to many customization options and 3rd party plugins.",
        "url": "https://www.gimp.org/",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Cuneiform Digital Library Initiative (CDLI)": {
        "desc": "Curating humanity's oldest written sources",
        "tech_stack": [
            "mysql",
            " javascript",
            " docker",
            " php",
            " SCSS"
        ],
        "topics": [
            "linguistics",
            " History",
            " culture"
        ],
        "detail": "The Cuneiform Digital Library Initiative (CDLI) represents the efforts of an international group of Assyriologists, museum curators and historians of science to make available through the internet the form and content of cuneiform inscriptions dating from the beginning of writing, ca. 3350 BC. The number of these artifacts currently kept in public and private collections to exceed 500,000 exemplars, of which now more than 350,000 have been catalogued in electronic form by the CDLI.",
        "url": "https://cdli.ucla.edu",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://docs.google.com/forms/d/1neaY7d-IGX0Hu_x5kgJpehLnlRp0yx5PqlIMoDIYKJE",
        "twitter": "https://cdli-gh.github.io/blog/index"
    },
    "Apache Software Foundation": {
        "desc": "Open source software to the public free of charge",
        "tech_stack": [
            "c",
            " java",
            " c++"
        ],
        "topics": [
            "big data",
            " cloud",
            " libraries",
            " other"
        ],
        "detail": "The Foundation provides an established framework for intellectual property and financial contributions that simultaneously limits contributors potential legal exposure. Through a collaborative and meritocratic development process, Apache projects deliver enterprise-grade, freely available software products that attract large communities of users. The pragmatic Apache License makes it easy for all users, commercial and individual, to deploy Apache products.",
        "url": "https://apache.org",
        "tags": [
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Intel Video and Audio for Linux": {
        "desc": "We enable Linux Audio and Video for Intel",
        "tech_stack": [
            "c/c++",
            " opengl",
            " Codec",
            " Media",
            " Imaging"
        ],
        "topics": [
            "media",
            " imaging",
            " Codec"
        ],
        "detail": "We enable video/audio stack for Intel on Linux. We deliver our code to FFmpeg, FFmpeg DNN, Gstreamer, and libXCam",
        "url": "https://01.org/linuxmedia",
        "tags": [
            "Media",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "R project for statistical computing": {
        "desc": "R software for statistical computing & graphics",
        "tech_stack": [
            "c",
            " javascript",
            " c++",
            " r-project",
            " fortran"
        ],
        "topics": [
            "visualization",
            " machine learning",
            " data science",
            " graphics",
            " statistics"
        ],
        "detail": "R provides a wide variety of statistical and graphical techniques, and is highly extensible. R is often the tool of choice for research in statistical methodology. R is an integrated suite of software facilities for data manipulation, calculation and graphical display. It includes * an effective data handling and storage facility, * a suite of operators for calculations on arrays, in particular matrices, * a large, coherent, integrated collection of intermediate tools for data analysis, * graphical facilities for data analysis and display either on-screen or on hardcopy, and * a well-developed, simple and effective programming language which includes conditionals, loops, user-defined recursive functions and input and output facilities. The term “environment” is intended to characterize it as a fully planned and coherent system, rather than an incremental accretion of very specific and inflexible tools, as is frequently the case with other data analysis software. R, like S, is designed around a true computer language, and it allows users to add additional functionality by defining new functions. Much of the system is itself written in the R dialect of S, which makes it easy for users to follow the algorithmic choices made. For computationally-intensive tasks, C, C++ and Fortran code can be linked and called at run time. Advanced users can write C code to manipulate R objects directly. Many users think of R as a statistics system. We prefer to think of it of an environment within which statistical techniques are implemented. R can be extended (easily) via packages. There are about eight packages supplied with the R distribution and many more are available through the CRAN family of Internet sites covering a very wide range of modern statistics. R has its own LaTeX-like documentation format, which is used to supply comprehensive documentation, both on-line in a number of formats and in hardcopy.",
        "url": "https://www.r-project.org/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "strace": {
        "desc": "Linux syscall tracer",
        "tech_stack": [
            "c",
            " shell",
            " make",
            " autotools",
            " gawk"
        ],
        "topics": [
            "debugging",
            " tracing",
            " diagnostic"
        ],
        "detail": "strace is a diagnostic, debugging and instructional userspace utility with a traditional command-line interface for Linux. It is used to monitor and tamper with interactions between processes and the Linux kernel, which include system calls, signal deliveries, and changes of process state. The operation of strace is made possible by the kernel feature known as ptrace. strace is one of the longest running free software projects and started even before Linux started. strace is an important tool for debugging and tracing deployed on most Linux distributions with a small community of active contributors.",
        "url": "https://strace.io/",
        "tags": [
            "Development tools"
        ],
        "discord": "mailto:strace-devel@lists.strace.io",
        "twitter": "unsafe:ircs://irc.oftc.net:6697/strace"
    },
    "Processing Foundation": {
        "desc": "To empower all people to learn to program",
        "tech_stack": [
            "python",
            " javascript",
            " android",
            " java",
            " opengl"
        ],
        "topics": [
            "education",
            " web",
            " graphics",
            " creative coding",
            " design"
        ],
        "detail": "The Processing Foundation’s mission is to promote software literacy and visual literacy — and to make these fields accessible to diverse communities. The Processing Foundation was founded in 2012 after more than a decade of work with the original Processing software. The Foundation’s mission is to promote software literacy within the visual arts, and visual literacy within technology-related fields — and to make these fields accessible to diverse communities. Our goal is to empower people of all interests and backgrounds to learn how to program and make creative work with code, especially those who might not otherwise have access to these tools and resources. We do this by developing and distributing a group of related software projects, which includes Processing (Java) - processing.org, p5.js (JavaScript) - p5js.org, and Processing.py (Python) - py.processing.org, and facilitating partnerships and collaborations with allied organizations and individuals, to build a more diverse community around software and the arts. The Processing Foundation is specifically invested in expanding the communities of technology and the arts to include and support those who have not had equal access because of their race, gender, class, sexuality, and/or disability. We sponsor a Fellowship Program that funds exploratory, creative, and technical research; support an Advocacy Program, which focuses on nurturing diverse communities and their specific projects; produce public events that provide platforms for collaboration between our contributors; and take part in panels and talks that spread the word about the need for diversity in these fields.",
        "url": "http://processingfoundation.org",
        "tags": [
            "Programming languages"
        ],
        "discord": "https://twitter.com/ProcessingOrg",
        "twitter": "https://medium.com/processing-foundation"
    },
    "The ns-3 Network Simulator Project": {
        "desc": "ns-3 is a simulation tool for computer networks.",
        "tech_stack": [
            "python",
            " django",
            " c++"
        ],
        "topics": [
            "computer networking",
            " network simulation"
        ],
        "detail": "Are you interested in contributing to a widely-used performance evaluation tool for computer networking research? [ns-3](https://www.nsnam.org) is a *discrete-event, packet-level network simulator* with an emphasis on networking research and education. Users of ns-3 can construct simulations of computer networks using models of traffic generators, protocols such as TCP/IP, and devices and channels such as Wi-Fi and LTE, and analyze or visualize the results. Simulation plays a vital role in the research and education process, because of the ability for simulations to obtain reproducible results (particularly for wireless protocol design), scale to large networks, and study systems that have not yet been implemented. A particular emphasis in ns-3 is a high degree of realism in the models (including frameworks for using real application and kernel code) and integration of the tool with virtual machine environments and testbeds. Very large scale simulations are possible; simulations of hundreds of millions of nodes have been published. ns-3 has been in development since 2005 and has been making regular releases since June 2008. The simulator is written in C++, with bindings for Python scripting, and uses the CMake build system. We use a GPLv2 licensing model and heavily use mailing lists and Zulip chat, but typically not other social media.",
        "url": "https://www.nsnam.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Machine Learning for Science (ML4SCI)": {
        "desc": "Machine learning applications in science",
        "tech_stack": [
            "python",
            " machine learning",
            " c++",
            " data analysis",
            " artificial intelligence"
        ],
        "topics": [
            "machine learning",
            " science and medicine",
            " algorithms",
            " physics",
            " astronomy"
        ],
        "detail": "Machine Learning for Science (ML4SCI) is an umbrella organization for machine learning-related projects in science. ML4SCI brings together researchers from universities and scientific laboratories with motivated students to join existing scientific collaborations and contribute to cutting edge science projects across a wide variety of disciplines. Students work on existing problems to develop new machine learning-based approaches and produce open source code that directly contributes to solving these scientific challenges. ML4SCI currently includes projects from a variety of fields. For example, some of them explore the uses of machine learning for particle reconstruction and classification in high-energy physics, deep learning-based searches for dark matter in astrophysics, applications of machine learning techniques to data returned from planetary science missions, applications of quantum machine learning to science, and others. Machine learning ideas and approaches can be broadly applicable and transferable across the scientific domains. The goals of ML4SCI projects are to grow the open-source community in machine learning for science by addressing important scientific challenges and transferring the knowledge and tools of machine learning across the disciplines. We look forward to your applications!",
        "url": "https://ml4sci.org/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://simba3.web.cern.ch/simba3/SelfSubscription.aspx?groupName=ml4sci-announce",
        "twitter": "https://gitter.im/ML4SCI"
    },
    "Fortran-lang": {
        "desc": "High-performance parallel programming language",
        "tech_stack": [
            "python",
            " c++",
            " fortran"
        ],
        "topics": [
            "compilers",
            " programming languages",
            " build systems",
            " libraries",
            " Fortran"
        ],
        "detail": "Fortran-lang is an open-source community that develops tools and libraries for modern Fortran development. Our flagship projects include the standard library, Fortran build system and package manager, as well as the interactive compiler, LFortran. Fortran-lang also provides an inclusive and welcoming space for all Fortran enthusiasts around the world to collaborate.",
        "url": "https://fortran-lang.org",
        "tags": [
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CGAL Project": {
        "desc": "C++ library of computational geometry",
        "tech_stack": [
            "c++",
            " qt"
        ],
        "topics": [
            "geometry",
            " mesh processing",
            " computation geometry",
            " geometry processing"
        ],
        "detail": "CGAL is a software library that offers a number of reliable geometric data structures and algorithms. CGAL components operate in 2D and 3D, and sometime in arbitrary dimensions. Examples of components include convex hulls, convex decomposition, Delaunay triangulations, Voronoi diagrams, polygonal surface mesh data-structures, mesh generation, Boolean operations, envelope computations, intersection detection, surface reconstruction, and subdivision surfaces. CGAL is used in a variety of application domains such as CAD/CAM (computer aided design and modeling), GIS (geographic information systems), geophysics, image processing, molecular biology, robotics, motion planning, and graphics. CGAL is written in C++ and rigorously adheres to the generic-programming paradigm. CGAL became an Open Source project in 2003. Most of CGAL is under the GPL v3+ license, and some core parts are under the LGPL v3+. The semi-annual releases have currently about 10,000 downloads. CGAL is commercially supported by the spin-off company GeometryFactory.",
        "url": "https://www.cgal.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Open Technologies Alliance - GFOSS": {
        "desc": "Promote Open Standards and Open Source",
        "tech_stack": [
            "javascript",
            " c/c++",
            " nodejs",
            " python 3",
            " Machine Learning (ML)"
        ],
        "topics": [
            "web",
            " robotics",
            " open hardware",
            " c++",
            " nodered"
        ],
        "detail": "Open Technologies Alliance (GFOSS) is a non-profit organization, with 37 Universities and Research Centers as its shareholders. Our main goal is to promote Openness. GFOSS – Open Technologies Alliance is a platform for Open Standards, Free Software, Open Content, Open Data & Open Hardware in Greece. The major Greek Universities and Research Centers participate in GFOSS – Open Technologies Alliance, while leading members of the Greek community of developers play a key role in the implementation of our policies. Through our initiatives we aspire to contribute and coordinate the efforts of groups of volunteers, public servants, university researchers and students enabling them to form the backbone of Greek FOSS development and implementation. GFOSS is one of the strategic actors for the promotion of OSS throughout Greece (see https://joinup.ec.europa.eu/sites/default/files/inline-files/OSS%20Country%20Intelligence%20Report_GR.pdf ). Many public administrations and academic institutions collaborate with GFOSS to implement open source projects and through Google Summer of Code we give the opportunity to students to actively engage in the production and the actual implementation of an open source project. GFOSS also contributes and advises on the development of various open source projects related to e-government and digital transformation in Greece (e.g. https://howto.gov.gr/ - https://forma.gov.gr/) and actively promotes the use of Open Source software and hardware in the Greek primary and secondary education through the Open Educational Technologies Competition (https://openedtech.ellak.gr/ )",
        "url": "http://www.gfoss.eu",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "https://chat.ellak.gr/",
        "twitter": "mailto:info@eellak.gr"
    },
    "SymPy": {
        "desc": "SymPy is a Python library for symbolic mathematics",
        "tech_stack": [
            "python",
            " numpy",
            " jupyter"
        ],
        "topics": [
            "mathematics",
            " physics",
            " symbolic mathematics"
        ],
        "detail": "SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python.",
        "url": "https://www.sympy.org/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "AFLplusplus": {
        "desc": "State of the art fuzzing for better security",
        "tech_stack": [
            "llvm",
            " rust",
            " fuzzing",
            " qemu"
        ],
        "topics": [
            "fuzzing",
            " ci"
        ],
        "detail": "We are dedicated to provide the most effective fuzzing frameworks. Our work includes AFL++, the most effective and flexible fuzzer, and libafl, a library to build your own fuzzer with the most modern techniques and technologies.",
        "url": "https://aflplus.plus",
        "tags": [
            "Security"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Audacity": {
        "desc": "Free, open source, cross-platform audio software",
        "tech_stack": [
            "c++",
            " qt",
            " cmake",
            " wxwidgets",
            " VST"
        ],
        "topics": [
            "audio",
            " editing",
            " compression",
            " Sound",
            " Effects"
        ],
        "detail": "Audacity is a free and open-source digital audio editor and recording application for Windows, macOS and Linux. Audacity was started in the fall of 1999 by Dominic Mazzoni and Roger Dannenberg at Carnegie Mellon University and was released on May 28, 2000. As of October 24, 2020, it is the most popular download from FossHub, with over one hundred million downloads since March 2015. Previously, downloads were served from Google Code and SourceForge, with a combined total in excess of 120 million downloads. Audacity won the SourceForge 2007 and 2009 Community Choice Award for Best Project for Multimedia. Audacity is licensed under GPLv3, with large parts of the codebase available under GPLv2 or any later version. Audacity is used for a large variety of audio related purposes, ranging from audio analysis for research, editing podcasts, recording speech and music, digitising vinyl and cassettes, changing audio formats, mixing and master, applying audio effects, batch processing audio, and many more audio editing tasks. It has a long history of open-source contributions and continues to be actively developed by both full-time and part time developers.",
        "url": "https://www.audacityteam.org/",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "MIT App Inventor": {
        "desc": "Anyone can build apps with global impact.",
        "tech_stack": [
            "javascript",
            " java",
            " gwt"
        ],
        "topics": [
            "education",
            " development tools",
            " android"
        ],
        "detail": "MIT App Inventor is a free, open source web app that anyone can use to build mobile apps. It has been used by over 8 million people worldwide who have built more than 30 million apps. It is available in twelve different languages and used by people from ages 13 and up.",
        "url": "http://appinventor.mit.edu",
        "tags": [
            "Other",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Performance Co-Pilot": {
        "desc": "System performance analysis",
        "tech_stack": [
            "c",
            " grafana",
            " redis",
            " htop",
            " sysstat"
        ],
        "topics": [
            "metrics",
            " visualization",
            " distributed",
            " performance",
            " observability"
        ],
        "detail": "Performance Co-Pilot (PCP) provides a framework and services to support system-level performance monitoring and management. It presents a unifying abstraction for all of the performance data in a system, and many tools for interrogating, retrieving and processing that data. PCP is a feature-rich, mature, extensible, cross-platform toolkit supporting both live and retrospective analysis. The distributed PCP architecture makes it especially useful for those seeking centralized monitoring of distributed processing.",
        "url": "https://pcp.io/",
        "tags": [
            "Operating systems",
            "Data"
        ],
        "discord": "mailto:pcp@groups.io",
        "twitter": "https://pcp.io/community.html"
    },
    "Gentoo Foundation": {
        "desc": "A flexible, source-based Linux distribution.",
        "tech_stack": [
            "c",
            " python",
            " shell",
            " linux",
            " bash"
        ],
        "topics": [
            "operating systems",
            " security",
            " embedded",
            " init",
            " package"
        ],
        "detail": "Every user has work they need to do. The goal of Gentoo is to design tools and systems that allow a user to do that work as pleasantly and efficiently as possible, as they see fit. Our tools should be a joy to use, and should help the user to appreciate the richness of the Linux and free software community, and the flexibility of free software. This is only possible when the tool is designed to reflect and transmit the will of the user, and leave the possibilities open as to the final form of the raw materials (the source code.) If the tool forces the user to do things a particular way, then the tool is working against, rather than for, the user. We have all experienced situations where tools seem to be imposing their respective wills on us. This is backwards, and contrary to the Gentoo philosophy. Put another way, the Gentoo philosophy is to create better tools. When a tool is doing its job perfectly, you might not even be very aware of its presence, because it does not interfere and make its presence known, nor does it force you to interact with it when you don’t want it to. The tool serves the user rather than the user serving the tool. The goal of Gentoo is to strive to create near-ideal tools. Tools that can accommodate the needs of many different users all with divergent goals. Don’t you love it when you find a tool that does exactly what you want to do? Doesn’t it feel great? Our mission is to give that sensation to as many people as possible.",
        "url": "https://www.gentoo.org/",
        "tags": [
            "Operating systems"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Xfce": {
        "desc": "Lightweight and flexible linux desktop environment",
        "tech_stack": [
            "c",
            " gtk"
        ],
        "topics": [
            "desktop",
            " customization"
        ],
        "detail": "Xfce is a lightweight desktop environment for UNIX-like operating systems. It aims to be fast and low on system resources, while still being visually appealing and user friendly.",
        "url": "https://www.xfce.org/",
        "tags": [
            "Operating systems",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Open Genome Informatics": {
        "desc": "Open access genomics and bioinformatics projects",
        "tech_stack": [
            "python",
            " mysql",
            " react",
            " r-project",
            " graph"
        ],
        "topics": [
            "genomics",
            " bioinformatics",
            " cloud",
            " biology",
            " data discovery"
        ],
        "detail": "The Open Genome Informatics group represents an umbrella organization consisting of several open source and open access genomics and bioinformatics projects worldwide. Our goals are to develop and maintain a collection of sustainable software tools for managing, analyzing, visualizing, storing, and disseminating genomic data.",
        "url": "http://gmod.org/wiki/GSoC",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "mailto:%20help@gmod.org",
        "twitter": "http://groups.google.com/group/genome-informatics"
    },
    "The NetBSD Foundation": {
        "desc": "Of course it runs NetBSD",
        "tech_stack": [
            "c",
            " shell script",
            " make",
            " unix",
            " bsd"
        ],
        "topics": [
            "kernel",
            " packaging",
            " userland",
            " unix",
            " bsd"
        ],
        "detail": "NetBSD is a free, fast, secure, and highly portable Unix-like Open Source operating system. It is available for a wide range of platforms, from large-scale servers and powerful desktop systems to handheld and embedded devices. Its clean design and advanced features make it excellent for use in both production and research environments, and the source code is freely available under a business-friendly license. NetBSD is developed and supported by a large and vivid international community. Many applications are readily available through pkgsrc, the NetBSD Packages Collection.",
        "url": "https://www.NetBSD.org/",
        "tags": [
            "Operating systems",
            "Programming languages"
        ],
        "discord": "https://www.netbsd.org/mailinglists/",
        "twitter": "https://blog.netbsd.org/"
    },
    "Center for Research in Open Source Software (CROSS)": {
        "desc": "Amplifying Research Imapct through Open Source",
        "tech_stack": [
            "python",
            " c/c++",
            " verilog",
            " apache arrow",
            " matlab/simulink"
        ],
        "topics": [
            "hardware",
            " data science",
            " networking",
            " data management",
            " systems"
        ],
        "detail": "The University of California’s Center for Research in Open Source Software (CROSS) bridges the gap between academic research and successful open source projects by promoting innovative research and incubator projects maintained by UC-affiliated scientists and researchers. We transfer cutting-edge technology resulting from UC-originating research to industry via successful open source projects. Our projects are mentored and guided by a team of experts chosen specifically to best ensure success. At the start of 2022, CROSS has been working with open source projects across the UC system in order to create an open source program office (OSPO). Due to the multi-campus nature of CROSS’s current efforts, the projects we support and promote cover a wide range of open source topics and technologies - including: -Open Source Hardware -Storage Systems and Devices -System Architecture -Autonomous Vehicle Systems -Data Management -Data Analysis -Visualization All of our mentors are UC-affiliated scientists and researchers who are actively involved in open source projects.",
        "url": "https://cross.ucsc.edu/",
        "tags": [
            "Science and medicine",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CCExtractor Development": {
        "desc": "TV, rust, flutter, linux and C.",
        "tech_stack": [
            "c",
            " linux",
            " rust",
            " flutter"
        ],
        "topics": [
            "video",
            " subtitles",
            " mobile",
            " peer to peer"
        ],
        "detail": "CCExtractor Development is the creator of the de-facto captions extraction tool - CCExtractor. It is the one tool that is free, portable, open source and community managed that can take a recording from a TV show and generate an external subtitle file for it. If you regularly watch content with subtitles you download from fan sites - you should know that the source file is most likely generated by CCExtractor. If you are a student in a university that uses subtitles for natural language study, you should know that most likely we are involved somehow. While we already support subtitles from North America, Europe, Australia and more, our world map is not yet complete. We are actively looking for students that want to help us fill the gaps. We also want to automate many of the processes that are currently done manually, such as achieving perfect sync, our media file management. In addition to continuously evolve our core tool, we have a growing number of new projects: support, AI, rclone, cloud, flutter, peer-to-peer and a few more that are starting to take shape. The best part is - students have flexibility of choosing projects from a wide range of topics & technologies and even propose their own. We provide exceptional resources for students. Read more about the perks on our website. We’re very excited to take part in GSoC for the 9th time. Most of our past students are still involved and are active in the community, which simply goes on to show how friendly and approachable is the environment. If you want to be a part of such community and help achieve our goals, come join our Slack group or mailing list!",
        "url": "https://www.ccextractor.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "mailto:gsoc@ccextractor.org",
        "twitter": "https://groups.google.com/g/ccextractor-dev"
    },
    "TARDIS RT Collaboration": {
        "desc": "Exploring supernovae made easy",
        "tech_stack": [
            "python",
            " numba",
            " numpy",
            " jupyter",
            " pandas"
        ],
        "topics": [
            "visualization",
            " big data",
            " simulation",
            " astrophysics"
        ],
        "detail": "TARDIS is a tool that creates synthetic observations (spectra) for exploding stars (supernovae). A supernova marks the brilliant death throes of a star, during which it outshines its entire galaxy. Through their explosive stellar death, supernovae enrich the Universe with new elements necessary for the formation of planets and life as we know it. From the iron in your blood to the silicon in your laptop, supernovae are responsible for producing many important elements from the primordial hydrogen and helium left over from the Big Bang. TARDIS provides a link between theory and observations: by creating synthetic spectra from theoretical assumptions and comparing these to observations, we can both interpret data and test models for why, when and how supernova explosions occur. We, the community around TARDIS, are interested in combining astronomy, computer science, statistics and modern software design to build a tool that is useful both in research and teaching alike (with supporting documentation that would, in theory, allow anyone to recreate the project from scratch). Please join us on https://gitter.im/tardis-sn/gsoc.",
        "url": "https://tardis-sn.github.io",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Haskell.org": {
        "desc": "Purely functional programming language",
        "tech_stack": [
            "haskell",
            " ghc"
        ],
        "topics": [
            "compilers",
            " programming languages",
            " functional programming",
            " programming tools"
        ],
        "detail": "Haskell is an advanced, general-purpose, purely functional programming language. It has a strong, static type system with Hindley-Milner type inference. The language natively supports lazy evaluation, and lets you track side effects in the type system. This leads to a concise and declarative style of programming, which differs quite a bit from conventional languages. By controlling side effects and working with immutable data, the programmer can avoid whole classes of bugs. Haskell generally compiles to fast, native code, but it can also be compiled to other targets like JavaScript (through GHCJS) or LLVM. In Google Summer of Code, we attempt to improve not only the language, but the whole ecosystem. This includes (aside from the language itself): - Compilers - Commonly used libraries - Commonly used applications written in Haskell - Profilers, debuggers and other tools - Package managers and infrastructure We have compiled an ideas list together with long-time Haskell users, compiler contributors and researchers, and as such we believe these are important projects for the industry and academia both.",
        "url": "https://haskell.org/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "mailto:committee@haskell.org",
        "twitter": "https://www.haskell.org/irc/"
    },
    "omegaUp": {
        "desc": "Open CS Education as a catalyst for social change",
        "tech_stack": [
            "python",
            " mysql",
            " php",
            " typescript",
            " vue.js"
        ],
        "topics": [
            "education",
            " web",
            " cloud",
            " edtech",
            " UX/UI"
        ],
        "detail": "omegaUp is a non-profit organization (501c3) aimed to increase the number of talented Software Engineers in Latin America. Our open source platform omegaUp.com lets students immerse in a learning environment that fosters self paced learning of computer science skills with a democratic access to state-of-the-art learning tools. Teachers and tutors can create new coding challenges or use existing ones to start online programming competitions with local, national or even international reach, with automated grading of student's coding solutions. The omegaUp.com platform also enables teachers to leverage Competitive Programming tools and concepts inside the classroom to improve their educational experience.",
        "url": "https://omegaup.org",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Polypheny": {
        "desc": "The distributed and self-adaptive polystore",
        "tech_stack": [
            "javascript",
            " java",
            " sql",
            " angular"
        ],
        "topics": [
            "database",
            " big data",
            " cloud",
            " polystore",
            " nosql"
        ],
        "detail": "Polypheny is an adaptive database system using innovative ideas to jointly manage data in multiple models. It bridges the gap between polystores and hybrid transaction/analytical processing (HTAP) systems. In contrast to most existing polystore systems, Polypheny offers support for data manipulation queries. Furthermore, it features a flexible schema, supporting schema changes at runtime. Polypheny is a full database management system providing support for a rich set of data types. Due to its support for features like the enforcement of constraints, transactions, prepared statements, and batch queries, it even goes beyond of what many well-known DBMS provide. Moreover, Polypheny comes with integrated support for several specialized database management systems. Therefore, it is able to efficiently process heterogeneous workloads. The seamless combination of data replication and data partitioning allows to combine different underlying data storage engines in order to provide excellent query performance independent of the type of workload. Polypheny even goes a step further in terms of flexibility: With \"Data Sources\" it is possible to map data on (remote) database systems into the schema of Polypheny. It also features adapters for directly querying CSV files or file systems. Thanks to GSoC 2021, Polypheny now even has support for querying the Ethereum Blockchain. The JDBC, Python and REST query interfaces allow to easily integrate Polypheny into existing environments using industry standard techniques. It supports a broad spectrum of query languages including SQL, CQL, the MongoDB query language and the Pig query language. The powerful browser-based user interface makes managing Polypheny a pleasant experience. In conjunction with the support for multimedia data and workloads, Polypheny offers a flexibility not matched by existing database systems.",
        "url": "https://polypheny.org",
        "tags": [
            "Data"
        ],
        "discord": "https://chat.polypheny.org/",
        "twitter": "https://twitter.com/polypheny"
    },
    "Orcasound": {
        "desc": "Humans & AI listening together to save the whales.",
        "tech_stack": [
            "python",
            " javascript",
            " raspberry pi",
            " elixir",
            " NextJs"
        ],
        "topics": [
            "web",
            " audio",
            " ai",
            " acoustics",
            " community science"
        ],
        "detail": "Orcasound is an open source project that makes it easy to listen live for animals that make sounds, like the endangered orcas in Washington State (USA). We use underwater microphones (hydrophones) deployed in the habitat of the Southern Resident Killer Whales (SRKWs) to listen for the calls, whistles, and clicks they make almost continuously -- intense signals that can be heard 10 km away, often before the orcas are visible. Since a Kickstarter in mid-2017, [key members of our community](http://www.orcasound.net/hacker-hall-of-fame/) have built a [web app](live.orcasound.net) that is connected to 3 hydrophones monitoring the SRKW habitat 24/7. Version 2 of the app, launched in May 2020, lets citizen scientists indicate when they detect orca sounds in the live audio data streams, or other sounds that might harm the orcas, like sonar or noise from ships. Orcasound also maintains repositories with other open source tools that support the web app, as well as bioacoustic analysis in general, and killer whale recovery. For example, [orcanode](https://github.com/orcasound/orcanode) holds Python code and shell scripts that generate the live audio stream in lossy HLS format to optimize audio playback within modern browsers and lossless FLAC format for scientific analysis.",
        "url": "https://orcasound.net",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Oppia Foundation": {
        "desc": "Free platform for interactive, tutor-like lessons",
        "tech_stack": [
            "python",
            " android",
            " google app engine",
            " angular",
            " typescript"
        ],
        "topics": [
            "education",
            " web",
            " community",
            " nonprofit",
            " social impact"
        ],
        "detail": "The Oppia project aims to empower learners across the globe by providing access to high-quality, engaging education. We envision a world where access to high-quality education is not a privilege but a human right. The team works on two platforms: (a) Oppia Web, which provides an online learning tool that enables anyone to learn from effective and engaging interactive lessons (called 'explorations'), which simulate a one-on-one conversation with a tutor. This format makes it possible for students to learn by doing while getting feedback. The Oppia Web platform also provides the infrastructure needed to support lesson creation and translation. (b) Oppia Android, which provides a way for these lessons to be played offline on an Android app that supports low-end devices and does not require Internet connectivity. As a community, we are also aware that millions of students in underserved communities lack access to the educational resources necessary to effectively learn key skills like basic numeracy. Thus, in addition to developing the Oppia platform, the team has launched and continues to develop a set of free and effective lessons on basic mathematics, supplemented by translations and voiceovers. Students using these lessons have shown strong improvements between pre-and post-tests, and we’ve received lots of positive feedback on them. We are planning to extend this offering to other subjects, based on what students (and the nonprofits working with them) tell us would be most useful.",
        "url": "https://www.oppia.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "https://medium.com/oppia-org",
        "twitter": "https://twitter.com/oppiaorg?lang=en"
    },
    "Flashrom": {
        "desc": "Reading, writing, verifying, erasing flash chips",
        "tech_stack": [
            "c",
            " x86",
            " bios",
            " rom",
            " spi"
        ],
        "topics": [
            "hardware",
            " drivers",
            " firmware",
            " flash chips",
            " low level programming"
        ],
        "detail": "Flashrom is a utility for identifying, reading, writing, verifying and erasing flash chips. It is designed to flash BIOS/EFI/coreboot/firmware/optionROM images on mainboards, network/graphics/storage controller cards, and various other programmer devices. + Supports more than 476 flash chips, 291 chipsets, 500 mainboards, 79 PCI devices, 17 USB devices and various parallel/serial port-based programmers. + Supports parallel, LPC, FWH and SPI flash interfaces and various chip packages (DIP32, PLCC32, DIP8, SO8/SOIC8, TSOP32, TSOP40, TSOP48, BGA and more) + No physical access needed, root access is sufficient (not needed for some programmers). + No bootable floppy disk, bootable CD-ROM or other media needed. + No keyboard or monitor needed. Simply reflash remotely via SSH. + No instant reboot needed. Reflash your chip in a running system, verify it, be happy. The new firmware will be present next time you boot. + Crossflashing and hotflashing is possible as long as the flash chips are electrically and logically compatible (same protocol). Great for recovery. + Scriptability. Reflash a whole pool of identical machines at the same time from the command line. It is recommended to check Flashrom output and error codes. + Speed. Flashrom is often much faster than most vendor flash tools. + Portability. Supports DOS, Linux, FreeBSD (including Debian/kFreeBSD), NetBSD, OpenBSD, DragonFlyBSD, anything Solaris-like, Mac OS X, and other Unix-like OSes as well as GNU Hurd. Partial Windows support is available (no internal programmer support at the moment, hence no \"BIOS flashing\").",
        "url": "https://www.flashrom.org/",
        "tags": [
            "Operating systems",
            "End user applications"
        ],
        "discord": "mailto:flashrom@flashrom.org",
        "twitter": "https://www.flashrom.org/Contact"
    },
    "Internet Health Report": {
        "desc": "Monitoring the Internet",
        "tech_stack": [
            "python",
            " javascript",
            " apache kafka",
            " VueJS"
        ],
        "topics": [
            "networking",
            " routing",
            " communication",
            " internet",
            " data analytics"
        ],
        "detail": "The Internet Health Report monitors the conditions of networks that compose the Internet. It aims to provide network operators, policymakers, and other stakeholders, with a better understanding of the Internet's infrastructure and its evolution.",
        "url": "https://ihr.iijlab.net",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Django Software Foundation": {
        "desc": "Web framework for perfectionists with deadlines",
        "tech_stack": [
            "python",
            " django"
        ],
        "topics": [
            "web",
            " python"
        ],
        "detail": "Django is a high-level Python Web framework originally developed at the Lawrence-Journal World. Django was designed to handle two challenges: the intensive deadlines of a newsroom and the stringent requirements of the experienced Web developers who wrote it. It lets you build high-performing, elegant Web applications quickly.",
        "url": "https://www.djangoproject.com",
        "tags": [
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "OpenMRS": {
        "desc": "Write Code, Save Lives.",
        "tech_stack": [
            "mysql",
            " javascript",
            " java",
            " fhir",
            " Cypress"
        ],
        "topics": [
            "platform",
            " Electronic Medical Record System"
        ],
        "detail": "OpenMRS provides the foundational, electronic medical record technology for more than 6,500 health facilities in over 40 countries, touching and helping millions of patients throughout the world. The OpenMRS Community’s mission is to improve healthcare delivery in resource-constrained environments. We coordinate a global community that creates and sustains a robust, scalable, user-driven and open-source medical record platform and reference frontend application. We maintain a platform that countries and implementers use to create a customized EMR system in response to actual needs on the ground.",
        "url": "https://openmrs.org/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Keptn": {
        "desc": "Event-driven orchestration of cloud-native apps",
        "tech_stack": [
            "golang",
            " kubernetes",
            " angular",
            " Helm"
        ],
        "topics": [
            "cloud",
            " devops",
            " sre",
            " CloudNative",
            " Operations"
        ],
        "detail": "Keptn is an event-driven orchestration engine for cloud-native apps. Started in 2018, it is a member project of the Cloud Native Computing Foundation. Keptn uses a declarative approach to build scalable automation for delivery and operations which can be scaled to a large number of services. It evaluates Service Level Indicators (SLOs) and provides a dashboard, alerts, and auto-remediation for them. Keptn has numerous integrations with the Cloud Native ecosystem, including Prometheus, ArgoCD, CloudEvents, LithmusChaos, Backstage, and dozens of other cloud-native projects. In Google Summer of Code we invite you to join the Keptn community and to work together with us on one of the Keptn integrations or on automating modern management approaches like GitOps and Documentation as Code.",
        "url": "https://keptn.sh/",
        "tags": [
            "Infrastructure and cloud",
            "Development tools"
        ],
        "discord": "https://twitter.com/keptnProject",
        "twitter": "https://keptn.sh/community/newsletter/"
    },
    "MoveIt": {
        "desc": "Moving robots into the future",
        "tech_stack": [
            "ros",
            " c++"
        ],
        "topics": [
            "robotics",
            " motion planning",
            " trajectory generation",
            " kinematics"
        ],
        "detail": "MoveIt is the most widely used software for robotic manipulation and has been used on over 150 robots. It is released under the terms of the BSD license, and thus free for industrial, commercial, and research use. By incorporating the latest advances in motion planning, manipulation, 3D perception, kinematics, control and navigation, MoveIt is state of the art software for mobile manipulation.",
        "url": "https://moveit.ros.org",
        "tags": [
            "Science and medicine",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "LibreHealth": {
        "desc": "Healthcare for Humanity",
        "tech_stack": [
            "python",
            " javascript",
            " android",
            " java",
            " dart/flutter"
        ],
        "topics": [
            "web",
            " deep learning",
            " hfoss",
            " radiology",
            " mobile apps"
        ],
        "detail": "LibreHealth is the foundation of a worldwide ecosystem of open source Health IT innovation and is a place where people can come together to build tools that enhance the quality of healthcare around the world. We currently have under our umbrella the following projects: - LibreHealth Toolkit (http://librehealth.io/projects/lh-toolkit/), a foundational base for - building Health IT tools - LibreHealth EHR (http://librehealth.io/projects/lh-ehr/), an electronic health record derived from best practices and technology from leading open source systems. - LibreHealth Radiology (https://librehealth.io/projects/lh-radiology), a specialized distribution of LibreHealth Toolkit customized for radiology healthcare professionals Our GSoC student projects will address the real-life needs of our projects to help improve the delivery of health care around the world. We have a team of expert mentors with decades of experience to help you in your work. They will be continually adding project ideas to our forum (https://forums.librehealth.io), and we encourage you to suggest ideas too as you learn more about our projects. Check out project ideas (this will change from year to year): https://forums.librehealth.io/ideas",
        "url": "https://librehealth.io",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://forums.librehealth.io/",
        "twitter": "https://twitter.com/LibreHealthIO"
    },
    "VideoLAN": {
        "desc": "Open source believers rocking the multimedia world",
        "tech_stack": [
            "c",
            " c++",
            " qt",
            " assembly",
            " video"
        ],
        "topics": [
            "audio",
            " streaming",
            " video",
            " codecs",
            " media database"
        ],
        "detail": "The VideoLAN project is led by and composed of a team of volunteers who believe in the power of open source to rock the multimedia world. We produce multimedia software notably the famous VLC media player as well as designated libraries and codecs.",
        "url": "https://www.videolan.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Wellcome Sanger Tree of Life": {
        "desc": "Genome analysis across the whole tree of life",
        "tech_stack": [
            "python",
            " javascript",
            " rust",
            " nextflow"
        ],
        "topics": [
            "genomics",
            " bioinformatics",
            " data analysis",
            " genome assembly"
        ],
        "detail": "The Tree of Life programme of the Sanger Institute is generating high-quality reference genome assemblies for thousands of species, and releasing them to the community to help decipher genome function and organisation, and improve our understanding of biodiversity. Novel software and methods are required for the processing of this vast amount of data.",
        "url": "https://www.sanger.ac.uk/programme/tree-of-life/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "libvirt": {
        "desc": "Virtualization abstraction library",
        "tech_stack": [
            "kvm",
            " hypervisor",
            " qemu",
            " lxc"
        ],
        "topics": [
            "virtualization",
            " library"
        ],
        "detail": "Libvirt is a library and toolkit providing abstraction for various hypervisors. It can be used from a number of languages.",
        "url": "https://libvirt.org/",
        "tags": [
            "End user applications",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "PowerDNS": {
        "desc": "PowerDNS provides open source DNS software",
        "tech_stack": [
            "c++",
            " DNS"
        ],
        "topics": [
            "DNS recursive solutions",
            " Authoritative DNS software"
        ],
        "detail": "PowerDNS is a suite of open source DNS software, consisting of the Authoritative Server, the PowerDNS Recursor , and dnsdist.",
        "url": "https://www.powerdns.com/",
        "tags": [
            "Other",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Debian": {
        "desc": "The Universal Operating System",
        "tech_stack": [
            "c",
            " python",
            " java",
            " ruby",
            " perl"
        ],
        "topics": [
            "web",
            " robotics",
            " graphics",
            " cloud",
            " SDR"
        ],
        "detail": "The Debian Project is an association of Free Software developers who volunteer their time and effort in order to produce and maintain a completely free operating system Debian. Since its launch, the Debian project has grown to comprise more than 1,000 members with official developer status, alongside many more volunteers and contributors. Today, Debian encompasses over 50,000 packages of free, open source applications and documentation.",
        "url": "https://debian.org",
        "tags": [
            "Operating systems",
            "End user applications"
        ],
        "discord": "mailto:outreach@debian.org",
        "twitter": "https://bits.debian.org/"
    },
    "freifunk": {
        "desc": "Free and open wireless networks",
        "tech_stack": [
            "c",
            " python",
            " javascript",
            " openwrt",
            " gnu/linux"
        ],
        "topics": [
            "embedded systems",
            " open hardware",
            " routing",
            " wireless networks",
            " federation"
        ],
        "detail": "Freifunk unites wireless communities like Ninux, qaul.net, Guifi.net, and Evernet e.G. Our communities extensively rely on OpenWRT Linux, OLSR, BATMAN, libremesh, or retroshare. Our communities build decentralized wireless network architectures based on embedded networking hardware such as WiFi routers. The contributions are made by individuals and local groups which are highly motivated to build open and free wireless networks providing Internet access to everybody. Moreover, we also create solutions that allow anonymous and secure communication. Most wireless routers in our networks are based on affordable, off-the-shelf devices such as WiFi routers. The Freifunk operating system extends the OpenWrt Linux OS by additional software packages that enable multi-hop wireless mesh networking and new P2P communication features.",
        "url": "https://freifunk.net/en",
        "tags": [
            "Operating systems",
            "Infrastructure and cloud"
        ],
        "discord": "https://matrix.to/#/#freifunk-gsoc2021:bau-ha.us",
        "twitter": "https://twitter.com/freifunk"
    },
    "GNSS-SDR": {
        "desc": "An open source GNSS software-defined receiver",
        "tech_stack": [
            "c",
            " c++",
            " sdr"
        ],
        "topics": [
            "gnss",
            " geolocation",
            " navigation",
            " software defined radio",
            " communications"
        ],
        "detail": "GNSS-SDR is an open source Global Navigation Satellite Systems software receiver, written in C++, that is able to work either from raw signal samples stored in a file, or in real-time with a radio-frequency front-end as signal source, and performs all the signal processing until the observable computation and Position-Velocity-Time solution. Its modularity allows users to populate the framework with their own algorithms, allowing to put the focus on the signal processing implementation without worrying about how to embed that algorithm in a whole GNSS receiver. It also makes possible fair performance benchmarks using real GNSS signals, and its open source license allows free downloading, use and code inspection. The proposed software receiver targets multi-constellation/multi-frequency architectures, pursuing the goals of efficiency, modularity, interoperability, and flexibility demanded by user domains that require non-standard features, such as earth observers or geodesists, and allowing applications such as the observation of the ionosphere, GNSS reflectometry, signal quality monitoring, space weather, and high-accuracy positioning based on carrier-phase navigation techniques. In this project, we focus on signal processing, understood as the process between the ADC and the computation of code and phase observables, including the demodulation of the navigation message. We purposely omit data processing, understood as the computation of the navigation solution from the observables and the navigation message, since there are a number of well-established libraries and applications for that (also in the open source side, such as GPSTk or RTKLIB).",
        "url": "https://gnss-sdr.org/",
        "tags": [
            "Science and medicine",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "The Palisadoes Foundation": {
        "desc": "Transforming non-profit organizations in the cloud",
        "tech_stack": [
            "mongodb",
            " node.js",
            " flutter",
            " graphql",
            " typescript"
        ],
        "topics": [
            "web",
            " api",
            " database",
            " cloud",
            " mobile"
        ],
        "detail": "The Palisadoes Foundation’s open-source software projects support community groups in organising their daily activities. A significant proportion of our software contributions come from university students studying software engineering. Participants often come from under-served communities or geographic areas and are sponsored through our various programs. This prepares them for the competitive realities of the working world. Life started for us in 2016 when a group of expatriate Jamaicans wanted to assist development of new and existing information technologies for the island’s social good. We knew academic and student leadership wanted greater practical exposure to the latest technology. In response, our pilot Calico program for Jamaican universities was created with the goal of addressing the issues graduates would face when employed. After five years of success, members of the Jamaican diaspora suggested we expand our service area to be global. They saw similar needs in their own under-served communities where the digital divide is very visible and thought our experience in the developing world would be useful. For the past four years we have focused on creating a mobile app to help community organizations like ourselves better manage their membership. We saw the need for a social media component to keep in contact with our volunteers. We also felt these organizations often faced challenges with the project management of events and keeping track of volunteer abilities, roles and responsibilities. We want to make the app useful for any community-based organization such as clubs, small religious institutions, neighborhood groups, and volunteer associations. We also want to see how the open source software could be installed as a multi-tenant, multi-site cloud hosted service as many of these organizations often don’t have sufficient IT skills to do so independently. We hope that our contributors will help us achieve this goal in 2022.",
        "url": "https://www.palisadoes.org",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "https://www.freelists.org/list/palisadoes",
        "twitter": "https://www.palisadoes.org/news/"
    },
    "MDAnalysis": {
        "desc": "Analysis of molecular simulations data with Python",
        "tech_stack": [
            "python",
            " cython",
            " c/c++"
        ],
        "topics": [
            "science",
            " computational-chemistry",
            " high-performance-computing",
            " molecular-simulation",
            " soft-matter-physics"
        ],
        "detail": "MDAnalysis is a Python library for the analysis of computer simulations of many-body systems at the molecular scale, spanning use cases from interactions of drugs with proteins to novel materials. It is written by scientists for scientists and is used for cutting edge research in biophysics, chemistry, soft-matter physics, and materials research around the world in academia and national research labs. MDAnalysis strives to be highly interoperable and hence a growing number of projects use MDAnalysis as their foundational library or integrate it. The goal of MDAnalysis is to make it easy for users to analyze data that are produced by simulations (primarily molecular dynamics simulations) that run on some of the largest supercomputers in the world. MDAnalysis accomplishes this goal by providing a toolkit of programming building blocks that provide an abstract Python interface to the simulation data — agnostic of the specific simulation package that produced it — that lends itself to interactive data exploration and rapid prototyping but is also a robust foundational library that can form the basis for new computational tools. MDAnalysis allows one to read particle-based trajectories such as the ones produced by MD simulations or individual coordinate frames (such as biomolecules in the Protein Databank format) and access the atomic coordinates through NumPy arrays. Together with a powerful selection language and many implemented analysis algorithms, MDAnalysis provides a flexible and fast framework for complex analysis tasks. Welcoming documentation such as the User Guide https://userguide.mdanalysis.org/ make it easy to get started. New releases are downloaded a few thousand times and the academic papers describing MDAnalysis are cited more than almost two thousand times, indicating the widespread use in the academic community.",
        "url": "https://www.mdanalysis.org",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://twitter.com/mdanalysis",
        "twitter": "https://www.mdanalysis.org/blog/"
    },
    "Kart Project": {
        "desc": "Distributed version-control for geospatial data",
        "tech_stack": [
            "python",
            " c++",
            " git",
            " gis"
        ],
        "topics": [
            "version control",
            " gis",
            " data",
            " point clouds",
            " spatial"
        ],
        "detail": "We’re drowning in data, but the geospatial world lags badly behind in versioning tools compared to our software counterparts. Kart is solving this with a practical open tool for versioning datasets, enabling you to work more efficiently and collaborate better.",
        "url": "https://kartproject.org",
        "tags": [
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Swift": {
        "desc": "Fast, safe, and expressive programming language",
        "tech_stack": [
            "c++",
            " cmake",
            " swift"
        ],
        "topics": [
            "compilers",
            " cross-platform",
            " Packages",
            " Server development",
            " Standard Libraries"
        ],
        "detail": "Swift is a general-purpose programming language built using a modern approach to safety, performance, and software design patterns. The goal of the Swift project is to create the best available language for uses ranging from systems programming, to mobile and desktop apps, scaling up to cloud services. Most importantly, Swift is designed to make writing and maintaining correct programs easier for the developer.",
        "url": "https://swift.org",
        "tags": [
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "JabRef e.V.": {
        "desc": "Open Source bibliography manager",
        "tech_stack": [
            "java",
            " javafx",
            " bibtex"
        ],
        "topics": [
            "science",
            " library",
            " literature",
            " latex"
        ],
        "detail": "JabRef is one of the most widely used citation and reference management tools. It helps students and researchers to stay on top of their literature by assisting at every step of a research project: collecting and organizing literature sources, discovering the latest research, citing references in LaTeX and other text editors, and sharing interesting papers with collaborators. JabRef is open-source and cross-platform. It is written in Java using JavaFX as the user interface technology. It is licensed under the MIT license. Since 2020 JabRef is maintained by the non-profit organization JabRef e.V.",
        "url": "https://www.jabref.org/",
        "tags": [
            "Science and medicine",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "JdeRobot": {
        "desc": "Toolkit for developing Robotics applications",
        "tech_stack": [
            "python",
            " ros",
            " gazebo",
            " opencv",
            " tensorflow"
        ],
        "topics": [
            "education",
            " artificial intelligence",
            " robotics",
            " computer vision",
            " developer tools"
        ],
        "detail": "Robotics applications are typically distributed, made up of a collection of concurrent asynchronous components which communicate using some middleware (ROS messages, DDS...). Building robotics applications is a complex task. Integrating existing nodes or libraries that provide already solved functionality, and using several tools may increase the software robustness and shorten the development time. JdeRobot provides several tools, libraries and reusable nodes. They have been written in C++, Python or JavaScript. Our community mainly works on four development areas: 1.- Education in Robotics * RoboticsAcademy (https://jderobot.github.io/RoboticsAcademy/): a ROS-based framework to learn robotics and computer vision with drones, autonomous cars.... It is a collection of Python programmed exercises for engineering students. * Unibotics: a web based framework for teaching robotics. 2.- Robot Programming Tools * VisualCircuit (https://jderobot.github.io/VisualCircuit/) for robot programming with connected blocks, as in electronic circuits, in a visual way * VisualStates for robot programming with Finite State Machines in a visual way * WebSim2D robot simulator with web technologies 3.- MachineLearning in Robotics * DeepLearningSuite: neural networks for robot control. It includes the BehaviorMetrics tool for assessment of neural networks for autonomous driving * RL-Studio: Robotic library for the training of Reinforcement Learning algorithms * DetectionMetrics tool for evaluation of visual detection neural networks and algorithms 4.- FPGAs in Robotics * FPGA-robotics (https://github.com/JdeRobot/FPGA-robotics): programming robots with reconfigurable computing (FPGAs) using open tools as IceStudio and Symbiflow. Verilog-based reusable blocks for robotics applications. * NeuralFPGA: running deeplearning networks on FPGAs",
        "url": "http://jderobot.github.io",
        "tags": [
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "moja global": {
        "desc": "Collaboration for change",
        "tech_stack": [
            "python",
            " javascript",
            " c++",
            " docker",
            " Data-Science"
        ],
        "topics": [
            "climate monitoring",
            " nature based solutions",
            " land system modelling"
        ],
        "detail": "Open source MRV software for forestry, agriculture and other land uses; democratising technology for nature based solutions and greenhouse gas accounting.",
        "url": "https://moja.global",
        "tags": [
            "Data",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Metasploit": {
        "desc": "World’s most used penetration testing framework",
        "tech_stack": [
            "c",
            " python",
            " postgresql",
            " ruby",
            " assembly"
        ],
        "topics": [
            "security",
            " penetration testing",
            " offensive security",
            " exploitation"
        ],
        "detail": "The Metasploit Framework is both a penetration testing system and a development platform for creating security tools and exploits. The framework is used by network security professionals to perform penetration tests, system administrators to verify patch installations, product vendors to perform regression testing, and security researchers world-wide. The framework is written in the Ruby programming language and includes components written in C, many flavors of Assembly, Python, Powershell, PHP, and other languages. The framework consists of tools, libraries, modules, and user interfaces. The basic function of the framework is a module launcher, allowing the user to configure an exploit module and launch it at a target system. If the exploit succeeds, the payload is executed on the target and the user is provided with a shell to interact with the payload. Hundreds of exploits and dozens of payload options are available.",
        "url": "https://metasploit.com",
        "tags": [
            "Security"
        ],
        "discord": "mailto:msfdev@metasploit.com",
        "twitter": "https://twitter.com/metasploit"
    },
    "KDE Community": {
        "desc": "International team developing Open Source software",
        "tech_stack": [
            "c++",
            " qt",
            " qml",
            " data structures"
        ],
        "topics": [
            "education",
            " science",
            " applications",
            " desktop environment"
        ],
        "detail": "Community of technologists, designers, writers and advocates who work to ensure freedom for all people through our software.",
        "url": "https://kde.org/",
        "tags": [
            "End user applications"
        ],
        "discord": "https://mail.kde.org/mailman/listinfo/kde-devel",
        "twitter": "https://userbase.kde.org/IRC_Channels"
    },
    "Unikraft": {
        "desc": "Unikraft is a fast and secure unikernel SDK",
        "tech_stack": [
            "c",
            " python",
            " xen",
            " kvm",
            " assembly language"
        ],
        "topics": [
            "virtualization",
            " cloud",
            " software reuse",
            " software configurability"
        ],
        "detail": "Unikraft is a fast, secure and open-source Unikernel Development Kit. By tailoring the operating system, libraries and configuration to the particular needs of your application, it vastly reduces virtual machine and container image sizes to a few KBs, provides blazing performance, and drastically cuts down your software stack’s attack surface. Unikraft is developed in the spirit of open source: public discussions on Discord, open source licensing model using BSD-3-Clause, public development and management on GitHub. It does so in the context of a vibrant community consisting of highly skilled software engineers, researchers, teachers, students and hobbyists. Periodic meetings, hackathons and a consistent presence in open source events are central to the well functioning of the community. We use guidelines for development and maintenance to ensure the creation of high quality code. Public releases are planned to happen once every two months. In general, we aim for a public release to happen at the last Monday of each odd month (January, March, May, etc.) We welcome contributors and users on Discord and on GitHub. If you are looking for a fun technical project in the area of operating systems, virtualization, come aboard on Discord.",
        "url": "https://unikraft.org/",
        "tags": [
            "Operating systems",
            "Infrastructure and cloud"
        ],
        "discord": "https://github.com/unikraft/unikraft/discussions",
        "twitter": "https://twitter.com/unikraftsdk"
    },
    "Forschungszentrum Jülich": {
        "desc": "Shaping change: open source for Big Science",
        "tech_stack": [
            "python",
            " mpi",
            " high performance computing",
            " pytorch",
            " gpu"
        ],
        "topics": [
            "neuroscience",
            " data analytics",
            " astrophysics",
            " data-intensive science",
            " earth-system monitoring"
        ],
        "detail": "Conducting research for a changing society: This is what drives us at Forschungszentrum Jülich. As a member of the Helmholtz Association, we aim to tackle the grand societal challenges of our time and conduct research into the possibilities of a digitized society, a climate-friendly energy system, and a resource-efficient economy. Supercomputers help us find solutions to major scientific challenges and are indispensable for modern research. The Jülich Supercomputing Centre (JSC) operates the most powerful computer systems for scientific and technical applications in Europe and makes it available for research purposes to scientists at Forschungszentrum Jülich, in Germany, and throughout Europe. JSC performs various research and development tasks, frequently in tight cooperation with national and international partners. With our open-source Python library Heat, we make it possible for researchers to transition seamlessly from scipy-based, single-node data analysis tools, to memory-distributed, hardware-accelerated, high-performance data analytics.",
        "url": "https://fz-juelich.de/en",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "mailto:b.hagemeier@fz-juelich.de",
        "twitter": "https://github.com/helmholtz-analytics/heat/discussions/919"
    },
    "OWASP Foundation": {
        "desc": "No more insecure software.",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " ZAP",
            " Juice Shop"
        ],
        "topics": [
            "web",
            " cloud",
            " application security",
            " cybersecurity",
            " DevSecOps"
        ],
        "detail": "As the world’s largest non-profit organization concerned with software security, OWASP: * Supports the building of impactful projects; * Develops & nurtures communities through events and chapter meetings worldwide; * Provides educational publications & resources in order to enable developers to write better software, and security professionals to make the world's software more secure.",
        "url": "https://owasp.org",
        "tags": [
            "Security"
        ],
        "discord": "https://owasp.org/slack/invite",
        "twitter": "https://groups.google.com/g/owasp-gsoc?pli=1"
    },
    "Eclipse Foundation": {
        "desc": "The Global Open Source Foundation",
        "tech_stack": [
            "java",
            " che",
            " deeplearning",
            " eclipsejavaide",
            " jakartaee"
        ],
        "topics": [
            "robotics",
            " automotive",
            " tools",
            " cloud native java",
            " iot & edge"
        ],
        "detail": "The Eclipse Foundation provides our global community of individuals & organizations with a mature, scalable, and business-friendly environment for OSS collaboration and innovation. Eclipse is an open source community that's focused around key principles of transparency, openness, and vendor neutrality: the work that we do is done in a manner that can be observed by anybody with an interest; project teams welcome new ideas, and invites others to participate; and vendor neutrality ensures that no single vendor can dominate a project and that everybody plays by the same set of rules (a so-called \"level playing field\"). Naturally, Eclipse projects are also all about the code. With over three hundred and sixty (https://projects.eclipse.org/) open source projects covering a diverse set of of technologies, there's something here for everybody. Eclipse projects build technology in areas such as Internet of Things (https://projects.eclipse.org/technology-type/internet-things), Programming Languages and IDE (https://projects.eclipse.org/technology-type/language), and Runtimes (https://projects.eclipse.org/technology-type/runtime) like Jetty and EE4J (http://www.eclipse.org/ee4j) (currently known as Java EE). For those students interested in research, we have an entire working group focused on Science (https://projects.eclipse.org/projects/science) where researches from some of the world's most prestigious labs do open source development to support their research areas.",
        "url": "https://www.eclipse.org/",
        "tags": [
            "Programming languages",
            "Infrastructure and cloud"
        ],
        "discord": "mailto:emo@eclipse-foundation.org",
        "twitter": "https://twitter.com/EclipseFdn"
    },
    "GitLab": {
        "desc": "Everyone can contribute",
        "tech_stack": [
            "javascript",
            " ruby on rails",
            " go",
            " ruby",
            " vue"
        ],
        "topics": [
            "cloud",
            " devops"
        ],
        "detail": "GitLab is The DevOps Platform that empowers organizations to maximize the overall return on software development by delivering software faster and efficiently, while strengthening security and compliance. With GitLab, every team in your organization can collaboratively plan, build, secure, and deploy software to drive business outcomes faster with complete transparency, consistency and traceability.",
        "url": "https://gitlab.com",
        "tags": [
            "Infrastructure and cloud",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Synfig": {
        "desc": "Open-source 2D animation software",
        "tech_stack": [
            "python",
            " c++",
            " gtk",
            " gtkmm"
        ],
        "topics": [
            "2d/3d graphics",
            " animation",
            " vector graphics"
        ],
        "detail": "Synfig is a 2D open-source animation software. It is capable to produce vector artwork and also can work with bitmap images. The main concept of Synfig is \"tweening\" - you can define object positions or shapes of vector objects at certain points of time and program will interpolate in-between frames automatically. You can also use bones to control your animation on higher level. With Synfig you can easily create motion graphics and cut-out animations for product explanation videos, tutorial videos, and more.",
        "url": "https://synfig.org",
        "tags": [
            "Media"
        ],
        "discord": "https://www.synfig.org/news/",
        "twitter": "https://twitter.com/synfig"
    },
    "Open Bioinformatics Foundation (OBF)": {
        "desc": "Open Source & Open Science in biological research",
        "tech_stack": [
            "python",
            " javascript",
            " c++",
            " html/css",
            " Git/GitHub"
        ],
        "topics": [
            "open science",
            " genomics",
            " bioinformatics",
            " workflows",
            " Open Source Bioinformatics"
        ],
        "detail": "The Open Bioinformatics Foundation (OBF) is a non-profit, volunteer-run group dedicated to promoting the practice and philosophy of Open Source software development and Open Science within the biological research community. Our main activities are: running and supporting the BOSC conferences; organizing and supporting developer-centric \"Hackathon\" events; participating in the Google Summer of Code program on behalf of our member projects as an umbrella mentoring organization; managing servers, colocation facilities, bank account, domain names, and other assets for the benefit of our member projects; public opinion and policy statements about matters related to Open Source and Open Science in bioinformatics. The Foundation does not participate directly in the development or structure of the open source work, but as the members of the foundation are drawn from our projects' developer communities, there is clear commonality of direction and purpose. The OBF is governed by a Board of Directors. Our bylaws lay out how the Board is elected, holds public meetings, and conducts its business, as well as the scope and role of our membership. OBF is an associated project with Software In The Public Interest, Inc., a fiscal sponsorship organization, and through SPI we can accept tax-exempt charitable donations. The OBF is open to anyone who is interested in promoting open source bioinformatics / open science. Please see the Membership page (https://www.open-bio.org/membership/) for more information.",
        "url": "https://www.open-bio.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "https://twitter.com/obf_news",
        "twitter": "https://www.open-bio.org/blog/"
    },
    "The Julia Language": {
        "desc": "A fresh approach to technical computing",
        "tech_stack": [
            "machine learning",
            " julia",
            " data science",
            " gui",
            " models"
        ],
        "topics": [
            "math",
            " machine learning",
            " science",
            " data science",
            " graphs"
        ],
        "detail": "The Julia Language is an open-source, high level, and dynamic language built to be easy to use like Python while having speed near C++. As an umbrella organization, we house projects related to core Julia (the language) as well as the broader Julia ecosystem.",
        "url": "https://julialang.org",
        "tags": [
            "Data",
            "Programming languages"
        ],
        "discord": "https://discourse.julialang.org/",
        "twitter": "https://twitter.com/JuliaLanguage"
    },
    "LibreCube Initiative": {
        "desc": "Open Source Space and Earth Exploration",
        "tech_stack": [
            "python",
            " mongodb",
            " rest",
            " micropython",
            " zmq"
        ],
        "topics": [
            "space",
            " cubesat",
            " mission control",
            " Communication Protocols"
        ],
        "detail": "LibreCube promotes open source for space technology. Our vision is to enable everyone to get involved in building systems for exploration of near and remote locations using open source hardware and software. We believe that discovering new worlds and getting scientific insights should be a matter to all humankind. LibreCube rests on these three pillars: - Open Source: Everything we do at LibreCube is made available to the public free and open source. Also, we only use free and open source tools for our work – this way, really everyone can get involved! - Free and Open Standards: We rely on proven and tested standards for our system designs, with preference for standards from the space domain. - Reference Architecture: Defining a generic architecture of system that have standardized interfaces makes it possible to combine and re-use elements for various different mission applications. Virtually every single person on the planet is fascinated by space – at LibreCube we aim to make space accessible to everyone.",
        "url": "https://librecube.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "https://app.element.io/#/room/#librecube.org:matrix.org",
        "twitter": "https://fosstodon.org/@librecube"
    },
    "Matrix.org": {
        "desc": "Open, secure, decentralised communication",
        "tech_stack": [
            "python",
            " javascript",
            " rust"
        ],
        "topics": [
            "interoperability",
            " decentralisation",
            " Secure Messaging"
        ],
        "detail": "Matrix is an open standard for interoperable, decentralised, real-time communication over IP. It can be used to power Instant Messaging, VoIP/WebRTC signalling, Internet of Things communication - or anywhere you need a standard HTTP API for publishing and subscribing to data whilst tracking the conversation history.",
        "url": "https://matrix.org",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Open Robotics": {
        "desc": "Development of open source robotics",
        "tech_stack": [
            "ros",
            " gazebo",
            " ignition",
            " Open-RMF"
        ],
        "topics": [
            "robotics",
            " simulation"
        ],
        "detail": "Support the development, distribution, and adoption of open source software for use in robotics research, education, and product development.",
        "url": "https://www.openrobotics.org/",
        "tags": [
            "End user applications",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "OpenWISP": {
        "desc": "The Hackable Network Management System",
        "tech_stack": [
            "python",
            " javascript",
            " django",
            " lua",
            " openwrt"
        ],
        "topics": [
            "networking",
            " network management system",
            " wifi",
            " vpn",
            " sdn"
        ],
        "detail": "OpenWISP is an open source network management system which runs on low cost hardware and can be used to manage networks: from public wifi, university wifi, to mesh networks and IoT.",
        "url": "https://openwisp.org",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "https://gitter.im/openwisp/general",
        "twitter": "https://groups.google.com/forum/#!aboutgroup/openwisp"
    },
    "FreeType": {
        "desc": "FreeType is a software library to render fonts.",
        "tech_stack": [
            "c",
            " autotools",
            " meson"
        ],
        "topics": [
            "library",
            " rendering",
            " fonts",
            " opentype",
            " truetype"
        ],
        "detail": "FreeType is a freely available software library to render fonts. It is written in C, designed to be small, efficient, highly customizable, and portable while capable of producing high-quality output (glyph images) of most vector and bitmap font formats. Some products that use FreeType for rendering fonts on screen or on paper, either exclusively or partially: • GNU/Linux and other free Unix operating system derivates like FreeBSD or NetBSD; • iOS, Apple's mobile operating system for iPhones and iPads; • Android, Google's operating system for smartphones and tablet computers; • ChromeOS, Google's operating system for laptop computers; • ReactOS, a free open source operating system based on the best design principles found in the Windows NT architecture; • Ghostscript, a PostScript interpreter used in many printers. Counting the above products only, you get more than a *billion* devices that contain FreeType.",
        "url": "https://freetype.org",
        "tags": [
            "Programming languages",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "checkstyle": {
        "desc": "Helps to adheres of Java coding standard",
        "tech_stack": [
            "java",
            " antlr"
        ],
        "topics": [
            "static code analysis",
            " code review tool",
            " coding standards",
            " coding conventions"
        ],
        "detail": "Checkstyle is a development tool to help programmers write Java code that is easy to read and adheres to a coding standard. Our utility automates the process of checking Java code to spare humans of this boring (but important) task. This makes it ideal for projects that want to enforce a coding standard. Each and every check also forces our users who are not familiar with these standards to read them and makes them think about why these standards exist.",
        "url": "https://checkstyle.org",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Genome Assembly and Annotation": {
        "desc": "Providing freely accessible genomic data",
        "tech_stack": [
            "python",
            " mysql",
            " docker",
            " pytorch",
            " nextflow"
        ],
        "topics": [
            "machine learning",
            " genomics",
            " big data",
            " cloud",
            " hpc"
        ],
        "detail": "The Genome Assembly and Annotation section of EMBL-EBI brings together key reference resources in the field of genomics: - Ensembl (http://www.ensembl.org) was created in 1999 in preparation for the publication of the first draft of the human genome, to allow researchers and clinicians to start translating the secrets hidden within the human genome into real world applications. Ensembl has grown into a champion of biodiversity, providing data for tens of thousands of species across our vertebrate, metazoa, plant, fungi and bacterial divisions. - MGnify (http://www.ebi.ac.uk/metagenomics) provides a free to use platform for the assembly, analysis and archiving of microbiome data derived from sequencing microbial populations that are present in particular environments. Over the past 2 years, MGnify has more than doubled the number of publicly available analysed datasets held within the resource. - WormBase (https://wormbase.org/) is one of the World's oldest active bioinformatic resources, more than 20 years old. We scan all published literature and datasets on the model organism C. elegans, to create a very comprehensive resouce of genomics, strains, experiments, paper and people, aimed towards accelerating research and discoveries in fundamental biology as well as human health. - The Hugo Gene Nomenclature Committee (HGNC) and its sibling project the Vertebrate Gene Nomenclature Committee (VGNC) are jointly responsible for defining the official names of genes in human and key vertebrate species. This official nomenclature ensures that studies and results on the same gene can easily be aggregated. Given the rapid pace of generation of genomics and sequencing data, we support a fast-evolving software stack, and are constantly investigating new solutions for data storage, processing, distribution and display. Please visit our projects page for ideas on potential GSoC projects: https://www.ensembl.info/about/projects/",
        "url": "https://www.ebi.ac.uk/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "GNU Octave": {
        "desc": "Free Your Numbers",
        "tech_stack": [
            "c++",
            " hg"
        ],
        "topics": [
            "mathematics",
            " scientific computing",
            " numerical computation",
            " numerical methods",
            " matlab"
        ],
        "detail": "GNU Octave is a high-level interpreted language, primarily intended for numerical computations. It provides capabilities for the numerical solution of linear and nonlinear problems and for performing other numerical experiments. It also provides extensive graphics capabilities for data visualization and manipulation. Octave is normally used through its interactive command line interface, but it can also be used to write non-interactive programs. The Octave language is quite similar to Matlab so that most programs are easily portable. Octave is continually being upgraded. Student projects may also involve developing or upgrading Octave Forge packages, which can be loaded to provide additional specialized functions that supplement those provided in Core Octave.",
        "url": "https://www.octave.org",
        "tags": [
            "Science and medicine",
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Mayor's Office of New Urban Mechanics": {
        "desc": "Exploring new approaches to civic life.",
        "tech_stack": [
            "python",
            " javascript",
            " ruby",
            " tensorflow"
        ],
        "topics": [
            "web",
            " machine learning",
            " gis",
            " civic tech",
            " analytics"
        ],
        "detail": "Formed in 2010, the Mayor's Office of New Urban Mechanics serves as the City of Boston's innovation incubator, building partnerships between internal agencies and outside entrepreneurs to pilot projects that address resident needs. We design and implement experiments and prototypes that address a range of urban issues. From community green spaces to the future of mobility to Accessory Dwelling Units, our approach to innovation is human-centered, nimble and responsive to the changing needs of our growing City.",
        "url": "https://www.boston.gov/mechanics",
        "tags": [
            "Data",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Robolectric": {
        "desc": "Fast unit testing runtime for Android",
        "tech_stack": [
            "android",
            " java",
            " jvm",
            " asm"
        ],
        "topics": [
            "testing",
            " mobile"
        ],
        "detail": "Robolectric is a unit testing framework for Android. With Robolectric, your tests run in a simulated Android environment inside a JVM, without the overhead and flakiness of an emulator. Robolectric also offers a rich set of testing APIs that are not available in the Android framework.",
        "url": "http://robolectric.org/",
        "tags": [
            "Operating systems",
            "Development tools"
        ],
        "discord": "https://github.com/robolectric/robolectric/discussions",
        "twitter": "https://twitter.com/robolectric"
    },
    "syslog-ng": {
        "desc": "Enhanced log daemon, w/ wide range of I/O methods",
        "tech_stack": [
            "c",
            " python",
            " sql",
            " elasticsearch",
            " kafka"
        ],
        "topics": [
            "cloud",
            " data processing pipeline",
            " reliable log transfer",
            " logging",
            " high-performance data processing"
        ],
        "detail": "Why syslog-ng? With syslog-ng, you can collect logs from a wide range of sources, process them in near real-time and deliver them to a wide variety of destinations. syslog-ng allows you to flexibly collect, parse, classify, and correlate logs from across your infrastructure (even from routers, embedded systems) and store or route them to log analysis tools. By integrating with big data tools it is possible to deliver log messages to Kafka and Elasticsearch, even store logs in HDFS. syslog-ng not only supports legacy BSD syslog (RFC3164) and the enhanced RFC5424 protocols but also JavaScript Object Notation (JSON) and journald message formats. Working with unstructured data? That's not a problem: syslog-ng comes with a set of built-in parsers, which you can combine to build very complex things. Even if you need to collect logs from a diverse range of sources, syslog-ng's PatternDB allows you to correlate events together and transform them into a unified format. If you need to store your log messages in a database, you don't need to look any further! We have SQL (MySQL, PostgreSQL,Oracle), MongoDB. We also support inserting messages into Redis. syslog-ng supports the Advanced Message Queuing Protocol (AMQP) and the Simple Text Oriented Messaging Protocol (STOMP) too, with more in the pipeline. syslog-ng supports sending messages to HTTP/REST services natively Want to deliver log messages to new systems, that are not supported by any of the log management systems, then you can easily integrate it with syslog-ng by a few lines of Python code implementing a new destination. Not only destinations could be implemented, but other items of the processing pipeline (e.g.: filter, parser, etc) and not only in Python language but also in Java.",
        "url": "https://www.syslog-ng.com/",
        "tags": [
            "Data",
            "Other"
        ],
        "discord": "https://lists.balabit.hu/mailman/listinfo/syslog-ng",
        "twitter": "mailto:syslog-ng@lists.balabit.hu"
    },
    "Wagtail": {
        "desc": "The powerful Python CMS for modern websites",
        "tech_stack": [
            "python",
            " javascript",
            " django"
        ],
        "topics": [
            "web",
            " accessibility",
            " cms"
        ],
        "detail": "We build Wagtail, a popular content management system. It's built on Python, by an active and engaged open source community, which has grown rapidly since Wagtail's release in 2014. Wagtail is available in over 40 languages, and used by some of the world's best-known organizations, including NASA, Google, Mozilla, MIT, and the UK's National Health Service, as well as museums, universities, non-profits, governments, banks, studios, restaurants, startups and bloggers around the world.",
        "url": "https://wagtail.org/",
        "tags": [
            "Web"
        ],
        "discord": "https://github.com/wagtail/wagtail/discussions",
        "twitter": "https://twitter.com/wagtailcms"
    },
    "TianoCore": {
        "desc": "Modern, open source, UEFI BIOS firmware",
        "tech_stack": [
            "c",
            " python",
            " rust",
            " golang",
            " uefi"
        ],
        "topics": [
            "firmware",
            " uefi",
            " edk2",
            " acpi",
            " BIOS"
        ],
        "detail": "Welcome to TianoCore, the community supporting an open source implementation of the Unified Extensible Firmware Interface (UEFI). EDK II is a modern, feature-rich, cross-platform firmware development environment for the UEFI and UEFI Platform Initialization (PI) specifications. In June of 2004, Intel announced that it would release the “Foundation Code” of its Extensible Firmware Interface (EFI), a successor to the 16-bit x86 “legacy” PC BIOS, under an open source license. This Foundation Code, developed by Intel as part of a project code named Tiano, was Intel’s “preferred implementation” of EFI. This evolved into EDK, EDK II, and other open source projects under the TianoCore community. The EFI Specifications were contributed to the United EFI Forum as part of the original UEFI Specifications, which has been adopted by over 200 companies and shipped on billions of compute devices. The UEFI Forum does not endorse any particular implementation, but TianoCore is designed to implement the UEFI and UEFI PI specifications.",
        "url": "https://www.tianocore.org/",
        "tags": [
            "Operating systems",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Monado": {
        "desc": "Monado, the free and open source XR platform",
        "tech_stack": [
            "opengl",
            " vulkan",
            " openxr",
            " Graphics",
            " XR"
        ],
        "topics": [
            "vr",
            " xr",
            " AR"
        ],
        "detail": "Monado aims to jump-start development of an open source XR ecosystem and provide the fundamental building blocks for device vendors to target the GNU/Linux platform, Windows or Android, supporting a wide range of AR/VR peripherals, such as HMDs, cameras, controllers, sensors/trackers, etc...",
        "url": "https://monado.freedesktop.org/",
        "tags": [
            "Media",
            "Infrastructure and cloud"
        ],
        "discord": "https://webchat.oftc.net/?channels=monado",
        "twitter": "mailto:frederic.plourde@collabora.com"
    },
    "JBoss Community": {
        "desc": "Community of projects around JBoss Middleware",
        "tech_stack": [
            "java",
            " rust",
            " golang"
        ],
        "topics": [
            "iot",
            " cloud",
            " microservices",
            " kubernetes"
        ],
        "detail": "JBoss Community is a community of open source projects. The community hosts a large number of projects that are written in various programming languages. The primary language is Java. But there are also projects that are written in Go, Rust, Ruby, PHP, Node and other languages. Project categories range from better testing support over IDEs, application servers, application and performance monitoring, IOT, machine learning to micro-services.",
        "url": "http://www.jboss.org/",
        "tags": [
            "Data",
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "SPDX": {
        "desc": "An open ISO standard for SBOMs",
        "tech_stack": [
            "python",
            " java",
            " json",
            " go",
            " rdf"
        ],
        "topics": [
            "compliance",
            " licensing",
            " data",
            " vulnerabilities"
        ],
        "detail": "SPDX is an open standard for communicating software bill of material information, including provenance, license, security, and other related information. SPDX reduces redundant work by providing common formats for organizations and communities to share important data, thereby streamlining and improving compliance, security, and dependability. The SPDX specification is recognized as the international open standard for security, license compliance, and other software supply chain artifacts as ISO/IEC 5962:2021.",
        "url": "https://spdx.dev",
        "tags": [
            "Other",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "The Honeynet Project": {
        "desc": "Honeypots and Threat Intelligence R&D",
        "tech_stack": [
            "python",
            " javascript",
            " django",
            " go",
            " docker"
        ],
        "topics": [
            "honeypots",
            " malware analysis",
            " Threat Intelligence"
        ],
        "detail": "The Honeynet Project is a leading international 501c3 non-profit security research organization, dedicated to investigating the latest attacks and developing open source security tools to improve Internet security. With Chapters around the world, our volunteers have contributed to fight against malware (such as Conficker), discovering new attacks and creating security tools used by businesses and government agencies all over the world. The Honeynet Project uses GSoC as a incubator for new R&D projects, and to recruit active new members.",
        "url": "https://honeynet.org",
        "tags": [
            "Security"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Software Heritage": {
        "desc": "The universal source code archive",
        "tech_stack": [
            "python",
            " postgresql",
            " javascript",
            " django",
            " git"
        ],
        "topics": [
            "big data",
            " digital preservation",
            " source code management",
            " floss",
            " big code"
        ],
        "detail": "Software Heritage is an archival project for source code and its development history. Its long-term mission is to collect, preserve, and share our entire Software Commons, that is the body of knowledge expressed as publicly available software source code. Software Heritage archive both source code and the associated development history, as it is captured by modern version control system and package managers. The data model is a Merkle DAG, where all source code artifacts — file contents, directories, commits,etc. — are thoroughly deduplicated, reducing storage requirements. The Software Heritage archive is already the largest of its kind, having archive more than 10 billion unique source code files and more than 2 billion unique commits coming from more than 160 million software projects. The archive crawls periodically forges like GitHub and GitLab.com, distributions like Debian, and package managers like PyPI or NPM. It is accessible via a Web UI as well as a WebAPI. The archive serves various different use cases, ranging from preservation of our cultural heritage for posterity to scientific research on \"big code\" analysis, from business needs of tracking software provenance to educational purposes in computer science curricula.",
        "url": "https://www.softwareheritage.org/",
        "tags": [
            "Data",
            "Development tools"
        ],
        "discord": "https://sympa.inria.fr/sympa/info/swh-devel",
        "twitter": "https://www.softwareheritage.org/blog"
    },
    "Haiku": {
        "desc": "Operating system that targets personal computing.",
        "tech_stack": [
            "c++",
            " posix",
            " unix"
        ],
        "topics": [
            "desktop",
            " kernel"
        ],
        "detail": "Haiku is a fast, efficient, easy to use and lean open source operating system inspired by the BeOS that specifically targets personal computing. Haiku is not a Linux distribution, nor does it use the Linux kernel. Haiku is the spiritual successor to BeOS and it is derived from the NewOS kernel, which was authored by Travis Geiselbrecht (geist), who was formerly employed by Be Inc. — the developers of BeOS. Linux-based distributions stack up software – the Linux kernel, the X Window System, and various DEs with disparate toolkits such as GTK+ and Qt – that do not necessarily share the same guidelines and/or goals. This lack of consistency and overall vision manifests itself in increased complexity, insufficient integration, and inefficient solutions, making the use of your computer more complicated than it should actually be. Instead, Haiku has a single focus on personal computing and is driven by a unified vision for the whole OS. That, we believe, enables Haiku to provide a leaner, cleaner and more efficient system capable of providing a better user experience that is simple and uniform throughout.",
        "url": "https://www.haiku-os.org",
        "tags": [
            "Operating systems",
            "End user applications"
        ],
        "discord": "https://discuss.haiku-os.org/",
        "twitter": "https://www.haiku-os.org/community/ml"
    },
    "Chromium": {
        "desc": "Fast, seamless, safe, and reliable web for all",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " c++",
            " git"
        ],
        "topics": [
            "web",
            " browser",
            " operating-system"
        ],
        "detail": "The Chromium projects include Chromium and Chromium OS, the open-source projects behind the Google Chrome browser and Google Chrome OS, respectively. Chromium is an open-source browser project that aims to build a safer, faster, and more stable way for all users to experience the web. Chromium OS is an open-source project that aims to provide a fast, simple, and more secure computing experience for people who spend most of their time on the web.",
        "url": "https://chromium.org",
        "tags": [
            "Operating systems",
            "Web"
        ],
        "discord": "https://discord.gg/gVfTUjds",
        "twitter": "https://www.chromium.org/developers/technical-discussion-groups/"
    },
    "MetaBrainz Foundation Inc": {
        "desc": "Open music / book metadata, music recommendations",
        "tech_stack": [
            "python",
            " react",
            " perl",
            " postgres",
            " spark"
        ],
        "topics": [
            "open data",
            " music",
            " books",
            " Music recommendation",
            " music social network"
        ],
        "detail": "The MetaBrainz Foundation is a non-profit that believes in free, open access to data. It has been set up to build community maintained databases and make them available in the public domain or under Creative Commons licenses. Our data is mostly gathered by volunteers and verified by peer review to ensure it is consistent and correct. All non-commercial use of this data is free, but commercial users are asked to support us in order to help fund the project. We encourage all data users to contribute to the data gathering process so that our data can be as comprehensive as possible. With this data we are building a music social network and bias free music recommendations.",
        "url": "https://metabrainz.org",
        "tags": [
            "Data",
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "IOOS": {
        "desc": "Our eyes on the ocean, coasts, and Great Lakes",
        "tech_stack": [
            "python",
            " ocean science"
        ],
        "topics": [
            "open data",
            " data science"
        ],
        "detail": "IOOS is our eyes on the ocean, coasts, and Great Lakes. We are an integrated network of people and technology gathering observing data and developing tracking and predictive tools to benefit the economy, the environment, and public safety at home, across the nation, and around the globe.",
        "url": "https://ioos.noaa.gov/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://gitter.im/ioos",
        "twitter": "https://twitter.com/usioosgov"
    },
    "X.Org Foundation": {
        "desc": "X Window System and related projects (Mesa, DRI, Wayland, etc.)",
        "tech_stack": [
            "opengl",
            " vulkan",
            " x11",
            " wayland",
            " DRM"
        ],
        "topics": [
            "graphics",
            " drivers"
        ],
        "detail": "The X.Org Foundation (or X.Org for short) is a foundation chartered to develop and execute effective strategies that provide worldwide stewardship and encouragement of the X Window System and related projects. Indeed, X.Org is much broader than just the X Window System. Under the umbrella of the X.Org Foundation can be found Linux's DRM subsystem (10% of the size of Linux), Mesa (open source 3D and video-decoding acceleration for AMD, Intel, NVIDIA,...), and Wayland. X.org's technologies underpin much of today's computing environment, and expertise in it is in high demand worldwide. Today, as the result of more than 20 years of work by teams of leading open source developers, most of the graphical user interfaces for Unix and Linux systems rely on X.Org. On top of the X-Server-based systems, this includes Android- and ChromeOS-based devices, and Wayland-based systems (Sailfish OS, Gnome, ...). X.Org is responsible for the design of the X libraries which interface with application, the acceleration architectures used for graphics, and the graphics and input drivers. In particular, it has been at the center of the recent restructuring of the Linux graphics driver stack. Come help us make the future more open!",
        "url": "https://www.x.org",
        "tags": [
            "Media"
        ],
        "discord": "mailto:https://lists.freedesktop.org/mailman/listinfo/dri-devel",
        "twitter": "https://twitter.com/XOrgFoundation"
    },
    "libcamera": {
        "desc": "Provide an open source camera stack for linux",
        "tech_stack": [
            "c/c++",
            " linux kernel",
            " qt5",
            " gstreamer",
            " v4l2"
        ],
        "topics": [
            "camera",
            " image prcessing"
        ],
        "detail": "Cameras are complex devices that need heavy hardware image processing operations. Control of the processing is based on advanced algorithms that must run on a programmable processor. This has traditionally been implemented in a dedicated MCU in the camera, but in embedded devices, algorithms have been moved to the main CPU to save cost. Blurring the boundary between camera devices and Linux often left the user with no other option than a vendor-specific closed-source solution. To address this problem the Linux media community is collaborating with the industry to develop a camera stack that is open-source-friendly while still protecting vendor core IP. libcamera was born out of that collaboration and offers modern camera support to Linux-based systems, including traditional Linux distributions, ChromeOS and Android.",
        "url": "https://libcamera.org",
        "tags": [
            "Media"
        ],
        "discord": "https://lists.libcamera.org/listinfo/libcamera-devel",
        "twitter": "mailto:paul.elder@ideasonboard.com"
    },
    "sktime": {
        "desc": "A unified framework for ML with time series",
        "tech_stack": [
            "python",
            " github",
            " sphinx",
            " scikit-learn"
        ],
        "topics": [
            "data science",
            " ai",
            " time series",
            " toolbox frameworks"
        ],
        "detail": "sktime provides an easy-to-use, flexible and modular open-source framework for a wide range of time series machine learning tasks. It offers scikit-learn compatible interfaces and model composition tools, with the goal to make the ecosystem more usable and interoperable as a whole. We build and sustain an open, diverse and self-governing community, welcoming new contributors from academia and industry through instructive documentation, mentoring and workshops.",
        "url": "https://www.sktime.org/en/stable/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://github.com/alan-turing-institute/sktime/discussions",
        "twitter": "https://discord.com/invite/gqSab2K"
    },
    "Learning Equality": {
        "desc": "Equity in education to transform lives",
        "tech_stack": [
            "python",
            " javascript",
            " django",
            " vue.js"
        ],
        "topics": [
            "education",
            " distributed databases",
            " offline",
            " learning"
        ],
        "detail": "Learning Equality is an education technology non-profit that develops, maintains and supports Kolibri, an adaptable set of open solutions specially designed to support learning for the half of the world without Internet access. Launched in 2017, Kolibri is an end-to-end suite of open-source tools, content, and DIY support materials, designed for offline-first teaching and learning. Centered around an offline learning platform that runs on a variety of low-cost and legacy devices, Kolibri also includes a curricular tool, a library of open educational materials, and a toolkit of resources to support training and implementation. These tools are available in a variety of languages, to better support learners and educators globally. We work closely to co-design the product with a core network of collaborators, including national NGOs, UN agencies, government, and corporate partners, while also taking a needs-based approach to its development through insights gathered from Kolibri’s global user community. Through its do-it-yourself adoption model and strategic collaborations, Kolibri has reached learners and educators in more than 215 countries and territories.",
        "url": "https://learningequality.org/",
        "tags": [
            "End user applications",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "SCoRe Lab": {
        "desc": "SCoRe Lab develops FOSS softwares for everyone!!!",
        "tech_stack": [
            "python",
            " java",
            " go",
            " nodejs",
            " reactjs"
        ],
        "topics": [
            "security",
            " web",
            " machine learning",
            " cloud"
        ],
        "detail": "The SCoRe Lab has conducted research covering various aspects of security, digital forensic, mobile applications, cloud, blockchain and software tools. The goal of our research is to generate computing solutions by identifying low-cost methodologies and strategies that lead to sustainability. At present, the SCoRe Lab is at a stage of its evolution in which it has been able to secure high donor confidence as evidenced by simultaneous foreign-funded projects. SCoRe Lab studies and produces sustainable computing solutions with respect to low-cost computing and communication foundations in the developing and emerging regions in the world. We have developed several affordable and sustainable ICT solutions especially focusing on the requirements in the developing region. These solutions are briefly described in the projects section.",
        "url": "https://scorelab.org/",
        "tags": [
            "End user applications",
            "Security"
        ],
        "discord": "https://groups.google.com/g/score-community",
        "twitter": "mailto:gsoc@scorelab.org"
    },
    "The JPF team": {
        "desc": "JPF is a special JVM for software verification",
        "tech_stack": [
            "android",
            " java",
            " distributed systems",
            " jvm"
        ],
        "topics": [
            "model checking",
            " symbolic execution",
            " verification of concurrent systems",
            " program analysis",
            " test input generation"
        ],
        "detail": "The Java Pathfinder (JPF) project was initially conceived and developed at NASA Ames Research Center in 1999. JPF was open sourced in April 2005 as one of the first ongoing NASA development projects to date, and it is now released under the Apache license, 2.0. JPF is an extensible Java virtual machine written in Java itself. It is used to create a variety of verification and debugging tools, ranging from software model checkers to test case generators using symbolic execution. JPF is a research platform and a production tool at the same time. Although JPF has major contributions from companies and government agencies, our main user community is academic - there are ongoing collaborations with more than 20 universities worldwide. The JPF team for GSoC 2022 includes researchers from NASA Ames Research Center, KTH Royal Institute of Technology - Sweden, York University - Canada, Brigham Young University, Carnegie Mellon University, University of Minnesota, Charles University - Czech Republic, and National University of Singapore. JPF is designed to be highly extensible. There are well-defined extension mechanisms, directory structures and build procedures, which keep the core relatively stable and provide suitable, well separated testbeds for new ideas and alternative implementations. As a consequence, we host a number of such extension projects on our own, public JPF server, together with a Wiki that provides a central location for learning about, obtaining, and contributing to JPF. JPF has been used for a variety of application domains and research topics such as verification of multi-threaded applications, graphical user interfaces, networking, and distributed applications. In addition to its continued presence in academia, JPF has matured enough to support verification of production code and frameworks such as Android. JPF is constantly being extended with support for verification of new types of correctness properties and for new types of application domains.",
        "url": "https://github.com/javapathfinder/jpf-core/wiki",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Git": {
        "desc": "Fast,Scalable,Distributed revision control system",
        "tech_stack": [
            "shell script",
            " git",
            " c language"
        ],
        "topics": [
            "version control",
            " dvcs"
        ],
        "detail": "Git is the most widely-used revision control system in Open Source. It is a distributed system with an emphasis on speed, data integrity, and support for distributed, non-linear workflows. Many large and successful projects use Git, including the Linux Kernel, Perl, Eclipse, Gnome, KDE, Qt, Ruby on Rails, Android, PostgreSQL, Debian, and X.org. This organization covers projects for Git itself. Other git-based software or services are not covered by this organization.",
        "url": "https://git-scm.com/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "https://git-scm.com/community",
        "twitter": "mailto:git@vger.kernel.org"
    },
    "libssh": {
        "desc": "The SSH library",
        "tech_stack": [
            "c",
            " ssh"
        ],
        "topics": [
            "security",
            " cryptography"
        ],
        "detail": "This project is for programmers needing a working SSH implementation by the mean of a library. The complete control of the client is made by the programmer. With libssh, you can remotely execute programs, transfer files, use a secure and transparent tunnel for your remote programs. With its Secure FTP implementation, you can play with remote files easily, without third-party programs others than libcrypto (from openssl).",
        "url": "https://www.libssh.org/",
        "tags": [
            "Security"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Public Lab": {
        "desc": "Tools for communities to measure pollution",
        "tech_stack": [
            "javascript",
            " ruby on rails"
        ],
        "topics": [
            "science",
            " environment",
            " community",
            " documentation",
            " forum"
        ],
        "detail": "Public Lab is a small non-profit which supports communities facing environmental problems. Our work involves open source hardware, developed collaboratively across our network of community groups, environmental advocates, scientists, and organizers -- and the software we create supports their work in collecting, analyzing and understanding environmental problems.",
        "url": "https://publiclab.org",
        "tags": [
            "Science and medicine",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Mixxx": {
        "desc": "DJ Mixing App With Powerful Features For All DJs",
        "tech_stack": [
            "javascript",
            " c++",
            " qt"
        ],
        "topics": [
            "music",
            " dj",
            " streaming"
        ],
        "detail": "Mixxx is a feature rich DJ mixing application. It supports many MIDI and HID DJ controllers, runs on Win Linux and MacOs. It supports effects, harmonic mixing and beatmatching. Mixxx has an unusually broad community for an open-source project, encompassing performing musicians, C++ addicts, amateur DJs, Internet radio broadcasters, and casual users.",
        "url": "https://mixxx.org",
        "tags": [
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Open Chemistry": {
        "desc": "Advancing Open Source & Open Science for Chemistry",
        "tech_stack": [
            "python",
            " javascript",
            " opengl",
            " c++",
            " c++14"
        ],
        "topics": [
            "data science",
            " graphics",
            " scientific visualization",
            " cheminformatics",
            " quantum chemistry"
        ],
        "detail": "The Open Chemistry project is a collection of open source, cross platform libraries and applications for the exploration, analysis and generation of chemical data. The organization is an umbrella of projects developed by long-time collaborators and innovators in open chemistry such as the Avogadro, Open Babel, RDKit and cclib projects. These projects have been downloaded over 1,000,000 times and cited in over 2,000 academic papers. Our goal is to improve the state of the art, and facilitate the open exchange of chemical data and ideas while utilizing the best technologies from quantum chemistry codes, molecular dynamics, informatics, analytics, and visualization.",
        "url": "https://openchemistry.org/",
        "tags": [
            "Science and medicine",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "rocket.chat": {
        "desc": "Open source team chat and communications platform",
        "tech_stack": [
            "javascript",
            " raspberry pi",
            " typescript",
            " node",
            " meteorJS"
        ],
        "topics": [
            "communications",
            " messaging",
            " group chat",
            " Team Collaboration",
            " Chat platform"
        ],
        "detail": "Ultimate open source team chat and communications platform Rocket.Chat is one of the largest active open source (permissive MIT source license) nodeJS communications platform communities on GitHub, connecting 1500+ global community contributors (across projects) from 30+ countries, with 31700+ GitHub stars, 6500 forks, 490+ total releases and 12,000+ issues since inception in 2015. Rocket.Chat is a modern team chat and collaborating platform written in full-stack JavaScript. Rocket.Chat offers a full featured rich team chat experience on modern browsers, comparable to Slack and Microsoft Teams. Mobile and desktop clients run on iOS, Android, Mac, Windows, and Linux. Rocket.Chat server can scale from a small family messaging server for 5 users running on a Raspberry Pi 4, to clustered micro-services configuration that can support hundred thousands of users. On-premise deployment of Rocket.Chat can ensure 100% complete security and privacy of your valuable communications/data. Rocket.Chat is now installed on over 500k servers and counts over 12m users worldwide. Rocket.Chat’s long-term vision is to replace email with a real-time federated communications platform globally. Users can set up Rocket.Chat on cloud or by hosting their own servers on-premises. Thanks to its extension support via Rocket.Chat Apps (plugins), and extremely rich API/SDK support, startups and innovators have customized Rocket.Chat into new products and services. Chatbots extend the interactivity of Rocket.Chat and integrate external IT systems. Omnichannel extends reach to wherever user may be including WhatsApp, Instagram, Facebook Messenger and more. Rocket.Chat has won multiple prizes such as a 2016 Bossie Award for Best Open Source Application and first prize in the 2017 edition of All Things Open’s Startup Competition. Rocket.Chat supports over 59 local languages. Rocket.Chat's community interacts 24 x 7 at the community Rocket.Chat server https://open.rocket.chat since 2015.",
        "url": "https://github.com/RocketChat",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "https://forums.rocket.chat/t/welcome-to-google-summer-of-code-2022/13371",
        "twitter": "mailto:gsoc+2022@rocket.chat"
    },
    "The FreeBSD Project": {
        "desc": "FreeBSD: An OS for servers to embedded systems",
        "tech_stack": [
            "c",
            " llvm",
            " assembly",
            " make",
            " POSIX shell"
        ],
        "topics": [
            "virtualization",
            " operating system",
            " Embedded System"
        ],
        "detail": "FreeBSD is an advanced operating system for server, desktop, and embedded computer platforms. It offers advanced networking, impressive security features, and world class performance. It is used by some of the world's busiest web sites and many embedded networking and storage devices. FreeBSD source code is the foundation for the PlayStation 5 operating system, JuneOS, the operation system used by Juniper routers to provide the backbone of the Internet, and was the starting point for the core of Apple's OSX. FreeBSD also powers the servers Netflix use to stream terabits of video every second. It is possible that you are using FreeBSD right now without even realizing it. The FreeBSD Project began 28 years ago in 1993, but is based on work from the Berkeley Computer Systems Research Group dating back to 1978. Over those years the code base has gone through continuous development, improvement, and optimization. It offers a complete operating system from which students can choose to work on topics in the kernel or userland. In addition to producing an operating system, FreeBSD has incubated the development of software components used by other open source projects including bsnmp, jemalloc, libarchive, and OpenPAM. FreeBSD has an active mentoring program to welcome new developers into our community. There are currently over 300 developers with write access to our repositories and hundreds more contributors. Many of our past GSoC students have gone on to become FreeBSD developers. We communicate with on another in the many mailing lists, forums, blogs, IRC channels, and user groups all listed on our main website.",
        "url": "https://www.freebsd.org/",
        "tags": [
            "Operating systems"
        ],
        "discord": "https://wiki.freebsd.org/SummerOfCode/IRC",
        "twitter": "https://lists.freebsd.org/mailman/listinfo/freebsd-hackers"
    },
    "MZmine": {
        "desc": "Open-source software for mass spectrometry",
        "tech_stack": [
            "java",
            " javafx"
        ],
        "topics": [
            "visualization",
            " mass spectrometry",
            " biochemistry",
            " feature detection",
            " ion mobility"
        ],
        "detail": "Mass spectrometry is an analytical technique that measures the mass and abundance of small molecules with very high precision. However, the datasets produced by mass spectrometry instruments are complex and multi-dimensional. MZmine (https://mzmine.github.io) is a very successful open-source graphical software for mass spectrometry data processing implemented in Java. It contains a library of processing algorithms and powerful visualization modules. The publication about MZmine 2 (Pluskal et al., BMC Bioinformatics 2010) has received over 2500 citations, reflecting the impact the software had in the biomedical research community. A new version, MZmine 3, which is currently in the final stage of development, is based on JavaFX for its user interface and provides support for cutting-edge techniques such as ion mobility separation. Our main goal is to provide user-friendly, flexible, and easily extendable modular software covering the entire mass spectrometry data analysis workflow. MZmine previously participated in GSoC in 2017, 2018, and 2019 as part of the OpenChemistry umbrella organization and in 2020 as an independent organization.",
        "url": "https://www.mzmine.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "mailto:mzmine-devel@googlegroups.com",
        "twitter": "https://twitter.com/mzmine_project"
    },
    "NumFOCUS": {
        "desc": "NumFOCUS promotes open source scientific software.",
        "tech_stack": [
            "python",
            " c++",
            " r",
            " julia"
        ],
        "topics": [
            "data science",
            " graphics",
            " scientific computing",
            " numerical computation"
        ],
        "detail": "NumFOCUS supports and promotes world-class, innovative, open source scientific software. Most individual projects, even the wildly successful ones, find the overhead of a non-profit to be too large for their community to bear. NumFOCUS provides a critical service as an umbrella organization for this projects.",
        "url": "https://numfocus.org",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "BRL-CAD": {
        "desc": "3D CAD & other computer-aided tech (CAx)",
        "tech_stack": [
            "python",
            " c/c++",
            " opengl",
            " opencl",
            " scripting"
        ],
        "topics": [
            "geometry",
            " 2d/3d graphics",
            " ray tracing",
            " high-performance computing",
            " conversion standards"
        ],
        "detail": "This is the place to be if you love computer graphics. We do 2D/3D modeling, 3D printing, solid geometry, design, and more. Depending on the project, you have the opportunity to work with C/C++, Python, OpenGL, OpenCL, Qt, Javascript, and more... Help us develop open source computer-aided technologies (CAx)!\n\nWe operates as an umbrella organization (The OpenCAx Association) with several CAx communities including:\n\n- KiCAD is an electronics design automation (EDA) suite\n- OpenSCAD is a solid 3D modeler with a rich syntax for programmable geometry.\n- LibreCAD is a 2D modeling system specializing in blueprint-style drawings and draftings.\n- FreeCAD provides parametric 3D modeling with engineering functionality like FEM and CAM.\n- IfcOpenShell is a library for working with standard IFC building model data.\n- BRL-CAD is a solid modeling suite with conversion and advanced solid ray tracing features.\n\nWe want to select at least one student for each, so feel free to ask us where to start.",
        "url": "https://opencax.github.io/",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "mailto:devs@brlcad.org",
        "twitter": "https://brlcad.zulipchat.com/"
    },
    "National Resource for Network Biology (NRNB)": {
        "desc": "Developing open source tools for network biology",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " xml",
            " r"
        ],
        "topics": [
            "web application",
            " data science",
            " graphics",
            " scientific computing",
            " network biology"
        ],
        "detail": "The National Resource for Network Biology (NRNB, https://www.nrnb.org) organizes the development of free, open-source software technologies to enable network-based visualization, analysis, and biomedical discovery. Biomedical research is increasingly dependent on knowledge expressed in terms of networks, including gene, protein and drug interactions, cell-cell and viral-host communication, and vast social networks. Our technologies enable researchers to assemble and analyze these networks and to use them to better understand biological systems and, in particular, how they fail in disease. The NRNB mentoring organization includes projects such as Cytoscape (https://cytoscape.org/), WikiPathways (https://wikipathways.org/), SBML (https://sbml.org/), and cBioPortal (https://cbioportal.org/). This is a great opportunity to work at the intersection of biology and computing! For example, Cytoscape is downloaded over 18,000 times per month by researchers. We take mentoring seriously and are proud of our 96% success rate (https://www.nrnb.org/alumni.html#gsoc-tab) with former students and projects. But don’t take our word for it, read testimonials from prior NRNB students (https://www.nrnb.org/testimonials.html#student-tab) and (https://www.nrnb.org/testimonials.html#mentor-tab).",
        "url": "https://nrnb.org/gsoc.html",
        "tags": [
            "Science and medicine"
        ],
        "discord": "mailto:alex.pico@gladstone.ucsf.edu",
        "twitter": "https://groups.google.com/g/cytoscape-helpdesk"
    },
    "Joomla!": {
        "desc": "The flexible platform empowering website creators.",
        "tech_stack": [
            "mysql",
            " javascript",
            " html",
            " php",
            " css"
        ],
        "topics": [
            "web",
            " programming languages",
            " web development",
            " web applications",
            " cms"
        ],
        "detail": "The Joomla CMS is a PHP based application that powers about 2.2% of the web, 3.5% of all CMS based websites, as well as many intranets. Joomla has been downloaded over 119 Million times: https://downloads.joomla.org/ The Joomla project has hundreds of contributors, organized in a set of working groups and teams, and a leadership group. These are coordinated by the [Departments](https://volunteers.joomla.org/departments/ \"Joomla Departments\"). Joomla is a community driven FOSS project developed and maintained by an international community encompassing over 150 countries. Joomla is used by millions of websites and web applications ranging from the hobbyist, professional web developer, to large enterprises, for both the World Wide Web and intranets. Joomla is available in 76 languages with an active and dedicated translation team https://community.joomla.org/translations/joomla-3-translations.html The Joomla Project is a community effort which strives to engage contributors from diverse backgrounds and varying interests and skills in building and supporting great software together. The [mission, vision and values](https://www.joomla.org/about-joomla/the-project/mission-vision-and-values.html \"Joomla Mission vision and values\") of the Joomla Project reflect this. The official umbrella organisation is Open Source Matters (OSM), the not for profit organization that manages financial and legal issues for the Joomla Project. A team of experienced people drawn from many areas of the project will manage the 2022 GSoC project for Joomla.",
        "url": "https://www.joomla.org/",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "https://forms.gle/eiHgWehmWQKE9jBJ7",
        "twitter": "https://twitter.com/joomla"
    },
    "OpenStreetMap": {
        "desc": "Create and distribute free geodata for the world",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " c++",
            " sql"
        ],
        "topics": [
            "databases",
            " routing",
            " gis",
            " ui",
            " geocoding"
        ],
        "detail": "OpenStreetMap is a crowdsourcing project that creates and distributes free geographic data for the world. Our data is collected by hundreds of thousands of contributors around the globe and released with an open-content license. We allow free access not only to our map products, but all the underlying map data, which powers websites and apps used by billions of people worldwide. OSM data can be freely used in both open and closed source software, and has attracted many commercial users. Still, the success of OSM wouldn't be possible without open source software and volunteer developers. The database, website and api running on our own servers, the editing tools used by contributors to improve the map, and many of the most popular libraries and end-user applications within the OSM software ecosystem are all open source software, and developed through a community-driven process. As our Google Summer of Code participation spans this diverse set of software projects, most of which are maintained as independent efforts under the OSM umbrella, contributors will encounter a wide range of programming languages, paradigms and use cases. We hope that we have interesting challenges to offer for any developer, no matter their background!",
        "url": "https://www.openstreetmap.org/",
        "tags": [
            "Data",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "MuseScore": {
        "desc": "The World’s Most Popular Music Notation Software",
        "tech_stack": [
            "c++",
            " qt",
            " qml",
            " cmake"
        ],
        "topics": [
            "music",
            " midi",
            " musicxml",
            " sheet music",
            " music notation"
        ],
        "detail": "MuseScore's main purpose is the creation of high-quality engraved musical scores in a \"What-You-See-Is-What-You-Get\" environment. It supports unlimited staves, linked parts and part extraction, tablature, MIDI input and output, percussion notation, cross-staff beaming, automatic transposition, lyrics (multiple verses), fretboard diagrams, and in general everything commonly used in sheet music. Style options to change the appearance and layout are available and style sheets can be saved and applied to other scores. In January 2020, MuseScore introduced a unique engraving and notation style built by its full time designer, Martin Keary and engraver Simon Smith. MuseScore can play back scores through a sequencer and SoundFont sample library. Playback is currently being greatly expanded to include VST support. MIDI output to external devices and software synthesisers is also possible. The team organise themselves according to a general roadmap published by the product owner every six months, which sets out provisional goals for the internal team. This allows the extended developer community to comment on the roadmap and potentially offer to take ownership over aspects of it. This also allows other contributors to have visibility on aspects of the codebase that may change over the next 6-12 months. In combination with our community organiser, tasks are drawn up and published to provide a well organised collaboration focused on a specific upcoming release. All members provide bug tracking support and feedback.",
        "url": "https://musescore.org/",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Python Software Foundation": {
        "desc": "A programming language used for science & more",
        "tech_stack": [
            "python",
            " javascript",
            " sqlite"
        ],
        "topics": [
            "security",
            " database",
            " science",
            " design"
        ],
        "detail": "Python is a programming language that lets you work more quickly and integrate your systems more effectively. The Python Software Foundation serves as an umbrella organization to a variety of Python-related projects, as well as sponsoring projects related to the development of the Python language. You can view a full list of participating sub-orgs here: https://python-gsoc.org/ideas.html",
        "url": "https://python-gsoc.org/",
        "tags": [
            "Programming languages",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "ArduPilot": {
        "desc": "World's most advanced autonomous vehicle software",
        "tech_stack": [
            "python",
            " lua",
            " c++",
            " pixhawk"
        ],
        "topics": [
            "robotics",
            " Drone",
            " autonomous vehicle",
            " UGV",
            " unmanned vehicle"
        ],
        "detail": "ArduPilot is the world's most widely used open source flight code software for unmanned autonomous vehicles including planes, multicopters, helicopters, cars, boats, submarines, blimps, antenna trackers and much more. Written primarily in C++, ArduPilot supports over 70 different types of autopilot hardware including the well known Pixhawk autopilot. Our team motto, \"Versatile, Trusted, Open\" reflects our team's aim to provide high quality autopilot software that reliably supports a huge variety of frames, sensors and use cases. The software is open but so is the team, always welcoming of new contributors whether they be software developers, wiki documentors, testers or users.",
        "url": "https://ardupilot.org/",
        "tags": [
            "Science and medicine",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "PEcAn Project": {
        "desc": "Develop and promote tools for ecosystem modeling",
        "tech_stack": [
            "r",
            " docker",
            " api",
            " geospatial"
        ],
        "topics": [
            "data science",
            " ecosystem models",
            " scientific visualization",
            " climate science",
            " Ecological Forecasting",
            ""
        ],
        "detail": "Climate change science has witnessed an explosion in the amount and types of data that can be brought to bear on the potential responses of the terrestrial carbon cycle and biodiversity to global change. Many of the most pressing questions about global change are not necessarily limited by the need to collect new data as much as by our ability to synthesize existing data. This project specifically seeks to improve this ability. Because no one measurement provides a complete picture, multiple data sources must be integrated in a sensible manner. Process-based models represent an ideal framework for integrating these data streams because they represent multiple processes at different spatial and temporal scales in ways that capture our current understanding of the causal connections across scales and among data types. Three components are required to bridge this gap between the available data and the required level of understanding: 1) a state-of-the-art ecosystem model, 2) a workflow management system to handle the numerous streams of data, and 3) a data assimilation statistical framework in order to synthesize the data with the model.",
        "url": "https://pecanproject.github.io/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "TensorFlow": {
        "desc": "TensorFlow is a ML framework for everyone.",
        "tech_stack": [
            "machine learning",
            " tensorflow",
            " ai",
            " Jax",
            " keras"
        ],
        "topics": [
            "education",
            " research",
            " machine learning"
        ],
        "detail": "TensorFlow is an open-source machine learning framework for everyone. Originally developed by Google, TensorFlow now has >1,000 contributors from all around the world. TensorFlow supports multiple programming languages and applications, including Python, mobile, and web.",
        "url": "https://tensorflow.org",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "The ENIGMA Team": {
        "desc": "A free rapid game development environment.",
        "tech_stack": [
            "opengl",
            " c++",
            " qt5"
        ],
        "topics": [
            "graphics",
            " game development",
            " compiler",
            " programming",
            " game design"
        ],
        "detail": "ENIGMA is a game development environment comprising an IDE, Compiler, and Game Engine. ENIGMA is meant to be simple to learn and even simpler to work with. ENIGMA makes it refreshingly easy to stand up simple games. Recreating Atari Pong is a job for a handful of minutes. This is true in many modern engines, but unlike most, ENIGMA scales well to positively enormous games, as the engine (and ultimately, all user code) is written in C++. Users write code in EDL, a language similar to JavaScript (or, more to the point, Game Maker Language) which compiles intermediately to C++. The emitted C++ is optimized based on the game's asset usage, and the result is a C++ game project which can be built by any C++ compiler (we target Clang and GCC). This offers massive portability and library support. The compiler bundles a C++ parser which crawls the engine for definitions. This theoretically allows users to access library routines directly (e.g. OpenGL), though we recommend against this for portability reasons. This framework is another good surface for GSoC projects, though it's more advanced, so we've left it unexplored in our project ideas list. To really understand the utility of the project, consider a typical game, which uses \"rooms\" (a type of ENIGMA asset) to lay out instances of \"objects\" (game entity classes) visually. The objects contain code for specific events (such as step, draw, or keyboard) which can call out to scripts or begin timelines or start movement on paths. ENIGMA's compiler translates this to C++ and builds it against the engine after parsing both to learn how to integrate them.",
        "url": "https://enigma-dev.org",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Department of Biomedical Informatics, Emory University": {
        "desc": "Biomedical research to advance healthcare",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " workflows",
            " dicom"
        ],
        "topics": [
            "science and medicine",
            " data integration",
            " workflows",
            " radiology",
            " distributed system"
        ],
        "detail": "Biomedical Informatics is a multidisciplinary field that is motivated by our desire to improve diagnosis, clinical care, and human health, through novel computational approaches to use (and learn from) biomedical and clinical data. We use our expertise in computer science and informatics by developing various enabling tools, technologies, and algorithms to solve specific biomedical and clinical applications. And in doing so help advance our understanding of disease and treatment, and also develop useful software and applications. Members of the department work in a variety of areas that range from machine learning, healthcare middleware that leverages cloud computing, clinical information systems, clinically oriented image analysis, and biomedical knowledge modeling. The driving applications for the various ongoing projects include cancer research, organ transplant, HIV, medical imaging, radiation therapy, and clinical data analytics. All development work that is undertaken is free and open-source. We have had a diverse set of successful GSoC projects in the past. In previous years, GSoC contributors have worked on diverse projects such as: geospatial systems for exploring microscopy environments that leveraged Hadoop; GPU accelerated pipelines for computational analysis of digitized biopsies; interactive visualization platforms for viewing massive images (>1GB); systems for data agnostic sharing of biomedical research datasets; Apache Drill based data integration and de-duplication platform for SQL and NoSQL databases; CNN based high throughput analysis of digitized biopsies; A GUI for Tensorflow; integrated architectures for biomedical data integration and federation; and information visualization of heterogeneous medical data. Many of these projects have been published in reputable journals and presented at major conferences. Some of the projects proved to be so successful that they were adopted in major national/international biomedical research initiatives.",
        "url": "https://med.emory.edu/departments/biomedical-informatics/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Rizin": {
        "desc": "Rizin reverse engineering framework and toolset",
        "tech_stack": [
            "c",
            " python",
            " c++",
            " qt"
        ],
        "topics": [
            "reverse engineering",
            " computer security",
            " debugging",
            " emulation",
            " disassembly"
        ],
        "detail": "The Rizin project is a fork of the famous Radare2 project that started in 2006. Since then the codebase has been rewritten multiple times, modularized and extended to support many new features. The Rizin project aims to provide stability, focus on the most important features, and provide a user friendly interface. Along with Cutter - a Qt-based GUI and the RzGhidra decompiler it makes the effective tool for everyday reversing tasks. Rizin is composed of a hexadecimal editor at its core, with support for several architectures and binary formats. It features code analysis capabilities, scripting, data and code visualization through graphs and other means, a visual mode, easy UNIX integration, a binary diffing engine for code and data, a shellcode compiler, multi-platform debug with reverse debug capabilities and much, much more!",
        "url": "https://rizin.re",
        "tags": [
            "Security"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Red Hen Lab": {
        "desc": "Research on Multimodal Communication",
        "tech_stack": [
            "python",
            " machine learning",
            " computer vision",
            " nlp",
            " data science"
        ],
        "topics": [
            "data science",
            " media",
            " language",
            " multimodal communication",
            " gesture"
        ],
        "detail": "Red Hen Lab is an international distributed cooperative of researchers in multimodal communication. We are senior professors at major research universities, senior developers in technology corporations. We also include junior professors, postdoctoral students, graduate students, undergraduate students, and even a few advanced high school students. Red Hen develops code in Natural Language Processing, ASR, audio parsing, gesture analysis, media analysis, computer vision, and multimodal analysis. Red Hen's multimodal communication research involves locating, identifying, and characterizing auditory and visual elements in videos and pictures. We may provide annotated clips or images and present the challenge of developing the machine learning tools to find additional instances in a much larger dataset. Some examples are gestures, eye movements, and tone of voice. We favor projects that combine more than one modality, but have a clear communicative function—an example would be floor-holding techniques. Once a feature has been successfully identified in our full dataset of several hundred thousand hours of news videos, cognitive linguists, communication scholars, and political scientists can use this information to study higher-level phenomena in language, culture, and politics and develop a better understanding of the full spectrum of human communication. Our dataset is recorded in a large number of languages, giving Red Hen a global perspective. For GSoC 2022, we invite proposals from students for components for a unified multimodal processing pipeline, whose aim is to extract information from text, audio, and video, and to develop integrative cross-modal feature detection tasks. Red Hen Lab is directed jointly by Francis Steen (UCLA) and Mark Turner (Case Western Reserve University).",
        "url": "http://www.redhenlab.org",
        "tags": [
            "Data",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "DBpedia": {
        "desc": "Global and Unified Access to Knowledge Graphs.",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " scala",
            " rdf"
        ],
        "topics": [
            "natural language processing",
            " semantic web",
            " linked data",
            " knowledge graph",
            " data extraction"
        ],
        "detail": "DBpedia is a crowd-sourced community effort to extract structured information from Wikipedia and make this information available on the Web. It allows for a global and unified access to Knowledge Graphs.",
        "url": "https://www.dbpedia.org/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://forum.dbpedia.org/",
        "twitter": "mailto:dbpedia@infai.org"
    },
    "Center for Translational Data Science": {
        "desc": "Develop translational data science.",
        "tech_stack": [
            "python",
            " aws"
        ],
        "topics": [
            "bioinformatics",
            " data science",
            " cloud",
            " Data Meshes"
        ],
        "detail": "We develop and operate large-scale data platforms to support research in topics of societal interest, including cancer, cardiovascular disease, inflammatory bowel disease (IBD), birth defects, veterans’ health, pain management, opioid use disorder, and environmental science. We also develop new machine learning and AI algorithms over the data in our platforms.",
        "url": "https://ctds.uchicago.edu",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Zulip": {
        "desc": "Modern team chat app designed for efficiency.",
        "tech_stack": [
            "python",
            " django",
            " typescript",
            " react native",
            " electron"
        ],
        "topics": [
            "mobile",
            " great developer tooling",
            " visual design",
            " teaching quality codebase",
            " team chat"
        ],
        "detail": "Zulip is the only modern team chat app that is ideal for both live and asynchronous conversations. Zulip has a web app, a cross-platform mobile app for iOS and Android, cross-platform desktop and terminal apps, and over 100 native integrations. The entire Zulip codebase is 100% open source. Zulip has been gaining in popularity since it was released as open source software in late 2015, with code contributions from over 1000 people from all around the world. Thousands of people use Zulip every day, and your work on Zulip will have meaningful impact on their experience. As an organization, we value engaged, responsive mentorship and making sure our product quality is extremely high. You can expect to receive disciplined code reviews by highly experienced engineers. Since Zulip is a team chat product, your GSoC experience with the Zulip project will be highly interactive. As part of our commitment to mentorship, Zulip has over 160,000 words of documentation for developers, much of it designed to explain not just how Zulip works, but why Zulip works the way that it does. To learn more about the experience of doing GSoC with Zulip, check out our blog post: https://blog.zulip.com/2021/09/30/google-summer-of-code-2021/.",
        "url": "https://zulip.com/",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Organic Maps": {
        "desc": "Offline maps app for tourists, cyclers & hikers",
        "tech_stack": [
            "android",
            " java",
            " c++",
            " ios",
            " OpenStreetMap"
        ],
        "topics": [
            "privacy",
            " maps",
            " navigation",
            " mobile",
            " offline"
        ],
        "detail": "Organic Maps is the ultimate companion app for travelers, tourists, hikers, and cyclists: - Detailed offline maps with places that don't exist on other maps, thanks to OpenStreetMap - Cycling routes, hiking trails, and walking paths - Contour lines, elevation profiles, peaks, and slopes - Turn-by-turn walking, cycling, and car navigation with voice guidance - Fast offline search on the map - Bookmarks export and import in KML/KMZ formats (GPX is planned) - Dark Mode to protect your eyes - Countries and regions don't take a lot of space - Free and open-source Organic Maps is pure and organic, made with love: - Respects your privacy - Saves your battery - No unexpected mobile data charges",
        "url": "https://organicmaps.app",
        "tags": [
            "End user applications"
        ],
        "discord": "mailto:hello@organicmaps.app",
        "twitter": "https://github.com/organicmaps/organicmaps/issues"
    },
    "The Linux Foundation": {
        "desc": "Non-profit consortium fostering growth of Linux",
        "tech_stack": [
            "c",
            " linux",
            " c++",
            " cups",
            " ipp"
        ],
        "topics": [
            "kernel",
            " automotive",
            " printing",
            " iio",
            " zephyr"
        ],
        "detail": "The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Founded in 2007 as a merger of the former Free Standards Group (FSG) and the former Open Source Developer Lab (OSDL), the LF sponsors the work of Linux creator Linus Torvalds and is supported by leading Linux and open source companies and developers from around the world. The Linux Foundation promotes, protects and standardizes Linux by providing unified resources and services needed for open source to successfully compete with closed platforms. For more see our [About page](https://www.linuxfoundation.org/about/). All software produced by us is free software published under OSI-approved licenses. See project ideas page for the license used by each project.",
        "url": "http://www.linuxfoundation.org/",
        "tags": [
            "Operating systems"
        ],
        "discord": "https://wiki.linuxfoundation.org/gsoc/google-summer-code-2022#contact_us",
        "twitter": "mailto:till@linux.com"
    },
    "Casbin": {
        "desc": "Authorization library that supports RBAC and ABAC",
        "tech_stack": [
            "javascript",
            " java",
            " go",
            " OIDC",
            " OAuth"
        ],
        "topics": [
            "security",
            " cloud",
            " authorization",
            " IAM",
            " Authentication"
        ],
        "detail": "Casbin is a powerful and efficient open-source access control library. It provides support for enforcing authorization based on various access control models like ACL, RBAC, ABAC for Golang, Java, Node.js, PHP, Python, .NET (C#), Delphi and Rust. What Casbin does: - Enforce the policy in the classic {subject, object, action} form or a customized form as you defined, both allow and deny authorizations are supported. - Handle the storage of the access control model and its policy. - Manage the role-user mappings and role-role mappings (aka role hierarchy in RBAC). Support built-in superuser like root or administrator. - A superuser can do anything without explict permissions. - Multiple built-in operators to support the rule matching. For example, keyMatch can map a resource key /foo/bar to the pattern /foo*. What Casbin does NOT do: - Authentication (aka verify username and password when a user logs in) Manage the list of users or roles. I believe it's more convenient for the project itself to manage these entities. - Users usually have their passwords, and Casbin is not designed as a password container. However, Casbin stores the user-role mapping for the RBAC scenario. For more details, see: https://casbin.org/",
        "url": "https://casbin.org",
        "tags": [
            "Web",
            "Security"
        ],
        "discord": "mailto:admin@casbin.org",
        "twitter": "https://summerofcode.withgoogle.com/casbin@googlegroups.com"
    },
    "Ruby": {
        "desc": "Ruby is an object-oriented programming language",
        "tech_stack": [
            "ruby on rails",
            " ruby",
            " rubygems",
            " bundler"
        ],
        "topics": [
            "security",
            " web"
        ],
        "detail": "The Ruby organization collects mentors and students working on the Ruby language (MRI), the Ruby packaging system (Bundler, RubyGems, and RubyGems.org), and other Ruby projects. Any Ruby OSS project is eligible to be included in the Ruby GSOC organization.",
        "url": "https://www.ruby-lang.org/",
        "tags": [
            "Programming languages",
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "GNU Radio": {
        "desc": "The free & open software radio ecosystem",
        "tech_stack": [
            "python",
            " c++",
            " qt",
            " simd"
        ],
        "topics": [
            "real-time",
            " dsp",
            " communications engineering",
            " cybersecurity",
            " Software-Defined Radio"
        ],
        "detail": "GNU Radio is a free & open-source software development toolkit that provides signal processing blocks to implement software radios. It can be used with readily-available low-cost external RF hardware to create software-defined radios, or without hardware in a simulation-like environment. It is widely used in research, industry, academia, government, and hobbyist environments to support both wireless communications research and real-world radio systems. In brief, a software radio is a radio system which performs the required signal processing in software instead of using dedicated integrated circuits in hardware. The benefit is that since software can be easily replaced in the radio system, the same hardware can be used to create many kinds of radios for many different communications standards; thus, one software radio can be used for a variety of applications! You can use GNU Radio to write applications to receive and transmit data with radio hardware, or to create entirely simulation-based applications. GNU Radio has filters, channel codes, synchronization elements, equalizers, demodulators, vocoders, decoders, and many other types of blocks which are typically found in signal processing systems. More importantly, it includes a method of connecting these blocks and then manages how data is passed from one block to another. Extending GNU Radio is also quite easy; if you find a specific block that is missing, you can quickly create and add it. GNU Radio applications can be written in either C++ or Python, while the performance-critical signal processing path is implemented in C++ using processor floating-point extensions where available. This enables the developer to implement real-time, high-throughput radio systems in a simple-to-use, rapid-application-development environment.",
        "url": "https://www.gnuradio.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "The Tor Project": {
        "desc": "Defend yourself against tracking and surveillance.",
        "tech_stack": [
            "c",
            " python",
            " rust"
        ],
        "topics": [
            "security",
            " privacy",
            " anti-censorship",
            " Human Rights",
            " Surveillance"
        ],
        "detail": "We believe everyone should be able to explore the internet with privacy. We are the Tor Project, a 501(c)(3) US nonprofit. We advance human rights and defend your privacy online through free software and open networks.",
        "url": "https://www.torproject.org/",
        "tags": [
            "Web",
            "Security"
        ],
        "discord": "https://support.torproject.org/get-in-touch/#irc-help",
        "twitter": "https://forum.torproject.net/"
    },
    "LEAP Encryption Access Project": {
        "desc": "Privacy should not be a priviledge",
        "tech_stack": [
            "java",
            " golang",
            " qt5",
            " docker",
            " ansible"
        ],
        "topics": [
            "privacy",
            " vpn",
            " Circumvention"
        ],
        "detail": "We built a simple, easy-to-use VPN. We work with trusted service providers to build and brand their VPN service. All aspects of LEAP’s VPN, the server side and the application, are 100% open source and available on Android, Windows, Mac and Linux. We integrate and develop circumvention mechanisms to ensure users world wide can access our service.",
        "url": "https://leap.se",
        "tags": [
            "End user applications",
            "Security"
        ],
        "discord": "mailto:info@leap.se",
        "twitter": "https://summerofcode.withgoogle.com/leap-discuss@lists.riseup.net"
    },
    "Purr Data": {
        "desc": "Realtime Audio/Visual Programming Environment",
        "tech_stack": [
            "c",
            " javascript",
            " html5",
            " Emscripten"
        ],
        "topics": [
            "web",
            " graphics",
            " audio",
            " realtime"
        ],
        "detail": "Purr Data is a visual programming language with an emphasis on generating sound, video, 2D/3D graphics, and connecting through sensors, input devices, and MIDI as well as OSC devices. It has an HTML5 frontend. It also has realtime DSP backend written in C which can run natively or in the browser. Purr Data has a special emphasis on generating audio and/or video in real time, with low latency. Much of its design focuses on receiving, manipulating, and delivering high-quality audio signals. Specifically, the software addresses the problem of how to do this efficiently and reliably on general purpose operating systems like macOS, Windows, Debian, etc.-- i.e., systems designed mainly for multi-tasking. Purr Data can easily work over local and remote networks. It can be used to integrate wearable technology, motor systems, lighting rigs, and other equipment. Purr Data is also suitable for learning basic multimedia processing and visual programming methods, as well as for realizing complex systems for large-scale projects.",
        "url": "https://www.purrdata.net/",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "FOSSology": {
        "desc": "Open Source License Compliance by OSS",
        "tech_stack": [
            "python",
            " postgresql",
            " c/c++",
            " php",
            " reactjs"
        ],
        "topics": [
            "automation",
            " spdx",
            " license compliance",
            " nlp",
            " compliance automation"
        ],
        "detail": "FOSSology is an open source license compliance software system and toolkit. As a toolkit you can run license, copyright and export control scans from the command line. As a system, a database and web UI are provided to give you a compliance workflow. License, copyright and export scanners are tools used in the workflow.",
        "url": "https://fossology.org",
        "tags": [
            "Web",
            "Other"
        ],
        "discord": "https://fossology.slack.com/",
        "twitter": "https://fossology.org/"
    },
    "MariaDB": {
        "desc": "The fastest growing Open Source Database",
        "tech_stack": [
            "python",
            " javascript",
            " c/c++",
            " perl",
            " databases"
        ],
        "topics": [
            "Database Engines",
            " SQL Features"
        ],
        "detail": "MariaDB Foundation is the non-profit organization behind MariaDB Server, the fastest growing open source databases. MariaDB Foundation's mission is to ensure the continuity of the MariaDB Server code as well as foster and facilitated collaboration within the MariaDB ecosystem. As part of GSoC, MariaDB Foundation seeks to bring more developers into the MariaDB Server (and related projects) code base.",
        "url": "https://mariadb.org",
        "tags": [
            "Data"
        ],
        "discord": "https://launchpad.net/~maria-developers",
        "twitter": "https://mariadb.com/kb/en/mailing-lists/"
    },
    "GNOME Foundation": {
        "desc": "A diverse and sustainable free software desktop.",
        "tech_stack": [
            "c",
            " linux",
            " rust",
            " gtk",
            " Flatpak"
        ],
        "topics": [
            "operating systems",
            " desktop",
            " graphics",
            " open source",
            " apps"
        ],
        "detail": "The GNOME Foundation is a non-profit organization that believes in a world where everyone is empowered by technology they can trust. We do this by building a diverse and sustainable free software personal computing ecosystem.",
        "url": "https://gnome.org",
        "tags": [
            "Operating systems",
            "Development tools"
        ],
        "discord": "https://discourse.gnome.org/",
        "twitter": "https://twitter.com/gnome"
    },
    "Electron": {
        "desc": "Cross-platform desktop apps with web technologies",
        "tech_stack": [
            "javascript",
            " node.js",
            " c++",
            " typescript",
            " Chromium"
        ],
        "topics": [
            "desktop",
            " framework",
            " javascript"
        ],
        "detail": "Electron is a framework for building desktop applications using JavaScript, HTML, and CSS. By embedding Chromium and Node.js into its binary, Electron allows you to maintain one JavaScript codebase and create cross-platform apps that work on Windows, macOS, and Linux — no native development experience required.",
        "url": "https://electronjs.org",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "https://electronjs.org/blog",
        "twitter": "https://twitter.com/electronjs"
    },
    "OSGeo (Open Source Geospatial Foundation)": {
        "desc": "The Open Source Geospatial Foundation",
        "tech_stack": [
            "c",
            " python",
            " javascript",
            " java",
            " c++"
        ],
        "topics": [
            "open science",
            " gis",
            " citizen science",
            " geolocation",
            " mapping"
        ],
        "detail": "The Open Source Geospatial Foundation (OSGeo) is a not-for-profit organization whose mission is to foster global adoption of open geospatial technology by being an inclusive software foundation devoted to an open philosophy and participatory community driven development.\n\nOSGeo serves as an umbrella organization for the Open Source Geospatial community in general and several code projects in particular:\n* Web Mapping: deegree, geomajas, GeoMOOSE, GeoServer, Mapbender, MapFish, MapGuide Open Source, MapServer, OpenLayers.\n* Desktop Applications: GRASS GIS, gvSIG, Marble, QGIS.\n* Geospatial Libraries: FDO, GDAL/OGR, GEOS, GeoTools, OSSIM, PostGIS.\n* Metadata Catalogues: GeoNetwork, pycsw.\n* Content Management Systems: GeoNode.\n* Community Projects: pgRouting, istSOS, MetaCRS, Opticks, Orfeo ToolBox (OTB), PyWPS, Team Engine, ZOO-Project.\n* Other (non-code) Projects: GeoForAll (Education and Curriculum), OSGeoLive DVD, Public Geospatial Data.\n\nWe host regional and international FOSS4G conferences with typical attendance of 500-1100+ geospatial developers, industry and government leaders, and researchers. Our mailing lists collectively go out to ~ 30,000 unique subscribers.",
        "url": "https://www.osgeo.org/",
        "tags": [
            "Other"
        ],
        "discord": "https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students#How_to_get_in_contact_via_IRC",
        "twitter": "https://www.osgeo.org/community/communications/"
    },
    "Global Alliance for Genomics and Health": {
        "desc": "We develop genomics tools to benefit human health",
        "tech_stack": [
            "python",
            " postgresql",
            " java",
            " react",
            " rust"
        ],
        "topics": [
            "web",
            " genomics",
            " bioinformatics",
            " genetics",
            " standards"
        ],
        "detail": "The Global Alliance for Genomics and Health (GA4GH) was formed to help accelerate the potential of genomic medicine to advance human health. It brings together over 400 leading genome institutes and centers with IT industry leaders to create global standards and tools for the secure, privacy respecting and interoperable sharing of Genomic data.",
        "url": "https://ga4gh.org",
        "tags": [
            "Science and medicine",
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Blender Foundation": {
        "desc": "The Freedom to Create",
        "tech_stack": [
            "c",
            " python",
            " opengl",
            " c++",
            " vulkan"
        ],
        "topics": [
            "games",
            " graphics",
            " 3d",
            " rendering",
            " animation"
        ],
        "detail": "Blender is a free and open source 3D creation suite, providing individuals and small teams a complete pipeline for 3D graphics, modeling, animation and games. Blender is being made by 100s of active volunteers from all around the world; by studios and individual artists, professionals and hobbyists, scientists and students, vfx experts and animators, and so on. All of them are united by an interest to have access to a fully free/open source 3D creation pipeline. Blender Foundation supports and facilitates these goals - even employs a staff for that - but fully depends on the online community to achieve it.",
        "url": "https://www.blender.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "RTEMS Project": {
        "desc": "A real-time operating system for Earth & Space",
        "tech_stack": [
            "python",
            " c/c++",
            " assembly",
            " posix"
        ],
        "topics": [
            "kernel",
            " embedded",
            " real-time",
            " multicore",
            " rtos"
        ],
        "detail": "RTEMS (Real-Time Executive for Multiprocessor Systems) is a free real-time operating system (RTOS) designed for deeply embedded systems such as automobile electronics, robotic controllers, and on-board satellite instruments. RTEMS is free open source software that supports multi-processor systems for over a dozen CPU architectures and over 150 specific system boards. In addition, RTEMS is designed to support embedded applications with the most stringent real-time requirements while being compatible with open standards such as POSIX. RTEMS includes optional functional features such as TCP/IP and file systems while still offering minimum executable sizes under 20 KB in useful configurations. The RTEMS Project is the collection of individuals, companies, universities, and research institutions that collectively maintain and enhance the RTEMS software base. As a community, we are proud to be popular in the space application software and experimental physics communities. RTEMS has been to Venus, circles Mars, is aboard Curiosity, is in the asteroid belt, is on its way to Jupiter, and is circling the sun. It is in use in many high energy physics research labs around the world. There are many RTEMS users who do not belong to the space or physics communities, but our small part in contributing to basic scientific knowledge makes us proud.",
        "url": "https://www.rtems.org/",
        "tags": [
            "Operating systems",
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "coreboot": {
        "desc": "Fast, secure and flexible BIOS firmware",
        "tech_stack": [
            "c",
            " assembly",
            " arm",
            " x86"
        ],
        "topics": [
            "hardware",
            " drivers",
            " firmware",
            " boot loader",
            " BIOS"
        ],
        "detail": "coreboot provides a fast, reliable, secure, and predictable boot-firmware solution for numerous modern and legacy chipsets. There are millions of devices running coreboot, including Google Chromebooks and Chromeboxes, and it runs in many datacenters. In 2021, coreboot.org had over 300 active developers, and over 6000 commits. The coreboot project believes in the principles of Open Source software. It borrows many well known concepts from other Open Source projects: Kconfig, Linux kernel coding style, git repository, and Gerrit for code reviews. coreboot has numerous advantages over other firmware projects. It comes with SoC support available to all developers. The codebase is shared with developers and companies which are helping to improve the SoC and driver-specific implementations. ** Extremely fast ** - coreboot is designed to do the minimum amount necessary and get out of the way. - Desktop and Notebooks boot up in 400ms - 2.5s. - Server boot time can be as low as a quarter of the OEM BIOS boot time. ** Flexible and customizable ** - Because coreboot only does hardware init, then jumps to a payload to continue, it is very flexible. - GPLv2 licensed core. Payloads can be proprietary and we offer a BSD licensed support library. coreboot provides ready-to-build payloads like UEFI, SeaBIOS, U-Boot, Grub2 and many more. - Recovery Mode based on multiple copies of the firmware which can be updated independently. - Integrity of stages and binaries in coreboot can be easily verified. - Designed for security by default. - Uses a minimal trusted computing base for each platform which is easily auditable, helping to guarantee security. As coreboot is Open Source, anyone can check the codebase. ** Debugging ** - There are multiple ways to extract the boot log, from classic serial to EHCI debug, even over the pc-speaker. - GDB Stub support via serial. - In memory console log support. - Tracing functions and other exotic features are supported.",
        "url": "https://coreboot.org",
        "tags": [
            "Operating systems",
            "Security"
        ],
        "discord": "https://doc.coreboot.org/community/forums.html",
        "twitter": "https://doc.coreboot.org/community/forums.html"
    },
    "Submitty": {
        "desc": "Homework Autograding and Course Management Tools",
        "tech_stack": [
            "python",
            " postgresql",
            " javascript",
            " c++",
            " php"
        ],
        "topics": [
            "education",
            " visualization",
            " web",
            " privacy/security",
            " communication"
        ],
        "detail": "Submitty is an open source programming assignment submission system with secure and automated testing and grading, efficient manual TA/instructor grading, and additional tools for overall course management and communication between students and instructional staff. Submitty was launched by the Rensselaer Center for Open Source Software (RCOS) in 2014. https://github.com/Submitty/ Key Features + Secure testing of many programming languages: Python, C/C++, Java, etc. + Customizable automated grading with immediate feedback to students, and optional hidden or randomized tests. + Advanced grading tools: static analysis, JUnit, code coverage, memory debuggers, networked assignments, custom Docker containers, and screenshots/GIFs of graphics programs. + Individual or team assignments submittyed by drag-and-drop or version control. + Correct mistakes through multiple submissions, flexible ``late day’’ policy + Interface for complementary instructor/TA manual grading, regrade requests, anonymized peer grading. + Instructor bulk upload of scanned .pdf exams, QR code name matching, pdf annotation. + Supports course material hosting, term grades spreadsheet, plagiarism detection. + Integrated discussion forum, email announcements, lecture polling, office hours queue, and student activity dashboard. + Scales to multiple courses, thousands of students, multiple instructors and TAs per course + Open-source, free to use, install on your own hardware, or VPS Submitty has been used at a half dozen other universities and we aim to grow to more users and developers. The courses using Submitty cover the undergraduate and graduate curriculum from introductory programming courses, intermediate and advanced theory courses, popular junior/senior electives with team projects and written reports, and specialized graduate courses. We regularly present our work at the annual ACM SIGCSE conference.",
        "url": "https://submitty.org",
        "tags": [
            "End user applications",
            "Web"
        ],
        "discord": "https://submitty.org/index/contact",
        "twitter": "https://twitter.com/submitty"
    },
    "CNCF": {
        "desc": "Building sustainable ecosystems for cloud native",
        "tech_stack": [
            "prometheus",
            " kubernetes",
            " OpenTelemetry",
            " envoy"
        ],
        "topics": [
            "cloud",
            " cloud native",
            " observability"
        ],
        "detail": "Cloud Native Computing Foundation (CNCF) serves as the vendor-neutral home for many of the fastest-growing open source projects, including Kubernetes, Prometheus, and Envoy.",
        "url": "https://cncf.io",
        "tags": [
            "Data",
            "Infrastructure and cloud"
        ],
        "discord": "mailto:soc@cncf.io",
        "twitter": "https://twitter.com/cloudnativefdn"
    },
    "MBDyn": {
        "desc": "Open Source Multibody Simulation",
        "tech_stack": [
            "python",
            " c++"
        ],
        "topics": [
            "robotics",
            " scientific computing",
            " multibody dynamics",
            " aeroelasticity",
            " Structural engineering"
        ],
        "detail": "MBDyn is the first free general purpose Multibody Dynamics analysis software. It has been developed at the Dipartimento di Scienze e Tecnologie Aerospaziali (formerly Dipartimento di Ingegneria Aerospaziale) of the University \"Politecnico di Milano\", Italy. MBDyn features the integrated multidisciplinary simulation of multibody, multiphysics systems, including nonlinear mechanics of rigid and flexible bodies (geometrically exact & composite-ready beam and shell finite elements, component mode synthesis elements, lumped elements) subjected to kinematic constraints, along with smart materials, electric networks, active control, hydraulic networks, and essential fixed-wing and rotorcraft aerodynamics. MBDyn simulates the behavior of heterogeneous mechanical, aeroservoelastic systems based on first principles equations. MBDyn can be easily coupled to external solvers for co-simulation of multiphysics problems, e.g. Computational Fluid Dynamics (CFD), terradynamics, block-diagram solvers like Scicos, Scicoslab and Simulink, using a simple C, C++ or Python peer-side API. MBDyn is being actively developed and used in the aerospace (aircraft, helicopters, tiltrotors, spacecraft), wind energy (wind turbines), automotive (cars, trucks) and mechatronic fields (industrial robots, parallel robots, micro aerial vehicles (MAV)) for analysis and simulation of complex systems dynamics. The extension of available analysis domains to new models and the introduction of new analysis domains is planned, and problem-driven: if you need to solve a specific problem, let us know. Run-time loading of user-defined modules is leveraged to let users extend the feature library (elements, drives, constitutive laws, and more). On GNU/Linux, real-time execution is supported under RTAI, the Real-Time Application Interface, and POSIX tight scheduling.",
        "url": "http://www.mbdyn.org/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Responsible AI and Human Centred Technology": {
        "desc": "Human-centered and responsible AI for all",
        "tech_stack": [
            "python",
            " javascript",
            " Technical writing"
        ],
        "topics": [
            "machine learning",
            " ai",
            " Fairness",
            " Robustness",
            " Safety",
            " Interpretibility"
        ],
        "detail": "Responsible AI & Human-Centered Technology (RAI-HCT) is Google Research’s center-of-excellence focused on ensuring that AI/ML and its development positively impacts our users and the world, particularly marginalized communities. RAI-HCT has both researchers, focused on developing breakthrough innovations around responsible AI topics (e.g. fairness, robustness, safety), as well as product and engineering teams that develop infrastructure and solutions for Google products and open-source libraries. Our current offerings include a mix of tools from PAIR(http://ai.google/pair) and Tensorflow Responsible AI toolkit(https://www.tensorflow.org/responsible_ai/guide)",
        "url": "https://www.tensorflow.org/responsible_ai",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://groups.google.com/u/2/a/tensorflow.org/g/rai-gsoc-2022",
        "twitter": "mailto:gsoc-rai-mentors@google.com"
    },
    "Sugar Labs": {
        "desc": "Learning software for children",
        "tech_stack": [
            "python",
            " gtk",
            " typescript",
            " javascipt"
        ],
        "topics": [
            "education",
            " games",
            " desktop"
        ],
        "detail": "Sugar is an activity-focused, free/libre open-source software learning platform for children. Collaboration, reflection, and discovery are integrated directly into the user interface. Through Sugar's clarity of design, children and teachers have the opportunity to use computers on their own terms. Students can reshape, reinvent, and reapply both software and content into powerful learning activities. Sugar's focus on sharing, criticism, and exploration is grounded in the culture of free software (FLOSS)",
        "url": "https://sugarlabs.org",
        "tags": [
            "End user applications",
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "XMPP Standards Foundation": {
        "desc": "XSF develops an open-standard messaging protocol",
        "tech_stack": [
            "javascript",
            " java",
            " go",
            " vala",
            " xmpp"
        ],
        "topics": [
            "instant messaging",
            " chat",
            " WebRTC",
            " Jingle",
            " Real-Time Communication"
        ],
        "detail": "The XMPP Standards Foundation (XSF) is an independent, nonprofit standards development organization with the mission to build an open, secure, feature-rich, federated infrastructure for real-time communication and collaboration over the Internet. We seek to achieve that goal by developing the world’s best open protocols for instant messaging, presence, and other forms of near-real-time communication, based on the IETF’s Extensible Messaging and Presence Protocol (XMPP). By “best” we mean simplest, most extensible, most powerful, most secure. Moreover, we value freedom, openness, and good technical design.",
        "url": "https://xmpp.org/",
        "tags": [
            "Social and communication",
            "Infrastructure and cloud"
        ],
        "discord": "https://mail.jabber.org/mailman/listinfo/gsoc",
        "twitter": "mailto:xsfcommteam@protonmail.com"
    },
    "The Mifos Initiative": {
        "desc": "End Poverty One Line of Code at a Time",
        "tech_stack": [
            "android",
            " java",
            " kotlin",
            " spring",
            " angular"
        ],
        "topics": [
            "cloud",
            " ai",
            " fintech",
            " financial inclusion",
            " mobile banking"
        ],
        "detail": "We are a global 501(c)3 fintech non-profit leveraging the cloud, mobile & open source community to democratize financial services worldwide and digitally transform the world’s 3 billion poor and underbanked. Mifos has pioneered open source banking technology for the past fifteen years transforming the entire sector at each major stage of evolution from microfinance to financial inclusion to digital financial services and now embedded finance. Mifos guides the open source community, steers the roadmap, and stewards the vibrant ecosystem of organizations building solutions on its open platform. Our building blocks for banking, recognized as digital public goods, make core banking commoditized infrastructure, empowering any organization, anywhere to embed any financial service to any customer via any channel. These building blocks provide the common functionalities for creating customers, managing wallets, savings and loan accounts, orchestrating payments, and maintaining the financial ledger & reports. More than 20 million clients are reached by 500+ financial institutions across 41 countries using solutions powered by our APIs.",
        "url": "https://mifos.org",
        "tags": [
            "Data",
            "End user applications"
        ],
        "discord": "https://mifos.org/resources/community/communications/",
        "twitter": "https://gitter.im/openMF/mifos"
    },
    "Ste||ar group": {
        "desc": "Shaping a Scalable Future",
        "tech_stack": [
            "c++",
            " hpc"
        ],
        "topics": [
            "library",
            " optimization",
            " parallel algorithms",
            " hpx",
            " application"
        ],
        "detail": "The STE||AR Group is an international team of researchers who understand that a new approach to parallel computation is needed. Our work is crafted around the idea that we need to invent new ways to more efficiently use the resources that we have and use the knowledge that we gain to help guide the creation of the machines of tomorrow. This organization aims to support, coordinate, and distribute research done in this area by creating a marketplace of ideas where concepts are debated and solutions are transparently developed.",
        "url": "http://stellar-group.org/",
        "tags": [
            "Science and medicine",
            "Programming languages"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CERN-HSF": {
        "desc": "Umbrella for Particle Physics-related projects",
        "tech_stack": [
            "python",
            " c/c++",
            " data analysis",
            " artificial intelligence",
            " container orchestration"
        ],
        "topics": [
            "machine learning",
            " big data",
            " algorithmics",
            " particle physics",
            " Performance Optimisation"
        ],
        "detail": "CERN-HSF (High-Energy Physics Software Foundation) is the umbrella organization for high-energy physics-related projects in GSoC. The HEP Software Foundation (http://hepsoftwarefoundation.org/) facilitates the coordination of common international efforts in high-energy physics software and computing. CERN (European Organization for Nuclear Research, https://home.cern) has participated in GSoC since 2011 as the CERN-SFT group, which provides common software for CERN's experiments. In 2017, the program expanded to include many software projects from the whole field of high-energy physics. The vast majority of our GSoC projects do not require any physics knowledge. The experiments at CERN, such as the Large Hadron Collider, the world’s largest and most powerful particle accelerator (http://home.cern/topics/large-hadron-collider) try to answer fundamental questions about the Universe. For example, what is the nature of mass? What are the elementary building blocks of the Universe? What was the early Universe like? What is the nature of dark matter and dark energy? Why is there an asymmetry between matter and antimatter? In 2012, LHC experiments announced the discovery of a new particle, the Higgs Boson, that helps explain how particles obtain mass. Also, CERN is the birthplace of the World Wide Web. Today, particle physicists are working on analyzing the data from the experiments to study the properties of the newly discovered particle and to search for new physics, such as dark matter or extra dimensions. This requires a lot of sophisticated software. The open-source high-energy physics projects to which students can contribute during GSoC span many high-energy physics software projects: data analysis, detector and accelerator simulation, event reconstruction, data management and many others. We look forward to your contributions!",
        "url": "http://hepsoftwarefoundation.org/activities/gsoc.html",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "RADAR-base": {
        "desc": "Improve people's quality of life using patient generated data",
        "tech_stack": [
            "java",
            " kotlin",
            " docker",
            " angular",
            " kafka"
        ],
        "topics": [
            "web",
            " mhealth",
            " remote patient monitoring",
            " micro-services",
            " devices"
        ],
        "detail": "RADAR-base (Remote Assessment of Disease And Relapses) is an open source platform for remote patient monitoring. The main focus of RADAR-base is seamless integration of data streams from various wearables and mobile applications to collect patient generated data in real time and store, manage and share the collected data with researchers for retrospective analysis. RADAR-base provides both passive and active data collection. Passive collection can be done by directly sending data from phone sensors or device sensor data through the (pRMT) app or device sensor data via cloud storage to RADAR-base or combination of these options. Active data collection using the active Remote Monitoring Technologies (aRMT) app, which includes the use of questionnaires that might ask patients about their mood, medication intake, or the severity of symptoms. All of the collected data can be extracted from the platform in structured formats. RADAR-base community consists of software engineers, data scientists, researchers,operations engineers, bioinformaticians. The RADAR-base platform was build and maintained by The Hyve B.V (https://www.thehyve.nl/) and PhiDataLab (https://phidatalab.org/) at Kings College London under the IMI RADAR-CNS and IMI RADAR-AD project. Currently, the platform has been used by many academic institutes and research organizations to conduct remote monitoring studies. Funding statement and Disclaimer The RADAR-base platform was developed under projects IMI RADAR-CNS, IMI RADAR-AD, Bigdata@Heart and IMI H2O which received funding from the Innovative Medicines Initiative 2 Joint Undertaking under grant agreement numbers 115902, 806999, 116074 and 945345 respectively. This Joint Undertaking receives support from the European Union’s Horizon 2020 research and innovation programme and EFPIA. See www.imi.europa.eu for more details. Neither IMI nor the European Union and EFPIA are liable for any use that may be made of the information contained on this website.",
        "url": "https://radar-base.org/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "openSUSE Project": {
        "desc": "openSUSE is the makers' choice for sysadmins, developers and desktop",
        "tech_stack": [
            "python",
            " linux",
            " rust",
            " Testing",
            " configuration management"
        ],
        "topics": [
            "operating systems",
            " software quality",
            " developer tools",
            " containers",
            " edge"
        ],
        "detail": "The openSUSE Project is a worldwide effort that promotes the use of Linux, tools around it, and open source. The openSUSE community is made up of multiple contributing communities that collaborate as part of a global open-source network. The openSUSE community develops, builds and maintains many of the packages, tools and infrastructure for the distribution. The community works together in an open, transparent and friendly manner as part of the global Free and Open Source Software community. openSUSE creates one of the world's best Linux distributions, as well as a variety of tools, such as OBS, OpenQA, Kiwi, YaST, OSEM and Uyuni. Distributions include a rolling release (Tumbleweed), a stable annual release (Leap) and operating systems for edge, embedded, cloud and containers through MicroOS and Kubic. The project is controlled by its community and relies on the contributions of individuals, working as testers, writers, translators, usability experts, artists and ambassadors or developers. The project embraces a wide variety of technology, people with different levels of expertise, speaking different languages and having different cultural backgrounds.",
        "url": "https://get.opensuse.org/",
        "tags": [
            "Operating systems",
            "Development tools"
        ],
        "discord": "https://lists.opensuse.org/archives/list/project@lists.opensuse.org/",
        "twitter": "mailto:ddemaio@opensuse.org"
    },
    "RoboComp": {
        "desc": "Open-source framework to develop robot components",
        "tech_stack": [
            "python",
            " opencv",
            " c++",
            " qt",
            " pytorch"
        ],
        "topics": [
            "robotics",
            " computer vision",
            " component-based development",
            " Multi-agent Systems"
        ],
        "detail": "RoboComp is an open-source Robotics framework providing the tools to create and modify software components that communicate through public interfaces. Components may require, subscribe, implement or publish interfaces in a seamless way. Building new components is done using two domain-specific languages, IDSL and CDSL. With IDSL you define an interface and with CDSL you specify how the component will communicate with the world. With this information, a code generator creates C++ and/or Python sources, based on CMake, that compile and execute flawlessly. When some of these features have to be changed, the component can be easily regenerated and all the user-specific code is preserved thanks to a simple inheritance mechanism.",
        "url": "https://robocomp.github.io/web/",
        "tags": [
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "GRAME": {
        "desc": "Domain specific language for audio",
        "tech_stack": [
            "c",
            " python",
            " javascript",
            " c++",
            " typescript"
        ],
        "topics": [
            "audio",
            " compiler",
            " digital signal processing",
            " function programming language"
        ],
        "detail": "We develop Faust (Functional Audio Stream), a functional programming language for sound synthesis and audio processing with a strong focus on the design of synthesizers, musical instruments, audio effects, etc. Faust targets high-performance signal processing applications and audio plug-ins for a variety of platforms and standards.",
        "url": "https://faust.grame.fr",
        "tags": [
            "Programming languages",
            "Media"
        ],
        "discord": "mailto:research@grame.fr",
        "twitter": "https://faust.grame.fr/community/help/"
    },
    "Jenkins X": {
        "desc": "Accelerate Your Continuous Delivery on Kubernetes",
        "tech_stack": [
            "golang",
            " kubernetes",
            " gitops"
        ],
        "topics": [
            "cloud",
            " CI/CD"
        ],
        "detail": "We are a cloud native CI/CD project with a healthy community. We are trying to make CI/CD easy for kubernetes users by including of the best open source tools in the kubernetes ecosystem and making it work as a single platform.",
        "url": "https://jenkins-x.io/",
        "tags": [
            "Infrastructure and cloud",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "GeomScale": {
        "desc": "Scalable geometric and statistical software",
        "tech_stack": [
            "python",
            " c++",
            " r",
            " jupyter",
            " github-actions"
        ],
        "topics": [
            "mathematics",
            " data science",
            " computational biology",
            " computational geometry",
            " statistics"
        ],
        "detail": "GeomScale is a research and development project that delivers open source code for state-of-the-art algorithms at the intersection of data science, optimization, geometric, and statistical computing. The current focus of GeomScale is on scalable algorithms for sampling from high-dimensional distributions, integration, convex optimization, and their applications. One of our ambitions is to fill the gap between theory and practice by turning state-of-the-art theoretical tools in geometry and optimization to state-of-the-art implementations. Towards this goal, we will deliver various innovative solutions in a variety of application fields, like finance, computational biology, and statistics that will extend the limits of contemporary computational tools. GeomScale aims in serving as a building block for an international, interdisciplinary, and open community in high dimensional geometrical and statistical computing. The main development is currently performed in volesti, a generic open source C++ library, with R and (limited) Python interfaces, for high-dimensional sampling, volume approximation, and copula estimation for financial modelling. In particular, the current implementation scales up to hundred or thousand dimensions, depending on the problem. It is the most efficient software package for sampling and volume computation to date. It is, in several cases, orders of magnitude faster compared to packages that solve the same problems. It can be used to compute challenging multivariate integrals and to approximate optimal solutions in optimization problems. It has already found important applications in systems biology by analyzing large metabolic networks (e.g., the latest human network) and in FinTech by detecting shock events and by evaluating portfolios performance in stock markets with thousands of assets. Other application areas include AI and in particular approximate weighted model integration, and data-driven power systems in control.",
        "url": "https://geomscale.github.io",
        "tags": [
            "Science and medicine"
        ],
        "discord": "https://gitter.im/GeomScale/community?utm_source=share-link&utm_medium=link&utm_campaign=share-link",
        "twitter": "mailto:geomscale@gmail.com"
    },
    "Ceph": {
        "desc": "The Future of Storage",
        "tech_stack": [
            "python",
            " javascript",
            " c++"
        ],
        "topics": [
            "distributed systems",
            " Software-Defined-Storage"
        ],
        "detail": "An open-source storage platform that implements storage on a single distributed computer cluster and provides a 3-in-1 interface for object-, block- and file-level storage.",
        "url": "https://ceph.io/en/",
        "tags": [
            "Data",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "mlpack": {
        "desc": "a fast, flexible machine learning library",
        "tech_stack": [
            "c++",
            " C++ template metaprogramming"
        ],
        "topics": [
            "machine learning",
            " embedded",
            " ai",
            " deep learning",
            " Neural networks"
        ],
        "detail": "mlpack is an intuitive, fast, and flexible C++ machine learning library with bindings to other languages. It is meant to be a machine learning analog to LAPACK, and aims to implement a wide array of machine learning methods and functions as a \"swiss army knife\" for machine learning researchers. In addition to its powerful C++ interface, mlpack also provides command-line programs and Python bindings, as well as bindings to other languages.",
        "url": "https://www.mlpack.org",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CHIPS Alliance": {
        "desc": "Open source IP, tools & standards for ASIC/FPGA",
        "tech_stack": [
            "fpga",
            " chisel",
            " risc-v",
            " systemverilog",
            " ASIC"
        ],
        "topics": [
            "soc",
            " IP cores",
            " ASIC design",
            " HDL",
            " chiplets"
        ],
        "detail": "CHIPS Alliance develops high-quality, open source hardware components and tooling for silicon devices and FPGAs. By creating an open and collaborative environment, shared infrastructure, processes, legal support and governance, CHIPS Alliance shares resources to lower the cost of development and increase confidence in high-quality open source building blocks it helps manage. Within CHIPS Alliance's workgroups covering areas such as Analog, FPGA, ASIC design tools, Chisel, Interconnects and Cores, companies and individuals can work together to develop open source IP, tools and standards. CHIPS Alliance is open to all organizations who are interested in collaborating on open source hardware or software tools to accelerate the creation of more efficient and innovative chip designs.",
        "url": "https://chipsalliance.org/",
        "tags": [
            "Programming languages",
            "Infrastructure and cloud"
        ],
        "discord": "https://github.com/f4pga/ideas/issues",
        "twitter": "https://kiwiirc.com/nextclient/#irc://irc.libera.chat/#F4PGA"
    },
    "Plone Foundation": {
        "desc": "Python-based CMS, with React front-end.",
        "tech_stack": [
            "python",
            " javascript",
            " react"
        ],
        "topics": [
            "web",
            " cms"
        ],
        "detail": "Plone is a Python-based CMS built with workflow and security at the forefront. It is developed by a world-wide community and uses modern technologies and techniques. It comes with a complete API and a React-based frontend. Also home to Guillotina.io, a full stack data framework, and the Zope and ZODB object database.",
        "url": "https://plone.org",
        "tags": [
            "Web"
        ],
        "discord": "mailto:gsoc@cleanclothes.org",
        "twitter": "https://twitter.com/plone"
    },
    "Mathesar": {
        "desc": "Webapp providing a UX-first interface to databases",
        "tech_stack": [
            "python",
            " postgresql",
            " javascript",
            " django",
            " svelte"
        ],
        "topics": [
            "databases",
            " web",
            " data",
            " nonprofit",
            " self-hosted"
        ],
        "detail": "Mathesar provides an intuitive user interface for non-technical users to work with relational databases without any existing knowledge of database concepts. Users can either set up a database from scratch or connect to an existing database. They can store, organize, and set up various views of their data. By our beta release, users will also be able to collaborate with other users, see visualizations of their data, and evolve their data model as their needs change. Mathesar is designed to be self-hosted on your own server.",
        "url": "https://wiki.mathesar.org/",
        "tags": [
            "Data",
            "End user applications"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "cBioPortal for Cancer Genomics": {
        "desc": "Aid discovery in complex cancer genomics data",
        "tech_stack": [
            "mysql",
            " javascript",
            " java",
            " react",
            " typescript"
        ],
        "topics": [
            "genomics",
            " cancer",
            " bioinformatics",
            " big data",
            " precision medicine"
        ],
        "detail": "The cBioPortal for Cancer Genomics is a resource designed to provide broad community access to cancer genomic data. It provides a unique user­-friendly and \"biology­-centric computational user interface\", with the goal of making genomic data more easily accessible to translational scientists, biologists, and clinicians. The interface was explicitly built and continues to evolve with careful usability studies involving multiple biological and clinical users, and an active and engaged user base. The public instance of cBioPortal (https://cbioportal.org/) is now one of the most popular online resources for cancer genomics data and attracts more than 4,000 unique visitors (cancer researchers and clinicians) per day. The two papers documenting the cBioPortal Cerami et al. Cancer Discov. 2012 & Gao et al. Sci. Signal. 2013 have been cited more than 5,600 and 5,100 times, respectively, since their publication. There are more than 30 actively used cBioPortal instances in hospitals, universities, pharmaceutical companies, and other institutes all over the globe. We are a group of software engineers, bioinformaticians, and cancer biologists building software solutions for precision medicine for cancer patients. Our overall goal is to build infrastructure to support clinical decisions for personalized cancer treatment by utilizing “big data” of cancer genomics and patient clinical profiles. Our multi-institutional team currently has more than 30 active members, primarily from Memorial Sloan Kettering Cancer Center, the Dana-Farber Cancer Institute, Princess Margaret Cancer Centre, Children's Hospital of Philadelphia, and The Hyve, a bioinformatics company from the Netherlands.",
        "url": "https://www.cbioportal.org/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CHAOSS": {
        "desc": "Community Health Analytics Open Source Software",
        "tech_stack": [
            "python",
            " postgresql",
            " javascript",
            " machine learning",
            " airflow"
        ],
        "topics": [
            "Diversity Equity and Inclusion",
            " open source software metrics",
            " software sustainability",
            " community building",
            " security and software bill of materials"
        ],
        "detail": "The importance of open source software is no longer in question and its importance raises important questions about how we understand the health of the open-source projects we rely on. Unhealthy projects can have negative impacts on the community involved in the project as well as organizations that rely on such projects. In response, people want to know more about the open-source projects they are engaged with. For example: 1. Open source contributors want to know where they should place their efforts and know that they are making an impact. 2. Open source communities want to attract new members, ensure consistent quality, and reward valuable members. 3. Open source companies want to know which communities to engage with, communicate the impact the organization has on the community, and evaluate the work of their employees within open source. Open source foundations want to identify and respond to community needs, evaluate the impact of their work, and promote communities. In response to these issues, the CHAOSS project develops metrics, practices, and software for making open source project health more understandable. By building measures of open source project health, CHAOSS seeks to improve the transparency and actionability of open source project health so that relevant stakeholders can make more informed decisions about open source project engagement. The project goals are to: 1. Establish standard implementation-agnostic metrics for measuring community health 2. Produce integrated open source software for analyzing software community development 3. Develop programs for the deployment of metrics not attainable through online trace data Build reproducible project health reports",
        "url": "https://chaoss.community",
        "tags": [
            "Data",
            "Other"
        ],
        "discord": "https://summerofcode.withgoogle.com/chaoss@lists.linuxfoundation.org",
        "twitter": "https://twitter.com/chaossproj"
    },
    "QEMU": {
        "desc": "Open source machine emulator and virtualizer",
        "tech_stack": [
            "c",
            " python",
            " linux",
            " rust"
        ],
        "topics": [
            "systems programming",
            " kernel",
            " compiler",
            " emulator",
            " hypervisor"
        ],
        "detail": "The QEMU Project includes the QEMU open source machine emulator and virtualizer and also acts as an umbrella organization for the KVM Linux kernel module and rust-vmm community. When used as a machine emulator, QEMU can run operating systems and programs made for one machine (e.g. an ARM board) on a different machine (e.g. your own PC). By using dynamic translation, it achieves very good performance. When used as a virtualizer, QEMU achieves near native performances by executing the guest code directly on the host CPU. QEMU supports virtualization when executing under the Xen hypervisor or using the KVM kernel module in Linux. When using KVM, QEMU can virtualize x86, ARM, server and embedded PowerPC, and S390 guests.",
        "url": "https://qemu.org/",
        "tags": [
            "Infrastructure and cloud",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "XWiki": {
        "desc": "The Advanced Open Source Enterprise Wiki",
        "tech_stack": [
            "javascript",
            " java",
            " html5",
            " css3",
            " velocity"
        ],
        "topics": [
            "web development",
            " wiki",
            " platform",
            " web applications",
            " structured data"
        ],
        "detail": "XWiki is an open source software development platform based on the wiki principles, under the LGPL license. In addition to being a full-featured wiki, it is also a second generation wiki allowing effortless development of collaborative web applications. On top of this platform a plethora of applications are developed, targeted mainly on aiding enterprise-level needs. XWiki has a vibrant community of developers and users, consisting of individual users as well as organizations around the world that are using XWiki for their own Communities or Intranets. Within XWiki, the development involves several levels: server-side platform programming in Java with Servlet technologies, server-side application development in Velocity, Groovy, and client-side development in JavaScript, CSS and HTML. We propose projects that cover server-side Servlet programming and client-side rich application development, together with usability and performance improvements.",
        "url": "https://www.xwiki.org/",
        "tags": [
            "Web",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "PostgreSQL": {
        "desc": "The Most Advanced Open Source Relational Database",
        "tech_stack": [
            "c",
            " python",
            " postgresql",
            " javascript",
            " sql"
        ],
        "topics": [
            "web",
            " database",
            " ui",
            " sql",
            " Benchmark"
        ],
        "detail": "PostgreSQL is a powerful, open source object-relational database system with over 30 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance.",
        "url": "https://postgresql.org",
        "tags": [
            "Data",
            "Web"
        ],
        "discord": "https://www.postgresql.org/community/irc/",
        "twitter": "https://postgres-slack.herokuapp.com/"
    },
    "AboutCode": {
        "desc": "Scan code for origin, license and vulnerabilities",
        "tech_stack": [
            "python",
            " javascript",
            " Django+PostgreSQL",
            " C/Rust/Go"
        ],
        "topics": [
            "dependencies",
            " vulnerabilities",
            " SoftwareCompositionAnalysis",
            " License",
            " SBOM"
        ],
        "detail": "AboutCode.org is a community of open source developers who are trying to make open source easier to use by providing open source tools to discover, identify and track open source components (aka. Software Composition Analysis – SCA). This includes tools, data and standards for code origin, FOSS licenses and security vulnerabilities.",
        "url": "https://aboutcode.org",
        "tags": [
            "Security",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "OpenCV": {
        "desc": "++ beneficial uses of computer vision in society",
        "tech_stack": [
            "python",
            " c++",
            " deep learning",
            " ai"
        ],
        "topics": [
            "robotics",
            " computer vision",
            " ai",
            " deep learning"
        ],
        "detail": "OpenCV promotes the beneficial uses of computer vision in society primarily through maintaining a state-of-the-art open and free code base and via courseware, contests, workshops and conferences. OpenCV, the Open Source Computer Vision Library includes state of the art computer vision and deep learning algorithms (including running deep networks) and apps. It is professionally coded and optimized. It can be used in C++, Python, javascipt, Julia, Cuda, OpenCL and Matlab. It runs on: Android, iOS, Windows, Linux and MacOS and many embedded implementations such as Raspberry Pi, Movidius, and RISC-V.",
        "url": "https://opencv.org/",
        "tags": [
            "Data",
            "Media"
        ],
        "discord": "https://twitter.com/opencvlibrary",
        "twitter": "https://forum.opencv.org/"
    },
    "Godot Engine": {
        "desc": "Multi-platform 2D and 3D game engine",
        "tech_stack": [
            "opengl",
            " c++",
            " vulkan",
            " webassembly"
        ],
        "topics": [
            "graphics",
            " cross-platform",
            " game engine",
            " game development",
            " programming"
        ],
        "detail": "Godot Engine is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so that users can focus on making games without having to reinvent the wheel. Games can be exported with one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows), mobile platforms (Android, iOS), as well as Web-based platforms (HTML5) and consoles. Godot is completely free and open source under the very permissive MIT license. No strings attached, no royalties, nothing. The users' games are theirs, down to the last line of engine code. Godot's development is fully independent and community-driven, empowering users to help shape their engine to match their expectations. It is supported by the Software Freedom Conservancy not-for-profit.",
        "url": "https://godotengine.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Neutralinojs": {
        "desc": "Lightweight cross-platform desktop app framework",
        "tech_stack": [
            "c",
            " javascript",
            " node.js",
            " c++",
            " typescript"
        ],
        "topics": [
            "desktop",
            " framework",
            " cross-platform",
            " Application Development"
        ],
        "detail": "Neutralinojs is a lightweight and portable desktop application development framework. It lets you develop lightweight cross-platform desktop applications using JavaScript, HTML, and CSS. You can extend Neutralinojs with any programming language (via extensions IPC) and use Neutralinojs as a part of any source file (via child processes IPC).",
        "url": "https://neutralino.js.org",
        "tags": [
            "Web",
            "Development tools"
        ],
        "discord": "mailto:neutralinojs@gmail.com",
        "twitter": "https://twitter.com/NeutralinoJs"
    },
    "Our World In Data": {
        "desc": "Explaining the world's biggest problems with data",
        "tech_stack": [
            "python",
            " mysql",
            " d3",
            " typescript",
            " pandas"
        ],
        "topics": [
            "open data",
            " data visualisation",
            " Data cataloging"
        ],
        "detail": "Poverty, disease, hunger, climate change, war, existential risks, and inequality: The world faces many great and terrifying problems. It is these large problems that our work at Our World in Data focuses on. Thanks to the work of thousands of researchers around the world who dedicate their lives to it, we often have a good understanding of how it is possible to make progress against the large problems we are facing. The world has the resources to do much better and reduce the suffering in the world. We believe that a key reason why we fail to achieve the progress we are capable of is that we do not make enough use of this existing research and data: the important knowledge is often stored in inaccessible databases, locked away behind paywalls and buried under jargon in academic papers. The goal of our work is to make the knowledge on the big problems accessible and understandable.",
        "url": "https://ourworldindata.org/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "GNU Compiler Collection (GCC)": {
        "desc": "GNU compilers",
        "tech_stack": [
            "c/c++",
            " gnu make",
            " gnu autotools"
        ],
        "topics": [
            "compilers",
            " developer tools",
            " toolchain",
            " openmp",
            " link time optimization"
        ],
        "detail": "The GNU Compiler Collection (GCC) is an optimizing compiler produced by the GNU Project supporting various programming languages, hardware architectures and operating systems. It includes front-ends for C, C++, D, Objective-C, Fortran, Ada, and Go, as well as libraries for these languages (such as libgcc and libstdc++). Modula-2, Cobol and Rust front-ends are under development too. GCC includes support for OpenMP, OpenACC and Static Analysis.",
        "url": "https://gcc.gnu.org/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "https://gcc.gnu.org/wiki/GCConIRC",
        "twitter": "https://gcc-rust.zulipchat.com/login/"
    },
    "Open3D team": {
        "desc": "A Modern Library for 3D Data Processing",
        "tech_stack": [
            "python",
            " c++",
            " cuda",
            " tensorflow",
            " pytorch"
        ],
        "topics": [
            "3D machine learning",
            " 3D data processing",
            " 3D visualization",
            " physically based rendering"
        ],
        "detail": "Open3D is an open-source library that supports rapid development of software that deals with 3D data. The Open3D frontend exposes a set of carefully selected data structures and algorithms in both C++ and Python. The backend is highly optimized and is set up for parallelization. We welcome contributions from the open-source community. Open3D-ML is an extension of Open3D for 3D machine learning tasks. It builds on top of the Open3D core library and extends it with machine learning tools for 3D data processing. Core features of Open3D include: - 3D data structures - 3D data processing algorithms - Scene reconstruction - Surface alignment - 3D visualization - Physically based rendering (PBR) - 3D machine learning support with PyTorch and TensorFlow - GPU acceleration for core 3D operations - Available in C++ and Python",
        "url": "http://www.open3d.org/",
        "tags": [
            "Data",
            "Media"
        ],
        "discord": "mailto:administrator@ivcl.org",
        "twitter": "mailto:sameer.sheorey@ivcl.org"
    },
    "Society for Arts and Technology (SAT)": {
        "desc": "Create teleimmersive multisensorial experiences.",
        "tech_stack": [
            "python",
            " javascript",
            " opengl",
            " c++",
            " supercollider"
        ],
        "topics": [
            "web",
            " graphics",
            " cloud",
            " multimedia",
            " accessibility"
        ],
        "detail": "The Society for Arts and Technology [SAT] is a non-profit organization recognized internationally for the development and creative use of immersive technologies, virtual reality and high-speed networks. Founded in 1996, its triple mission as a center for the arts, training and research, is to enable and host teleimmersive multisensorial experiences. SAT creates open-source tools for: Immersive rendering (Mirador), Interaction (LivePose), Projection mapping (Splash), Telepresence (Satellite hub + Scenic + Switcher), Audio spatialization (Audiodice + SATIE + vaRays), Data sharing (shmdata).",
        "url": "https://sat.qc.ca",
        "tags": [
            "Data",
            "Media"
        ],
        "discord": "https://gitlab.com/sat-mtl/google-summer-of-code/-/issues",
        "twitter": "https://twitter.com/SATmontreal"
    },
    "International Catrobat Association": {
        "desc": "Free visual coding apps for computational thinking",
        "tech_stack": [
            "javascript",
            " android",
            " swift",
            " kotlin",
            " php"
        ],
        "topics": [
            "education",
            " visual programming",
            " mobile programming",
            " game engines",
            " creativity tools"
        ],
        "detail": "Computational thinking for all with free visual coding apps The Catrobat project develops useful frameworks to create games, animations, or apps easily within a short time. This set of mobile creativity tools for smartphones is inspired by the well-known Scratch framework by the Lifelong Kindergarten Group at the MIT Media Lab. The motivation behind the project is that programming is an important cultural technique on the same level as mathematics and physics, from a practical as well as from a philosophical point of view. Our aim thus is to popularize the skills needed to program from an early age in a fun and engaging way that will facilitate the spread of its adoption among young people all over the world. Our awarded Android app “Pocket Code” is currently the most famous outcome of the project. Without the need for any further devices, users have the possibility to create their first program directly on their mobile device in just a few steps using visual \"Bricks\". Pocket Code supports all common device sensors, provides special \"Bricks\" for different robotic devices (Lego Mindstorms, Robotix Phiro, etc.) as well as for hardware devices such as the Arduino board or the Raspberry Pi, and of course offers elements of programming languages such as variables, if-statements, concurrency, etc. We also work on \"Pocket Code\" for iOS and on a large number of extensions. That’s why developers of different fields help us to keep our products up-to-date to meet the current needs of our users. Motivated by prizes (such as the Lovie Award, the Austrian National Innovation Award or the Re-Imagine Education Award) and being featured by different programs (like Google Play for Education or code.org), our team is working on many different subprojects and extensions. Over 500 developers already contributed to our project on different topics such as app development, web technologies, graphics, usability, internationalization, or design.",
        "url": "https://www.catrobat.org",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "https://catrob.at/mailinglist",
        "twitter": "https://github.com/Catrobat/Catroid#contributing"
    },
    "Scala Center": {
        "desc": "Guide and support the Scala community",
        "tech_stack": [
            "scala",
            " scala.js",
            " scala native"
        ],
        "topics": [
            "education",
            " compilers",
            " tooling"
        ],
        "detail": "We are an independent not-for-profit center established at EPFL. Scala Center's Mission is to guide and support the Scala community, coordinate and develop open-source libraries and tools for the benefit of all Scala users, provide deep, and quality, educational materials for Scala.",
        "url": "https://scala.epfl.ch/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "AOSSIE": {
        "desc": "Australian Umbrella Org for Open-Source Projects",
        "tech_stack": [
            "python",
            " javascript",
            " machine learning",
            " scala",
            " Blockchain"
        ],
        "topics": [
            "machine learning",
            " electronic voting",
            " natural language processing",
            " social science"
        ],
        "detail": "We are an Australian not-for-profit umbrella organization for open-source projects. We believe the open-source philosophy provides a resource-efficient channel to transfer knowledge and achieve innovation and education. In 2022, we offer the following projects: Agora (Scala, Javascript): a library of vote counting algorithms for democratic elections. Mind the Word (Javascript, HTML, CSS): a browser extension that helps users to learn new languages. Crowd Alert (React-Native, Expo, Jest): a cross-platform mobile application that allows users to post and view incidents around them Carbon Footprint (Javascript, HTML, CSS): a browser extension that raises environmental awareness regarding C02 emissions. Starcross (iOS,C++,OpenGL,Objective-C): Starcross is a hand-held planetarium for your iOS device. Can be used to identify stars, planets, nebulae and more. Social Street Smart (Chrome Extension): Social Street Smart is a Chrome Extension that makes the Internet a more productive place for users. Using algorithms and artificial intelligence, the extension hopes to face the major problems of the modern Internet. Monumento(Mobile Application): to provide users with a unique experience of exploring and learning more about the various monumental structures all around the world within the app. We have a diverse group of mentors, including GSoC students from previous years who decided to become long-term contributors as well as academics with extensive experience in supervising undergraduate, M.Sc. and PhD students on theses and projects, whose results are often published and presented in the most prestigious conferences of our research fields.",
        "url": "https://aossie.gitlab.io/",
        "tags": [
            "End user applications",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Jenkins": {
        "desc": "Jenkins, build great things at any scale",
        "tech_stack": [
            "javascript",
            " java",
            " go",
            " docker",
            " kubernetes"
        ],
        "topics": [
            "developer tools",
            " automation",
            " continuous integration",
            " continuous delivery",
            " devops"
        ],
        "detail": "Short description: Jenkins is a popular open source automation server which is used for building, testing, CI/CD, deployment and many other use-cases. Our motto is \"Build great things at any scale\". Long description: Jenkins, originally founded in 2006 as \"Hudson\", is one of the leading automation servers. Jenkins' motto is \"Build great things at any scale\". Using an extensible, plugin-based architecture developers have created hundreds of plugins to adapt Jenkins to a multitude of build, test, and deployment automation workloads. Jenkins is open-source, MIT License is used for most of the components. This year we invite potential GSoC contributors to join the Jenkins community and to work together to improve Jenkins. We have many strategic project ideas which are important to hundreds of thousands of Jenkins users. The project has over 600 active contributors working on Jenkins core, plugins, website, project infrastructure, localization activities, etc. In total we have more than 2,000 components including plugins, libraries, and various utilities. The main languages in the project are Java, Groovy and JavaScript, but we also have components written in other languages (Go, C/C++, C#, etc.). Jenkins project includes multiple sub-projects (including Configuration-as-Code, Infrastructure and Remoting) and special interest groups. These entities participate in GSoC as a part of the Jenkins project. The Jenkins project is a part of Continuous Delivery Foundation (CDF).",
        "url": "https://jenkins.io/",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "https://community.jenkins.io/c/contributing/gsoc/6",
        "twitter": "https://www.jenkins.io/"
    },
    "Kodi": {
        "desc": "The ultimate entertainment center",
        "tech_stack": [
            "python",
            " opengl",
            " c++",
            " ffmpeg",
            " sqlite"
        ],
        "topics": [
            "games",
            " audio",
            " video",
            " media",
            " tv"
        ],
        "detail": "Kodi is a free and open source (GPL) software media player and entertainment hub for digital media. Kodi is available for Linux, OSX, iOS, Android, and Windows, running on both x86 and ARM-based processors, including the Raspberry Pi. Created in 2003 by a group of like minded programmers, Kodi is a non-profit project run and developed by volunteers located around the world. More than 700 software developers have contributed to Kodi, and 300-plus translators have worked to expand its reach, making it available in more than 70 languages.",
        "url": "https://kodi.tv",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "https://web.libera.chat/#kodi",
        "twitter": "mailto:contact@kodi.tv"
    },
    "SageMath": {
        "desc": "Open-source mathematics software system",
        "tech_stack": [
            "python",
            " cython"
        ],
        "topics": [
            "mathematics",
            " education",
            " research"
        ],
        "detail": "Mathematicians, scientists, researchers, and students need a powerful tool for their work or study. SageMath is a freely available open-source mathematical software system bundling the functionality of many software libraries, exposing their features in a common interface and extending on top of this with its own powerful algorithms. By leveraging the flexibility and universality of the underlying Python interpreter, SageMath is able to accommodate for a vast range of their requirements. The mission of SageMath is to create a viable open-source alternative to all major proprietary mathematical software systems. Python is the main programming language inside the SageMath library and also the language of choice for all interactions with the built-in objects and functions for expressing mathematical concepts and calculations. Besides a command-line and programming-library interface, its primary user interface is a dynamic self-hosted website. From the perspective of a user, the interface language is Python, but with a thin extension built directly on top of it. Almost all areas of mathematics are represented in SageMath, at various levels of sophistication. This includes symbolic calculus, 2D and 3D graphics, polynomials, graph theory, group theory, abstract algebra, combinatorics, cryptography, elliptic curves and modular forms, numerical mathematics, linear algebra and matrix calculations (over various rings), support for parallel computing, and a powerful coercion framework to “mix” elements from different sets for calculations. SageMath’s features also expand into neighboring fields like Statistics and Physics.",
        "url": "https://www.sagemath.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "https://twitter.com/sagemath",
        "twitter": "mailto:tcscrims@gmail.com"
    },
    "Inkscape": {
        "desc": "Draw freely!",
        "tech_stack": [
            "python",
            " c++",
            " svg"
        ],
        "topics": [
            "web",
            " graphics",
            " design"
        ],
        "detail": "Inkscape is a free and open-source vector graphics editor used to create vector images, primarily in Scalable Vector Graphics (SVG) format",
        "url": "https://inkscape.org",
        "tags": [
            "End user applications",
            "Media"
        ],
        "discord": "https://lists.inkscape.org/postorius/lists/inkscape-devel.lists.inkscape.org/",
        "twitter": "https://twitter.com/inkscape"
    },
    "SeaQL": {
        "desc": "Building data intensive applications in Rust",
        "tech_stack": [
            "mysql",
            " postgresql",
            " rust",
            " sql",
            " sqlite"
        ],
        "topics": [
            "database",
            " library",
            " framework",
            " sql",
            " rust"
        ],
        "detail": "Our Mission\nWe help developers in building data intensive applications in Rust, whether they are web services (GraphQL, gRPC, REST), command line tools or apps.\n\nOur Vision\nIn the long term, we want to support all open source SQL, NewSQL and NoSQL databases, providing a uniform developer experience to data analytics, transaction processing and schema management.\n\nOur Values\nCommunity driven. Embrace the async Rust ecosystem. Welcome developers from other languages.\n\nOur Projects\n* SeaORM: A relational ORM to help you build web services in Rust with the familiarity of dynamic languages.\n* SeaQuery: A query builder to help you construct dynamic SQL queries in Rust.\n* SeaSchema: A library to help you manage database schema.\n* StarfishQL: A graph database and query engine to enable graph analysis and visualization on the web.",
        "url": "https://sea-ql.org",
        "tags": [
            "Data",
            "Programming languages"
        ],
        "discord": "mailto:hello@sea-ql.org",
        "twitter": "https://github.com/SeaQL/summer-of-code/discussions"
    },
    "Free and Open Source Silicon Foundation": {
        "desc": "Working together for Free and Open Source Silicon",
        "tech_stack": [
            "verilog",
            " risc-v",
            " compiler",
            " web development"
        ],
        "topics": [
            "hardware",
            " debug",
            " web services",
            " simulation",
            " electronic design tools"
        ],
        "detail": "The FOSSi (Free and Open Source Silicon) Foundation is a not-for-profit organization with the support the growing community of open source silicon hardware. We do this with a variety of activities and through Google Summer of Code we bring together enthusiastic mentees and outstanding projects. Under our umbrella are open source silicon hardware projects, operating systems and compilers for such projects, tools for electronic design automation and the related ecosystem.",
        "url": "https://www.fossi-foundation.org",
        "tags": [
            "Other",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Drupal Association": {
        "desc": "The best open source digital experience platform",
        "tech_stack": [
            "mysql",
            " javascript",
            " html",
            " php",
            " symfony"
        ],
        "topics": [
            "web",
            " cloud",
            " DXP",
            " Massive community",
            " Inclusive"
        ],
        "detail": "The Drupal Association is the non-profit organization focused on accelerating Drupal, fostering the growth of the Drupal community, and supporting the project’s vision to create a safe, secure, and open web for everyone.",
        "url": "https://drupal.org",
        "tags": [
            "Web",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "52°North Spatial Information Research GmbH": {
        "desc": "Innovative ideas & technologies in geoinformatics",
        "tech_stack": [
            "javascript",
            " android",
            " java",
            " web services",
            " ogc standards"
        ],
        "topics": [
            "citizen science",
            " spatial information infrastructures",
            " open standards",
            " data analytics",
            " Geoinformation"
        ],
        "detail": "52°North is an open source initiative in the field of geoinformatics. Core topics of our activities are for example sensor web, web-based geoprocessing and earth observation.",
        "url": "https://52north.org/",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "https://52n-gsoc.slack.com/ssb/redirect",
        "twitter": "mailto:gsoc@52north.org"
    },
    "LLVM Compiler Infrastructure": {
        "desc": "LLVM Compiler Infrastructure",
        "tech_stack": [
            "llvm",
            " c++",
            " clang",
            " mlir"
        ],
        "topics": [
            "compilers",
            " development tools",
            " libraries"
        ],
        "detail": "The LLVM Project is a collection of modular and reusable compiler and toolchain technologies. Despite its name, LLVM has little to do with traditional virtual machines. The name \"LLVM\" itself is not an acronym; it is the full name of the project. LLVM began as a research project at the University of Illinois, with the goal of providing a modern, SSA-based compilation strategy capable of supporting both static and dynamic compilation of arbitrary programming languages. Since then, LLVM has grown to be an umbrella project consisting of a number of subprojects, many of which are being used in production by a wide variety of commercial and open source projects as well as being widely used in academic research. In addition to official subprojects of LLVM, there are a broad variety of other projects that use components of LLVM for various tasks. Through these external projects you can use LLVM to compile Ruby, Python, Haskell, Rust, D, PHP, Pure, Lua, Julia, and a number of other languages. A major strength of LLVM is its versatility, flexibility, and reusability, which is why it is being used for such a wide variety of different tasks: everything from doing light-weight JIT compiles of embedded languages like Lua to compiling Fortran code for massive super computers.",
        "url": "http://www.llvm.org",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "ScummVM": {
        "desc": "Adventure and RPG preservation project",
        "tech_stack": [
            "opengl",
            " lua",
            " c++",
            " assembly",
            " sdl"
        ],
        "topics": [
            "games",
            " game engines",
            " software preservation",
            " software archeology"
        ],
        "detail": "ScummVM is a game preservation projects that celebrated its 20th anniversary last year. Originally focused on 2D Point&Click adventure games, its scope widened in 2016 to RPG thanks to a successful GSoC students, and to 3D games in 2020 after the merge with its sister project, ResidualVM. The purpose is only to replace the game executable, not to enhance or replace the game assets.",
        "url": "https://www.scummvm.org/",
        "tags": [
            "End user applications",
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "OpenVINO Toolkit": {
        "desc": "Make AI inference faster and easier to deploy!",
        "tech_stack": [
            "python",
            " c++",
            " x86"
        ],
        "topics": [
            "deep learning",
            " Neural networks",
            " Edge AI",
            " DL-inference"
        ],
        "detail": "Learning and practicing AI is not easy, deploying AI in real applications is challenging and hard. We realized that and created OpenVINO – an open-source toolkit for bringing AI models to life on the most widespread and available platforms like x86 CPUs and integrated Intel GPUs. One can use OpenVINO to optimize own model for high performance with the most advanced model optimization capabilities and run those through OpenVINO runtime on various devices. We are driven by the idea to make it easy for a regular person to learn and use AI with minimal investments and unlock innovation with the use of AI to a wide audience. Not only we allow AI inference on the most widespread and popular platforms, but also we provide pre-trained models, educational and visual demos, image annotation tools and model training templates to get you up to speed. Along with good use-case coverage and simple/educational API, OpenVINO is also a toolkit of choice for AI in production by plenty of companies, it is a fully production-ready software solution.",
        "url": "https://docs.openvino.ai/",
        "tags": [
            "Other",
            "Development tools"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Jitsi": {
        "desc": "State-of-the-art video conferencing",
        "tech_stack": [
            "javascript",
            " java",
            " react",
            " webrtc",
            " react native"
        ],
        "topics": [
            "video conferencing",
            " WebRTC"
        ],
        "detail": "Jitsi is a set of Open Source projects which empower users to deploy secure, scalable and easy to use video conferencing platforms with state-of-the-art video quality and features.",
        "url": "https://jitsi.org",
        "tags": [
            "Media",
            "Web",
            "Social and communication"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Semi Technologies": {
        "desc": "The ML-first vector search engine",
        "tech_stack": [
            "python",
            " machine learning",
            " golang",
            " vectors",
            " natural language processing"
        ],
        "topics": [
            "machine learning",
            " Vector Database",
            " Search Engines"
        ],
        "detail": "SeMI Technologies creates database software like the open-source Weaviate vector search engine. Weaviate is a low-latency vector search engine with out-of-the-box support for different media types (text, images, etc.). It offers Semantic Search, Question-Answer-Extraction, Classification, Customizable Models (TensorFlow/Keras), and more. Built from scratch in Go, Weaviate stores both objects and vectors, allowing for combining vector search with structured filtering with the fault-tolerance of a cloud-native database, all accessible through GraphQL, REST, and various language clients.",
        "url": "https://weaviate.io",
        "tags": [
            "Science and medicine",
            "Data"
        ],
        "discord": "mailto:hello@semi.technology",
        "twitter": "https://twitter.com/weaviate_io"
    },
    "BeagleBoard.org": {
        "desc": "Open hardware computing for educators and makers",
        "tech_stack": [
            "linux",
            " fpga",
            " risc-v",
            " dsp",
            " Zephyr RTOS"
        ],
        "topics": [
            "robotics",
            " iot",
            " ai",
            " software defined radio",
            " Personal Server"
        ],
        "detail": "Enabling individuals to define the connected devices in their lives, BeagleBoard.org is the open-source, community-driven hardware precursor to Raspberry Pi, continuing to improve performance, access and openness for embedded development. The community is diverse with many professional developers utilizing the open source designs to build production solutions. Supported by a non-profit foundation, the community seeks to improve access to technology for making embedded devices using open source software and hardware. On-going developments include open designs around DSP/AI/ML accelerators, RISC-V cores, FPGA-based open hardware developement, software-defined radios, robotics/motor control, privacy-oriented personal servers, musical instruments, lighting displays, and open standards that simplify and clarify embedded systems technology.",
        "url": "https://beagleboard.org",
        "tags": [
            "Science and medicine",
            "Infrastructure and cloud"
        ],
        "discord": "https://bbb.io/gsocml",
        "twitter": "mailto:gsoc@beagleboard.org"
    },
    "Liquid Galaxy project": {
        "desc": "We code immersive and interactive aps with G Earth",
        "tech_stack": [
            "python",
            " linux",
            " android",
            " flutter",
            " Google Earth"
        ],
        "topics": [
            "visualization",
            " networking",
            " maps",
            " cluster",
            " ux"
        ],
        "detail": "Liquid Galaxy is a remarkable panoramic system that is tremendously compelling. It started off as a Google 20% project to run Google Earth across a small cluster of PC's and it has grown from there! Open source applications such as the MPlayer video player have been extended to run on Liquid Galaxy. Liquid Galaxy hardware consists of one or more computers driving multiple displays. Liquid Galaxy applications have been developed using a master/slave architecture. The view orientation of each slave display is configured in reference to the view of the master display. Navigation on the system is done from the master instance and the location on the master is broadcast to the slaves over UDP. The slave instances, knowing their own locations in reference to the master, then change their views accordingly. The Liquid Galaxy Project, while making use of Google Earth software, does not develop the Google Earth code-base itself. Google Earth is not open source software, although it is free (as in beer). Instead, the Liquid Galaxy Project works on extending the Liquid Galaxy system with open source software both improving its administration and enabling open source applications, so that content of various types can be displayed in the immersive panoramic environment.",
        "url": "https://www.liquidgalaxy.eu",
        "tags": [
            "Data",
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "MetaCall": {
        "desc": "Simplifying the embedding of programming languages",
        "tech_stack": [
            "python",
            " c++",
            " rust",
            " nodejs",
            " docker"
        ],
        "topics": [
            "cloud",
            " polyglot",
            " faas",
            " languages",
            " ffi"
        ],
        "detail": "When working with different technologies and developers of different programming languages, the productivity of the entire team worsens due to the lack of interoperability and communication between them. If the developers need two technologies which are written in different programming languages, for instance, a C/C++ library called from NodeJS, the team usually needs to port to one of the two languages or write a wrapper around them. Maintaining a port of a library or the plumbing code is frequently error-prone, time-consuming, and does not add any value to the final product. The main objective of MetaCall is to provide a transparent interoperability in both ways, no matter what language you are using, so you feel like you are using a library written in the same language but in fact, it may be written in C, NodeJS or any other language. MetaCall currently provides a mechanism to introspect the types and function signatures, which allows us to provide this type info to the caller language. You can have type safety and at the same time avoid boilerplate in both directions. It addresses the main shortcomings of embedding independent languages separately. Having a common implementation with a plugin architecture allows you to implement newer languages without rewriting more code. With a single solution you get C#, Ruby, Python or any other language you prefer. We can improve the core continuously and add new languages. Finally, we are using the polyglot runtime in cloud computing so we take advantage of the interoperability capabilities and allow to build complex polyglot distributed systems with ease. It is possible to build monolithic and mono-repo projects that can be distributed and scaled separately through our Function as a Service built on top of MetaCall, allowing the developer to maximize the productivity without the need of DevOps plumbing or thinking about intercommunication protocols and architectural details.",
        "url": "https://metacall.io",
        "tags": [
            "Programming languages",
            "Infrastructure and cloud"
        ],
        "discord": "https://discord.gg/upwP4mwJWa",
        "twitter": "https://t.me/joinchat/BMSVbBatp0Vi4s5l4VgUgg"
    },
    "CircuitVerse.org": {
        "desc": "Build and learn logic circuits in the cloud!",
        "tech_stack": [
            "javascript",
            " rails",
            " canvas"
        ],
        "topics": [
            "education",
            " web",
            " simulation",
            " pedagogy",
            " digital logic design"
        ],
        "detail": "CircuitVerse is an easy to use digital logic circuit simulator which aims at providing a platform to create, share and learn digital circuits. It can run on almost any device without the need for installing any software. The platform has been designed for use by students, professionals and hobbyists alike. The vision is to develop a community around the platform that will aid students to self-learn digital logic design. The platform is currently used by several universities worldwide. Apart from the simulator, users can create, learn, collaborate and share their work. Teachers can create groups and host assignments on the platform. The platform’s impact has been more evident than ever in the Covid 19 pandemic as CircuitVerse enabled schools and colleges to move their courses online.",
        "url": "http://circuitverse.org/",
        "tags": [
            "Science and medicine",
            "End user applications"
        ],
        "discord": "https://github.com/CircuitVerse/CircuitVerse/discussions",
        "twitter": "https://blog.circuitverse.org/"
    },
    "AnkiDroid": {
        "desc": "AnkiDroid makes remembering things easy",
        "tech_stack": [
            "android",
            " java",
            " rust",
            " kotlin",
            " mobile"
        ],
        "topics": [
            "education",
            " mobile",
            " android",
            " user generated content",
            " Flashcards"
        ],
        "detail": "Memorize anything with AnkiDroid!\n\nAnkiDroid lets you learn flashcards very efficiently by showing them just before you would forget. It is fully compatible with the spaced repetition software Anki (including synchronization), which is available for Windows/Mac/Linux/ChromeOS.\n\nStudy all sorts of things wherever and whenever you want. Make good use of idle times on bus trips, in supermarket queues or any other waiting situation!\n\nCreate your own flashcard decks or download free decks compiled for many languages and topics (more than 6000 available).\n\nAdd material through the desktop application Anki or directly through AnkiDroid. The application even supports adding material automatically from a dictionary!\n\n★ Key features:\n• supported flashcard contents: text, images, sounds, LaTeX & MathJax\n• spaced repetition (supermemo 2 algorithm)\n• text-to-speech integration\n• check your pronunciation\n• more than 6000 premade decks\n• progress widget\n• detailed statistics\n• syncing with AnkiWeb\n• open source",
        "url": "https://github.com/ankidroid/Anki-Android",
        "tags": [
            "End user applications"
        ],
        "discord": "https://groups.google.com/forum/#!forum/anki-android",
        "twitter": "https://twitter.com/ankidroid"
    },
    "OpenAstronomy": {
        "desc": "Look at the Universe with the power of open source",
        "tech_stack": [
            "python",
            " javascript",
            " julia",
            " css"
        ],
        "topics": [
            "astronomy",
            " solar physics",
            " high energy astrophysics"
        ],
        "detail": "OpenAstronomy is a collaboration between open source astronomy and astrophysics projects that are used by researchers and engineers around the world to study our universe either by analysing the data obtained from amazing instruments like the [James Webb Space telescope](https://jwst.nasa.gov/), the [Square Kilometer Array](https://www.skatelescope.org/) or the [Solar Dynamic Observatory](http://sdo.gsfc.nasa.gov/), developing very sophisticated numerical models (eg. [FLASH](http://flash.uchicago.edu/)) or designing interplanetary trajectories for human-made spacecraft. The analysis of such data helps multiple types of research, from being able to forecast solar storms to detect planets in other stars, to understanding how galaxies are formed to explain the expansion and the origin of the universe. OpenAstronomy is currently formed by [16 organisations](http://openastronomy.org/members/) that develop tools for different aspects of astronomy. The range of topics covered by these projects is wide, for example: - [Astropy](http://astropy.org) is a general Python library for astronomy, providing common tools such as celestial coordinates, image processing, tabular data reading and writing, units and support for astronomy-specific file formats; - [SunPy](http://sunpy.org) provides utilities for obtaining and representing solar physics data, with clients for some of the largest online solar physics data archives and solar specific analysis and visualisation code; - [Glue](http://www.glueviz.org/) is a data visualization application and library to explore relationships within and among related datasets. - [Julia Astro](http://juliaastro.github.io/) is a set of packages for general astronomy and astrophysics analysis using Julia; - And more! As a single organisation, we aim to strengthen collaborations between the different sub-organisations, and at the same time increase the awareness among our users on the capabilities of our \"sister\" projects.",
        "url": "https://openastronomy.org/",
        "tags": [
            "Science and medicine"
        ],
        "discord": "https://openastronomy.element.io/#/room/#openastronomy:openastronomy.org",
        "twitter": "https://community.openastronomy.org/"
    },
    "FFmpeg": {
        "desc": "Record, convert and stream audio & video",
        "tech_stack": [
            "c",
            " git",
            " asm"
        ],
        "topics": [
            "audio",
            " video",
            " subtitles",
            " multimedia"
        ],
        "detail": "FFmpeg is the leading multimedia framework, able to decode, encode, transcode, mux, demux, stream, filter and play pretty much anything that humans and machines have created. It supports the most obscure ancient formats up to the cutting edge. No matter if they were designed by some standards committee, the community or a corporation. It is also highly portable: FFmpeg compiles, runs, and passes our testing infrastructure FATE across Linux, Mac OS X, Microsoft.",
        "url": "https://ffmpeg.org/",
        "tags": [
            "Media"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "CRIU": {
        "desc": "Chekpoint/Restore for Linux tasks and containers",
        "tech_stack": [
            "c",
            " python",
            " linux",
            " go"
        ],
        "topics": [
            "cloud",
            " containers",
            " Checkpoint/Restore"
        ],
        "detail": "CRIU (stands for Checkpoint/Restore In Userspace), is a Linux software. It can freeze a running container (or an individual application) and checkpoint its state to disk. The data saved can be used to restore the application and run it exactly as it was during the time of the freeze. Using this functionality, application or container live migration, snapshots, remote debugging, and many other things are now possible. CRIU is packaged for all leading Linux distributions and it is integrated wit lots of popular projects such as Docker, Podman, LXC/LXD, OpenVZ, runc, open-mpi and others",
        "url": "https://criu.org",
        "tags": [
            "Operating systems",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Micro Electronics Research Lab - UITU": {
        "desc": "Accelerating Engineering Innovation",
        "tech_stack": [
            "RISCV",
            " Processor",
            " Hardware",
            " systemonchip",
            " memory"
        ],
        "topics": [
            "iot",
            " embedded",
            " Processor",
            " System on Chip",
            " RISC-V"
        ],
        "detail": "A non-profit organization fostering research on IoT, AI and ML based architectures leveraging the open-source RISC-V ISA. The main purpose of this Lab is to train undergraduate students for future Silicon industry.",
        "url": "https://www.merledupk.org",
        "tags": [
            "Other"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "FRRouting": {
        "desc": "Routing suite including BGP, IS-IS, LDP, OSPF, PIM",
        "tech_stack": [
            "c",
            " linux",
            " networking",
            " linux kernel",
            " routing"
        ],
        "topics": [
            "networking",
            " software defined networking",
            " linux",
            " routing",
            " systems"
        ],
        "detail": "FRRouting (FRR) is an IP routing protocol suite for Linux and Unix platforms which includes protocol daemons for BGP, IS-IS, LDP, OSPF, PIM, PBR, RIP, BFD, Babel, OpenFabric, VRRP, EIGRP, and NHRP. FRR’s seamless integration with the native Linux/Unix IP networking stacks makes it applicable to a wide variety of use cases including connecting hosts/VMs/containers to the network, advertising network services, LAN switching and routing, Internet access routers, and Internet peering. FRR is a high performance suite written primarily in C. It can easily handle full Internet routing tables and is suitable for use on hardware ranging from cheap SBCs to commercial grade routers. It is actively used in production by hundreds of companies, universities, research labs and governments. A Linux Foundation Collaborative Project, FRR is distributed under GPLv2, with development modeled after the Linux kernel. Anyone may contribute features, bug fixes, tools, documentation updates, or anything else. FRR is a fork of Quagga.",
        "url": "https://frrouting.org/",
        "tags": [
            "Other",
            "Infrastructure and cloud"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "ReactOS Foundation": {
        "desc": "Open your windows to freedom!",
        "tech_stack": [
            "c",
            " c++",
            " win32",
            " nt"
        ],
        "topics": [
            "operating systems",
            " kernel",
            " drivers",
            " windows",
            " system programming"
        ],
        "detail": "Imagine running your favorite Windows applications and drivers in an open-source environment you can trust. That's ReactOS. A free, open source, Windows compatible operating system. It's written from scratch, not based on Linux, with 9,000,000+ lines of code and growing. More than 100 developers contributed along the years It aims to be lightweight with only 500MB HDD and 96MB RAM as the current minimum requirement. Developers enjoy a fast, CMake based build system that supports GCC, Clang and MSVC toolchains (including Visual Studio solutions support).",
        "url": "https://reactos.org",
        "tags": [
            "Operating systems"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Wikimedia Foundation": {
        "desc": "Brings free educational content to the world",
        "tech_stack": [
            "python",
            " javascript",
            " html",
            " php",
            " css"
        ],
        "topics": [
            "semantic web",
            " wikipedia",
            " wikimedia",
            " mediawiki",
            " i18n"
        ],
        "detail": "Wikimedia strives to bring about a world in which every single human being can freely share in the sum of all knowledge; through various projects, chapters, and the support structure of the non-profit Wikimedia Foundation. Wikimedia officially supports 13 projects, including Wikipedia, the seventh most popular site on the internet. Wikipedia receives over 20 billion global page views every month and is available in over 300 languages. The tech behind it ensures that our projects are fast, reliable, and open to all. We design and build the open-source technology that powers Wikimedia projects from hosting Wikipedia to creating edit-checking artificial intelligence (AI). Community volunteers and Foundation technologists collaborate on MediaWiki, which makes sharing free knowledge possible. Read more about Wikimedia on our homepage.",
        "url": "http://wikimediafoundation.org/",
        "tags": [
            "Web"
        ],
        "discord": "NA",
        "twitter": "NA"
    },
    "Homebrew": {
        "desc": "The Missing Package Manager for macOS (or Linux)",
        "tech_stack": [
            "linux",
            " ruby",
            " macos"
        ],
        "topics": [
            "linux",
            " package manager",
            " macos"
        ],
        "detail": "Homebrew is a package manager for software that isn't provided by the OS. Homebrew installs packages to their own directory and then symlinks their files into /usr/local (on macOS Intel). Homebrew won’t install files outside its prefix and you can place a Homebrew installation wherever you like. Homebrew is written in Ruby and is designed to be easy to use, easy to develop with and easy to contribute to.",
        "url": "https://brew.sh",
        "tags": [
            "Programming languages",
            "Development tools"
        ],
        "discord": "https://github.com/Homebrew/brew#contributing",
        "twitter": "https://github.com/Homebrew/discussions/discussions"
    },
    "INCF": {
        "desc": "An open & FAIR neuroscience standards organization",
        "tech_stack": [
            "python",
            " javascript",
            " java",
            " c++",
            " gpu"
        ],
        "topics": [
            "machine learning",
            " data visualization",
            " neuroscience",
            " brain modelling",
            " neuroimage processing"
        ],
        "detail": "The International Neuroinformatics Coordinating Facility (INCF; www.incf.org) is an international organization launched in 2005, following a proposal from the Global Science Forum of the OECD. INCF was established to facilitate and promote the sharing of data and computing resources in the international neuroscience community. A larger objective of INCF is to help develop scalable, portable, and extensible applications that can be used by neuroscience laboratories worldwide. The mission of INCF is to make neuroscience FAIR (Findable, Accessible, Interoperable and Reusable) by sharing and integrating neuroscience data and knowledge worldwide. We foster scientific community collaboration to develop standards for data sharing, analysis modeling and simulation in order to catalyze insights into brain function in health and disease. INCF activities are open to all who can contribute to neuroinformatics at the international level. We have a global community of neuroscience researchers working on new and improved tools for all of neuroscience – enabling other researchers to make more and faster discoveries, and improving our understanding of the brain.",
        "url": "https://www.incf.org",
        "tags": [
            "Science and medicine"
        ],
        "discord": "NA",
        "twitter": "NA"
    }
}